#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Assets_Asset

#include "Basic.hpp"


namespace SDK::Params
{

// Function Assets_Asset.Asset.create_Internal
// 0x0020 (0x0020 - 0x0000)
struct Asset_create_Internal final
{
public:
	class UClass*                                 __verse_0x69F1185B_assetClass;                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0x5D4EDCE6_pathToAsset;                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class UAsset*                                 RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Assets_Asset.Asset.asyncLoad
// 0x0008 (0x0008 - 0x0000)
struct Asset_asyncLoad final
{
public:
	class UStickyEvent*                           RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Assets_Asset.Asset.getAsyncLoadEvent
// 0x0008 (0x0008 - 0x0000)
struct Asset_getAsyncLoadEvent final
{
public:
	class UStickyEvent*                           RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Assets_Asset.Asset.Load
// 0x0001 (0x0001 - 0x0000)
struct Asset_Load final
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

}

