#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Assets_Sound_V

#include "Basic.hpp"


namespace SDK::Params
{

// Function Assets_Sound_V.Sound_V.Create
// 0x0028 (0x0028 - 0x0000)
struct Sound_V_Create final
{
public:
	class FString                                 __verse_0x5D4EDCE6_pathToAsset;                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class USound_V*                               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsset*                                 _TEMP_0;                                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsset*                                 _TEMP_1;                                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Assets_Sound_V.Sound_V.createAndLoad
// 0x0030 (0x0030 - 0x0000)
struct Sound_V_createAndLoad final
{
public:
	class FString                                 __verse_0x5D4EDCE6_pathToAsset;                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class USound_V*                               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USound_V*                               __verse_0xC53A5C85_NewAsset_0;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsset*                                 _TEMP_0;                                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsset*                                 _TEMP_1;                                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

