#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Athena_Player_SneakySnowmanV3

#include "Basic.hpp"

#include "Athena_Player_SneakySnowmanV2_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Player_SneakySnowmanV3.Athena_Player_SneakySnowmanV3_C
// 0x0068 (0x0A88 - 0x0A20)
class AAthena_Player_SneakySnowmanV3_C final : public AAthena_Player_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Player_SneakySnowmanV3_C;    // 0x0A20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Dead;                                              // 0x0A28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A29[0x7];                                      // 0x0A29(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         LaunchSpeed;                                       // 0x0A30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 DamageCauser;                                      // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FrostExplosionRadius;                              // 0x0A60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_Player_SneakySnowmanV3(int32 EntryPoint);
	void OnInteractWithFake(const class AFortPawn* InteractingPawn);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser_0, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser_0, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Player_SneakySnowmanV3_C">();
	}
	static class AAthena_Player_SneakySnowmanV3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Player_SneakySnowmanV3_C>();
	}
};

}

