#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AthenaChatWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaChatWidget.AthenaChatWidget_C.ExecuteUbergraph_AthenaChatWidget
// 0x0018 (0x0018 - 0x0000)
struct AthenaChatWidget_C_ExecuteUbergraph_AthenaChatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFocus;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UAthenaChatWidgetModalWrapper_C*        K2Node_DynamicCast_AsAthena_Chat_Widget_Modal_Wrapper; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function AthenaChatWidget.AthenaChatWidget_C.FocusChat
// 0x0001 (0x0001 - 0x0000)
struct AthenaChatWidget_C_FocusChat final
{
public:
	bool                                          bFocus;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

