#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Athena_Prop_CoolCarpet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Athena_Prop_SneakySnowmanV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C
// 0x0060 (0x0D28 - 0x0CC8)
class AAthena_Prop_CoolCarpet_C final : public AAthena_Prop_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_CoolCarpet_C;           // 0x0CC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x0CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenFlaps_Rotation_FDF331244F066E298266B69ACE6D4998; // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenFlaps__Direction_FDF331244F066E298266B69ACE6D4998; // 0x0CEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CED[0x3];                                      // 0x0CED(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     OpenFlaps;                                         // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandMatInt;                                        // 0x0CF8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatIntOverride;                                    // 0x0CFC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CanHideInProp;                                     // 0x0D00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_Prop_CoolCarpet(int32 EntryPoint);
	void ReceiveBeginPlay();
	void CloseFlaps();
	void OpenFlapsMulticast();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void OpenFlaps__UpdateFunc();
	void OpenFlaps__FinishedFunc();
	void UserConstructionScript();
	void GetMaterialInt(int32* MatInt);
	void OnRep_MatIntOverride();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_CoolCarpet_C">();
	}
	static class AAthena_Prop_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_CoolCarpet_C>();
	}
};

}

