#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Athena_Fake_CoolCarpet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Athena_Fake_SNeakySnowmanV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Fake_CoolCarpet.Athena_Fake_CoolCarpet_C
// 0x0030 (0x0820 - 0x07F0)
class AAthena_Fake_CoolCarpet_C final : public AAthena_Fake_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Fake_CoolCarpet_C;           // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Flaps_Rotation_F5AB76D74BCF44B635766F92F043E4C1;   // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Flaps__Direction_F5AB76D74BCF44B635766F92F043E4C1; // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_815[0x3];                                      // 0x0815(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Flaps;                                             // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Fake_CoolCarpet(int32 EntryPoint);
	void OnDamaged_(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveBeginPlay();
	void CloseFlaps();
	void OpenFlaps();
	void Flaps__UpdateFunc();
	void Flaps__FinishedFunc();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Fake_CoolCarpet_C">();
	}
	static class AAthena_Fake_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Fake_CoolCarpet_C>();
	}
};

}

