#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AugmentedReality_structs.hpp"


namespace SDK::Params
{

// Function AugmentedReality.ARBlueprintLibrary.AddManualEnvironmentCaptureProbe
// 0x001C (0x001C - 0x0000)
struct ARBlueprintLibrary_AddManualEnvironmentCaptureProbe final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AugmentedReality.ARBlueprintLibrary.AddRuntimeCandidateImage
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_AddRuntimeCandidateImage final
{
public:
	class UARSessionConfig*                       SessionConfig;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CandidateTexture;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FriendlyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalWidth;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UARCandidateImage*                      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.DebugDrawPin
// 0x0028 (0x0028 - 0x0000)
struct ARBlueprintLibrary_DebugDrawPin final
{
public:
	class UARPin*                                 ARPin;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.DebugDrawTrackedGeometry
// 0x0028 (0x0028 - 0x0000)
struct ARBlueprintLibrary_DebugDrawTrackedGeometry final
{
public:
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutlineThickness;                                  // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllGeometries
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllGeometries final
{
public:
	TArray<class UARTrackedGeometry*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllPins
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllPins final
{
public:
	TArray<class UARPin*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllTracked2DPoses
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTracked2DPoses final
{
public:
	TArray<struct FARPose2D>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedEnvironmentCaptureProbes
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes final
{
public:
	TArray<class UAREnvironmentCaptureProbe*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedImages
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedImages final
{
public:
	TArray<class UARTrackedImage*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPlanes
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPlanes final
{
public:
	TArray<class UARPlaneGeometry*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPoints
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPoints final
{
public:
	TArray<class UARTrackedPoint*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPoses
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPoses final
{
public:
	TArray<class UARTrackedPose*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetARSessionStatus
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_GetARSessionStatus final
{
public:
	struct FARSessionStatus                       ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetCameraDepth
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCameraDepth final
{
public:
	class UARTextureCameraDepth*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetCameraImage
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCameraImage final
{
public:
	class UARTextureCameraImage*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetCurrentLightEstimate
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCurrentLightEstimate final
{
public:
	class UARLightEstimate*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetPersonSegmentationDepthImage
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetPersonSegmentationDepthImage final
{
public:
	class UARTextureCameraImage*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetPersonSegmentationImage
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetPersonSegmentationImage final
{
public:
	class UARTextureCameraImage*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetPointCloud
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetPointCloud final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetSessionConfig
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetSessionConfig final
{
public:
	class UARSessionConfig*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetSupportedVideoFormats
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_GetSupportedVideoFormats final
{
public:
	EARSessionType                                SessionType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FARVideoFormat>                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetTrackingQuality
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetTrackingQuality final
{
public:
	EARTrackingQuality                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetTrackingQualityReason
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetTrackingQualityReason final
{
public:
	EARTrackingQualityReason                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.GetWorldMappingStatus
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetWorldMappingStatus final
{
public:
	EARWorldMappingState                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.IsARSupported
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_IsARSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.IsSessionTrackingFeatureSupported
// 0x0003 (0x0003 - 0x0000)
struct ARBlueprintLibrary_IsSessionTrackingFeatureSupported final
{
public:
	EARSessionType                                SessionType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EARSessionTrackingFeature                     SessionTrackingFeature;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.IsSessionTypeSupported
// 0x0002 (0x0002 - 0x0000)
struct ARBlueprintLibrary_IsSessionTypeSupported final
{
public:
	EARSessionType                                SessionType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.LineTraceTrackedObjects
// 0x0020 (0x0020 - 0x0000)
struct ARBlueprintLibrary_LineTraceTrackedObjects final
{
public:
	struct FVector2D                              ScreenCoord;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestFeaturePoints;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestGroundPlane;                                  // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneExtents;                                 // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneBoundaryPolygon;                         // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FARTraceResult>                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.LineTraceTrackedObjects3D
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_LineTraceTrackedObjects3D final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x000C(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestFeaturePoints;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestGroundPlane;                                  // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneExtents;                                 // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestPlaneBoundaryPolygon;                         // 0x001B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FARTraceResult>                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.PinComponent
// 0x0060 (0x0060 - 0x0000)
struct ARBlueprintLibrary_PinComponent final
{
public:
	class USceneComponent*                        ComponentToPin;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             PinToWorldTransform;                               // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DebugName;                                         // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARPin*                                 ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AugmentedReality.ARBlueprintLibrary.PinComponentToTraceResult
// 0x0080 (0x0080 - 0x0000)
struct ARBlueprintLibrary_PinComponentToTraceResult final
{
public:
	class USceneComponent*                        ComponentToPin;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FARTraceResult                         TraceResult;                                       // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   DebugName;                                         // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARPin*                                 ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.RemovePin
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_RemovePin final
{
public:
	class UARPin*                                 PinToRemove;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.SetAlignmentTransform
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_SetAlignmentTransform final
{
public:
	struct FTransform                             InAlignmentTransform;                              // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.StartARSession
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_StartARSession final
{
public:
	class UARSessionConfig*                       SessionConfig;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBlueprintLibrary.UnpinComponent
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_UnpinComponent final
{
public:
	class USceneComponent*                        ComponentToUnpin;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTraceResultLibrary.GetDistanceFromCamera
// 0x0070 (0x0070 - 0x0000)
struct ARTraceResultLibrary_GetDistanceFromCamera final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AugmentedReality.ARTraceResultLibrary.GetLocalToTrackingTransform
// 0x0090 (0x0090 - 0x0000)
struct ARTraceResultLibrary_GetLocalToTrackingTransform final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTraceResultLibrary.GetLocalToWorldTransform
// 0x0090 (0x0090 - 0x0000)
struct ARTraceResultLibrary_GetLocalToWorldTransform final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTraceResultLibrary.GetTraceChannel
// 0x0070 (0x0070 - 0x0000)
struct ARTraceResultLibrary_GetTraceChannel final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EARLineTraceChannels                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AugmentedReality.ARTraceResultLibrary.GetTrackedGeometry
// 0x0070 (0x0070 - 0x0000)
struct ARTraceResultLibrary_GetTrackedGeometry final
{
public:
	struct FARTraceResult                         TraceResult;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UARTrackedGeometry*                     ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function AugmentedReality.ARSaveWorldAsyncTaskBlueprintProxy.ARSaveWorld
// 0x0010 (0x0010 - 0x0000)
struct ARSaveWorldAsyncTaskBlueprintProxy_ARSaveWorld final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARSaveWorldAsyncTaskBlueprintProxy*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARGetCandidateObjectAsyncTaskBlueprintProxy.ARGetCandidateObject
// 0x0028 (0x0028 - 0x0000)
struct ARGetCandidateObjectAsyncTaskBlueprintProxy_ARGetCandidateObject final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARGetCandidateObjectAsyncTaskBlueprintProxy* ReturnValue;                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBasicLightEstimate.GetAmbientColor
// 0x0010 (0x0010 - 0x0000)
struct ARBasicLightEstimate_GetAmbientColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBasicLightEstimate.GetAmbientColorTemperatureKelvin
// 0x0004 (0x0004 - 0x0000)
struct ARBasicLightEstimate_GetAmbientColorTemperatureKelvin final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARBasicLightEstimate.GetAmbientIntensityLumens
// 0x0004 (0x0004 - 0x0000)
struct ARBasicLightEstimate_GetAmbientIntensityLumens final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPin.DebugDraw
// 0x0020 (0x0020 - 0x0000)
struct ARPin_DebugDraw final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPin.GetDebugName
// 0x0008 (0x0008 - 0x0000)
struct ARPin_GetDebugName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPin.GetLocalToTrackingTransform
// 0x0030 (0x0030 - 0x0000)
struct ARPin_GetLocalToTrackingTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPin.GetLocalToWorldTransform
// 0x0030 (0x0030 - 0x0000)
struct ARPin_GetLocalToWorldTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPin.GetPinnedComponent
// 0x0008 (0x0008 - 0x0000)
struct ARPin_GetPinnedComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPin.GetTrackedGeometry
// 0x0008 (0x0008 - 0x0000)
struct ARPin_GetTrackedGeometry final
{
public:
	class UARTrackedGeometry*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPin.GetTrackingState
// 0x0001 (0x0001 - 0x0000)
struct ARPin_GetTrackingState final
{
public:
	EARTrackingState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.AddCandidateImage
// 0x0008 (0x0008 - 0x0000)
struct ARSessionConfig_AddCandidateImage final
{
public:
	class UARCandidateImage*                      NewCandidateImage;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.AddCandidateObject
// 0x0008 (0x0008 - 0x0000)
struct ARSessionConfig_AddCandidateObject final
{
public:
	class UARCandidateObject*                     CandidateObject;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetCandidateObjectList
// 0x0010 (0x0010 - 0x0000)
struct ARSessionConfig_SetCandidateObjectList final
{
public:
	TArray<class UARCandidateObject*>             InCandidateObjects;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetDesiredVideoFormat
// 0x000C (0x000C - 0x0000)
struct ARSessionConfig_SetDesiredVideoFormat final
{
public:
	struct FARVideoFormat                         NewFormat;                                         // 0x0000(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetEnableAutoFocus
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_SetEnableAutoFocus final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetFaceTrackingDirection
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_SetFaceTrackingDirection final
{
public:
	EARFaceTrackingDirection                      InDirection;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetFaceTrackingUpdate
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_SetFaceTrackingUpdate final
{
public:
	EARFaceTrackingUpdate                         InUpdate;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetResetCameraTracking
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_SetResetCameraTracking final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetResetTrackedObjects
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_SetResetTrackedObjects final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetSessionTrackingFeatureToEnable
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_SetSessionTrackingFeatureToEnable final
{
public:
	EARSessionTrackingFeature                     InSessionTrackingFeature;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.SetWorldMapData
// 0x0010 (0x0010 - 0x0000)
struct ARSessionConfig_SetWorldMapData final
{
public:
	TArray<uint8>                                 WorldMapData_0;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetCandidateImageList
// 0x0010 (0x0010 - 0x0000)
struct ARSessionConfig_GetCandidateImageList final
{
public:
	TArray<class UARCandidateImage*>              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetCandidateObjectList
// 0x0010 (0x0010 - 0x0000)
struct ARSessionConfig_GetCandidateObjectList final
{
public:
	TArray<class UARCandidateObject*>             ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetDesiredVideoFormat
// 0x000C (0x000C - 0x0000)
struct ARSessionConfig_GetDesiredVideoFormat final
{
public:
	struct FARVideoFormat                         ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetEnabledSessionTrackingFeature
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetEnabledSessionTrackingFeature final
{
public:
	EARSessionTrackingFeature                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetEnvironmentCaptureProbeType
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetEnvironmentCaptureProbeType final
{
public:
	EAREnvironmentCaptureProbeType                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetFaceTrackingDirection
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetFaceTrackingDirection final
{
public:
	EARFaceTrackingDirection                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetFaceTrackingUpdate
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetFaceTrackingUpdate final
{
public:
	EARFaceTrackingUpdate                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetFrameSyncMode
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetFrameSyncMode final
{
public:
	EARFrameSyncMode                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetLightEstimationMode
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetLightEstimationMode final
{
public:
	EARLightEstimationMode                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetMaxNumSimultaneousImagesTracked
// 0x0004 (0x0004 - 0x0000)
struct ARSessionConfig_GetMaxNumSimultaneousImagesTracked final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetPlaneDetectionMode
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetPlaneDetectionMode final
{
public:
	EARPlaneDetectionMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetSessionType
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetSessionType final
{
public:
	EARSessionType                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetWorldAlignment
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_GetWorldAlignment final
{
public:
	EARWorldAlignment                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.GetWorldMapData
// 0x0010 (0x0010 - 0x0000)
struct ARSessionConfig_GetWorldMapData final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.ShouldEnableAutoFocus
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_ShouldEnableAutoFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.ShouldEnableCameraTracking
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_ShouldEnableCameraTracking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.ShouldRenderCameraOverlay
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_ShouldRenderCameraOverlay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.ShouldResetCameraTracking
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_ShouldResetCameraTracking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSessionConfig.ShouldResetTrackedObjects
// 0x0001 (0x0001 - 0x0000)
struct ARSessionConfig_ShouldResetTrackedObjects final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSharedWorldGameMode.GetARSharedWorldGameState
// 0x0008 (0x0008 - 0x0000)
struct ARSharedWorldGameMode_GetARSharedWorldGameState final
{
public:
	class AARSharedWorldGameState*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSharedWorldGameMode.SetARSharedWorldData
// 0x0010 (0x0010 - 0x0000)
struct ARSharedWorldGameMode_SetARSharedWorldData final
{
public:
	TArray<uint8>                                 ARWorldData;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSharedWorldGameMode.SetPreviewImageData
// 0x0010 (0x0010 - 0x0000)
struct ARSharedWorldGameMode_SetPreviewImageData final
{
public:
	TArray<uint8>                                 ImageData;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSharedWorldPlayerController.ClientInitSharedWorld
// 0x0008 (0x0008 - 0x0000)
struct ARSharedWorldPlayerController_ClientInitSharedWorld final
{
public:
	int32                                         PreviewImageSize;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ARWorldDataSize;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSharedWorldPlayerController.ClientUpdateARWorldData
// 0x0018 (0x0018 - 0x0000)
struct ARSharedWorldPlayerController_ClientUpdateARWorldData final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<uint8>                                 Buffer;                                            // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSharedWorldPlayerController.ClientUpdatePreviewImageData
// 0x0018 (0x0018 - 0x0000)
struct ARSharedWorldPlayerController_ClientUpdatePreviewImageData final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<uint8>                                 Buffer;                                            // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARSkyLight.SetEnvironmentCaptureProbe
// 0x0008 (0x0008 - 0x0000)
struct ARSkyLight_SetEnvironmentCaptureProbe final
{
public:
	class UAREnvironmentCaptureProbe*             InCaptureProbe;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetUnderlyingMesh
// 0x0008 (0x0008 - 0x0000)
struct ARTrackedGeometry_GetUnderlyingMesh final
{
public:
	class UMRMeshComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetDebugName
// 0x0008 (0x0008 - 0x0000)
struct ARTrackedGeometry_GetDebugName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetLastUpdateFrameNumber
// 0x0004 (0x0004 - 0x0000)
struct ARTrackedGeometry_GetLastUpdateFrameNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetLastUpdateTimestamp
// 0x0004 (0x0004 - 0x0000)
struct ARTrackedGeometry_GetLastUpdateTimestamp final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetLocalToTrackingTransform
// 0x0030 (0x0030 - 0x0000)
struct ARTrackedGeometry_GetLocalToTrackingTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetLocalToWorldTransform
// 0x0030 (0x0030 - 0x0000)
struct ARTrackedGeometry_GetLocalToWorldTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetObjectClassification
// 0x0001 (0x0001 - 0x0000)
struct ARTrackedGeometry_GetObjectClassification final
{
public:
	EARObjectClassification                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.GetTrackingState
// 0x0001 (0x0001 - 0x0000)
struct ARTrackedGeometry_GetTrackingState final
{
public:
	EARTrackingState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedGeometry.IsTracked
// 0x0001 (0x0001 - 0x0000)
struct ARTrackedGeometry_IsTracked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetBoundaryPolygonInLocalSpace
// 0x0010 (0x0010 - 0x0000)
struct ARPlaneGeometry_GetBoundaryPolygonInLocalSpace final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetCenter
// 0x000C (0x000C - 0x0000)
struct ARPlaneGeometry_GetCenter final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetExtent
// 0x000C (0x000C - 0x0000)
struct ARPlaneGeometry_GetExtent final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetOrientation
// 0x0001 (0x0001 - 0x0000)
struct ARPlaneGeometry_GetOrientation final
{
public:
	EARPlaneOrientation                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARPlaneGeometry.GetSubsumedBy
// 0x0008 (0x0008 - 0x0000)
struct ARPlaneGeometry_GetSubsumedBy final
{
public:
	class UARPlaneGeometry*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedImage.GetEstimateSize
// 0x0008 (0x0008 - 0x0000)
struct ARTrackedImage_GetEstimateSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedImage.GetDetectedImage
// 0x0008 (0x0008 - 0x0000)
struct ARTrackedImage_GetDetectedImage final
{
public:
	class UARCandidateImage*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARFaceGeometry.GetBlendShapes
// 0x0050 (0x0050 - 0x0000)
struct ARFaceGeometry_GetBlendShapes final
{
public:
	TMap<EARFaceBlendShape, float>                ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARFaceGeometry.GetBlendShapeValue
// 0x0008 (0x0008 - 0x0000)
struct ARFaceGeometry_GetBlendShapeValue final
{
public:
	EARFaceBlendShape                             BlendShape;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARFaceGeometry.GetLocalSpaceEyeTransform
// 0x0040 (0x0040 - 0x0000)
struct ARFaceGeometry_GetLocalSpaceEyeTransform final
{
public:
	EAREye                                        Eye;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARFaceGeometry.GetWorldSpaceEyeTransform
// 0x0040 (0x0040 - 0x0000)
struct ARFaceGeometry_GetWorldSpaceEyeTransform final
{
public:
	EAREye                                        Eye;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.AREnvironmentCaptureProbe.GetEnvironmentCaptureTexture
// 0x0008 (0x0008 - 0x0000)
struct AREnvironmentCaptureProbe_GetEnvironmentCaptureTexture final
{
public:
	class UAREnvironmentCaptureProbeTexture*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.AREnvironmentCaptureProbe.GetExtent
// 0x000C (0x000C - 0x0000)
struct AREnvironmentCaptureProbe_GetExtent final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedObject.GetDetectedObject
// 0x0008 (0x0008 - 0x0000)
struct ARTrackedObject_GetDetectedObject final
{
public:
	class UARCandidateObject*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARTrackedPose.GetTrackedPoseData
// 0x0050 (0x0050 - 0x0000)
struct ARTrackedPose_GetTrackedPoseData final
{
public:
	struct FARPose3D                              ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARCandidateImage.GetCandidateTexture
// 0x0008 (0x0008 - 0x0000)
struct ARCandidateImage_GetCandidateTexture final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARCandidateImage.GetFriendlyName
// 0x0010 (0x0010 - 0x0000)
struct ARCandidateImage_GetFriendlyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AugmentedReality.ARCandidateImage.GetOrientation
// 0x0001 (0x0001 - 0x0000)
struct ARCandidateImage_GetOrientation final
{
public:
