#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_BountyPuckWorldWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_BountyPuckWorldWidget.B_BountyPuckWorldWidget_C
// 0x00D0 (0x02F0 - 0x0220)
class AB_BountyPuckWorldWidget_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       BountyPuckWidget_TargetValue;                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Hologram;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BountyPuckDeactivation_ActivationTrack_8BE372F64D559C98A2738A9F29043B33; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BountyPuckDeactivation__Direction_8BE372F64D559C98A2738A9F29043B33; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     BountyPuckDeactivation;                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BountyPuckActivation_ActivationTrack_178551224ED2BC9BDE3A5882EDF57DDC; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BountyPuckActivation__Direction_178551224ED2BC9BDE3A5882EDF57DDC; // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     BountyPuckActivation;                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MInterface_Hologram;                               // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MInstance_Hologram;                                // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NS_MaterialName;                                   // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NS_ProfileImageName;                               // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NS_RarityColorName;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   BountyValueTextFormat;                             // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   SlateColor_ParameterName;                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NiagaraVariableName_Activation;                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraVariableValue_Activation_Max;               // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraVariableValue_Activation_Min;               // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BountPuckWidget_TargetValue_RelativeLocation;      // 0x02B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         HologramMaxDrawDistance;                           // 0x02C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_BountyPuckWorldWidget(int32 EntryPoint);
	void SetPuckValueVisibility(bool bVisible);
	void ReceiveBeginPlay();
	void DeactivateHologramTarget(bool AnimateOut);
	void SetTargetInfo(const class FString& TargetName, int32 TotalReward, EFortRarity Rarity, class AFortPlayerStateAthena* TargetPlayer);
	void ActivateHologramTarget(bool AnimateIn);
	void ReceiveTick(float DeltaSeconds);
	void BountyPuckDeactivation__UpdateFunc();
	void BountyPuckDeactivation__FinishedFunc();
	void BountyPuckActivation__UpdateFunc();
	void BountyPuckActivation__FinishedFunc();
	void Rotate_to_Face_Camera(class UWidgetComponent* WidgetComponent);
	void UpdatePuckWidget(class UWidgetComponent* PuckWidget, const class FText& TextToDisplay, EFortRarity TargetRarity);
	void OnBountyPuckEquipped();
	void PlayPuckWidgetOnEquippedAnimation(class UWidgetComponent* PuckWidget);
	void OnBountyPuckUnequipped();
	void Update_Widget_Location_and_Rotation();
	void Update_Relative_Location(class UWidgetComponent* WidgetComponent, const struct FVector& TargetRelativeLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_BountyPuckWorldWidget_C">();
	}
	static class AB_BountyPuckWorldWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_BountyPuckWorldWidget_C>();
	}
};

}

