#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_CCPM_MusicTest

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.ExecuteUbergraph_B_CCPM_MusicTest
// 0x0024 (0x0024 - 0x0000)
struct B_CCPM_MusicTest_C_ExecuteUbergraph_B_CCPM_MusicTest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldLocation;                          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldVelocity;                          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_At_Creation_3;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_At_Creation_2;                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_At_Creation_1;                        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_At_Creation;                          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.Character Movement Updated
// 0x001C (0x001C - 0x0000)
struct B_CCPM_MusicTest_C_Character_Movement_Updated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldLocation;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldVelocity;                                       // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.Morning Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_MusicTest_C_Morning_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.Night Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_MusicTest_C_Night_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.Evening Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_MusicTest_C_Evening_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.Day Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_MusicTest_C_Day_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.getIsDriving
// 0x0002 (0x0002 - 0x0000)
struct B_CCPM_MusicTest_C_getIsDriving final
{
public:
	bool                                          isDriving_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getIsDriving_isDriving;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.set Niagara System User Variable (Color)
// 0x0018 (0x0018 - 0x0000)
struct B_CCPM_MusicTest_C_set_Niagara_System_User_Variable__Color_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.set Niagara System User Variable (Float)
// 0x000C (0x000C - 0x0000)
struct B_CCPM_MusicTest_C_set_Niagara_System_User_Variable__Float_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.set Niagara System User Variable (Int)
// 0x000C (0x000C - 0x0000)
struct B_CCPM_MusicTest_C_set_Niagara_System_User_Variable__Int_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.set Niagara System User Variable (Vector)
// 0x0014 (0x0014 - 0x0000)
struct B_CCPM_MusicTest_C_set_Niagara_System_User_Variable__Vector_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Value;                                             // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.set Niagara System User Variable (Bool)
// 0x000C (0x000C - 0x0000)
struct B_CCPM_MusicTest_C_set_Niagara_System_User_Variable__Bool_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.getNiagaraParticles
// 0x0040 (0x0040 - 0x0000)
struct B_CCPM_MusicTest_C_getNiagaraParticles final
{
public:
	struct FGameplayTagContainer                  Gameplay_Tag_Container;                            // 0x0000(0x0020)(Parm, OutParm)
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0020(0x0020)()
};

// Function B_CCPM_MusicTest.B_CCPM_MusicTest_C.getIsFrontEnd
// 0x0002 (0x0002 - 0x0000)
struct B_CCPM_MusicTest_C_getIsFrontEnd final
{
public:
	bool                                          IsInFrontEnd_0;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getIsFrontEnd_IsInFrontEnd;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

