#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Decal_Flopper_JellyFish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Decal_Flopper_JellyFish.B_Decal_Flopper_JellyFish_C
// 0x0020 (0x0248 - 0x0228)
class AB_Decal_Flopper_JellyFish_C final : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FadeIn_NewTrack_0_2F2CC4164B50B3516AA9909D745FF7CB; // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeIn__Direction_2F2CC4164B50B3516AA9909D745FF7CB; // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     FadeIn;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Decal_MID;                                         // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Decal_Flopper_JellyFish(int32 EntryPoint);
	void ReceiveBeginPlay();
	void FadeIn__UpdateFunc();
	void FadeIn__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Decal_Flopper_JellyFish_C">();
	}
	static class AB_Decal_Flopper_JellyFish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Decal_Flopper_JellyFish_C>();
	}
};

}

