#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Shotgun_Charge_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Shotgun_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Shotgun_Charge_Athena.B_Shotgun_Charge_Athena_C
// 0x0038 (0x12E0 - 0x12A8)
class AB_Shotgun_Charge_Athena_C final : public AB_Shotgun_Generic_C
{
public:
	uint8                                         Pad_12A4[0x4];                                     // 0x12A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Shotgun_Charge_Athena_C;          // 0x12A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PartialCharged_MF;                               // 0x12B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_FullyCharged_MF;                                 // 0x12B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          MaxChargeForSwap;                                  // 0x12C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12C1[0x7];                                     // 0x12C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             MaxChargeSwapAudio;                                // 0x12C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioVisualizerEnabled;                            // 0x12D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D1[0x7];                                     // 0x12D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           AudioVisualizerTimer;                              // 0x12D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Shotgun_Charge_Athena(int32 EntryPoint);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void ChargeAudioVisualizer();
	void OnEndCharge();
	void OnReachedMaxCharge();
	void OnStartCharge();
	void K2_OnUnEquip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Shotgun_Charge_Athena_C">();
	}
	static class AB_Shotgun_Charge_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Shotgun_Charge_Athena_C>();
	}
};

}

