#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_SneakySnowmanV2_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_UtilityItem_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SneakySnowmanV2_Athena.B_SneakySnowmanV2_Athena_C
// 0x0050 (0x0D58 - 0x0D08)
class AB_SneakySnowmanV2_Athena_C final : public AB_UtilityItem_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ShouldSnowmanInTurret;                             // 0x0D20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x0D48(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_SneakySnowmanV2_Athena(int32 EntryPoint);
	void K2_OnUnEquip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SneakySnowmanV2_Athena_C">();
	}
	static class AB_SneakySnowmanV2_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SneakySnowmanV2_Athena_C>();
	}
};

}

