#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_WaffleTruck_Pistol_ThermalScope

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_WaffleTruck_ScopedRevolver_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_WaffleTruck_Pistol_ThermalScope.B_WaffleTruck_Pistol_ThermalScope_C
// 0x0020 (0x12E0 - 0x12C0)
class AB_WaffleTruck_Pistol_ThermalScope_C final : public AB_WaffleTruck_ScopedRevolver_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_WaffleTruck_Pistol_ThermalScope_C; // 0x12C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ScalePlayerThermal_NewTrack_0_74F122334ABEC082DB6D87A4D6AEF901; // 0x12C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScalePlayerThermal__Direction_74F122334ABEC082DB6D87A4D6AEF901; // 0x12CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12CD[0x3];                                     // 0x12CD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     ScalePlayerThermal;                                // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendInTimeThermal;                                // 0x12D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_WaffleTruck_Pistol_ThermalScope(int32 EntryPoint);
	void ForceScopeBackImmediatly();
	void ReverseScopePP();
	void PlayScopePP();
	void OnSetTargeting(bool bNewIsTargeting);
	void ScalePlayerThermal__UpdateFunc();
	void ScalePlayerThermal__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_WaffleTruck_Pistol_ThermalScope_C">();
	}
	static class AB_WaffleTruck_Pistol_ThermalScope_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_WaffleTruck_Pistol_ThermalScope_C>();
	}
};

}

