#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BadgerBangsLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C
// 0x1310 (0x16A0 - 0x0390)
class UBadgerBangsLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x03A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x03D0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0458(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0488(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0510(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0540(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x05C8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0650(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0680(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0708(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0738(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x07B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x07E0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0858(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0888(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0900(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0930(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x09A8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x09D8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0A60(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0A90(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0B18(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0B48(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0BD0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0C00(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0C30(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0C60(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x0C90(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0CC0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0CF0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0D20(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0D50(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0D80(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0DB0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0DE0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0E10(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0E98(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0EC8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0F50(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0F80(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1008(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1038(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x10C0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x10F0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1178(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x11A8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1230(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1260(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x12E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1318(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x13A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x13D0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1458(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1488(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1510(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1540(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x15C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x15F8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1670(0x0030)()

public:
	void ExecuteUbergraph_BadgerBangsLayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BadgerBangsLayerAnimBP_C">();
	}
	static class UBadgerBangsLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadgerBangsLayerAnimBP_C>();
	}
};

}

