#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePassPurchaseDetailsScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function BattlePassPurchaseDetailsScreen.BattlePassPurchaseDetailsScreen_C.ExecuteUbergraph_BattlePassPurchaseDetailsScreen
// 0x0020 (0x0020 - 0x0000)
struct BattlePassPurchaseDetailsScreen_C_ExecuteUbergraph_BattlePassPurchaseDetailsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassPurchaseDetailsScreen.BattlePassPurchaseDetailsScreen_C.ShowFinalPurchaseConfirmation
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPurchaseDetailsScreen_C_ShowFinalPurchaseConfirmation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassPurchaseDetailsScreen.BattlePassPurchaseDetailsScreen_C.HideFinalPurchaseConfirmation
// 0x0010 (0x0010 - 0x0000)
struct BattlePassPurchaseDetailsScreen_C_HideFinalPurchaseConfirmation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BattlePassPurchaseDetailsScreen.BattlePassPurchaseDetailsScreen_C.AnimateBackToNormalState
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPurchaseDetailsScreen_C_AnimateBackToNormalState final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

