#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_FluidSim_FN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FluidForceDynamic_structs.hpp"
#include "BP_FluidSim_01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FluidSim_FN.BP_FluidSim_FN_C
// 0x0100 (0x0550 - 0x0450)
class ABP_FluidSim_FN_C final : public ABP_FluidSim_01_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FluidSim_FN_C;                   // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFluidForceDynamic                     BoatForceSettings;                                 // 0x0458(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFluidForceDynamic                     PlayerForceSettings;                               // 0x04C8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class AFortPawn*>                      RelevantFortPawns;                                 // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Use_FN_Pawn_Forces;                                // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_FluidSim_FN(int32 EntryPoint);
	void GetPlayerPawnForces();
	void GetLocalPawn(class APawn** Pawn);
	void GetFortnitePawnForces();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FluidSim_FN_C">();
	}
	static class ABP_FluidSim_FN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FluidSim_FN_C>();
	}
};

}

