#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Frontend_EventLevel_NavObject_BattlePassScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Frontend_EventLevel_NavObject_BattlePassScreen.BP_Frontend_EventLevel_NavObject_BattlePassScreen_C.ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BattlePassScreen
// 0x0018 (0x0018 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BattlePassScreen_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BattlePassScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasPurchasedSeasonBook_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_Frontend_EventLevel_NavObject_BattlePassScreen.BP_Frontend_EventLevel_NavObject_BattlePassScreen_C.SetBattlePassVisualState
// 0x0010 (0x0010 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BattlePassScreen_C_SetBattlePassVisualState final
{
public:
	bool                                          bIsPurchased;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

