#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_ProjectileTrajectory_SnapToGrid_HolidayBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ECardinalDirection_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_ProjectileTrajectory_Athena_SnapToGridArrow_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ProjectileTrajectory_SnapToGrid_HolidayBox.BP_ProjectileTrajectory_SnapToGrid_HolidayBox_C
// 0x00D0 (0x0430 - 0x0360)
class ABP_ProjectileTrajectory_SnapToGrid_HolidayBox_C final : public ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ProjectileTrajectory_SnapToGrid_HolidayBox_C; // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Looping_Sound;                                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<ECardinalDirection, float>               OrientationYawOffsets;                             // 0x0370(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ECardinalDirection, struct FVector>      OrientationLocationOffsets;                        // 0x03C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BGALocations_Traced;                               // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FRotator>                       BGARotations_Traced;                               // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ProjectileTrajectory_SnapToGrid_HolidayBox(int32 EntryPoint);
	void ReceiveDestroyed();
	void HandleGridSnapUpdates(const struct FVector& NewLocation);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ProjectileTrajectory_SnapToGrid_HolidayBox_C">();
	}
	static class ABP_ProjectileTrajectory_SnapToGrid_HolidayBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ProjectileTrajectory_SnapToGrid_HolidayBox_C>();
	}
};

}

