#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_TimeSynthTrackComponent_IOGuard

#include "Basic.hpp"

#include "BP_TimeSynthTrackComponent_DataTracker_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TimeSynthTrackComponent_IOGuard.BP_TimeSynthTrackComponent_IOGuard_C
// 0x0028 (0x0258 - 0x0230)
class UBP_TimeSynthTrackComponent_IOGuard_C final : public UBP_TimeSynthTrackComponent_DataTracker_C
{
public:
	float                                         InterpFloat_Unaware;                               // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpFloat_Alerted;                               // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpFloat_Aggressive;                            // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_Alert;                                    // 0x023C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_Unaware;                                  // 0x0244(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_Agressive;                                // 0x024C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnDataTrackerUpdate();
	void HandleMixState();
	void GetRemainingEventCooldown(float* Cooldown);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TimeSynthTrackComponent_IOGuard_C">();
	}
	static class UBP_TimeSynthTrackComponent_IOGuard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TimeSynthTrackComponent_IOGuard_C>();
	}
};

}

