#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CommonDialogueRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonDialogueRuntime_structs.hpp"


namespace SDK
{

// Class CommonDialogueRuntime.ConversationParticipantComponent
// 0x00B8 (0x0168 - 0x00B0)
class UConversationParticipantComponent : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x9C];                                      // 0x00B0(0x009C)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ConversationsActive;                               // 0x014C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UConversationInstance*                  Auth_CurrentConversation;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UConversationInstance*>          Auth_Conversations;                                // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientExecuteTaskAndSideEffects(const struct FConversationNodeHandle& Handle);
	void ClientUpdateConversation(const struct FClientConversationMessagePayload& Message);
	void ClientUpdateConversations(int32 InConversationsActive);
	void ClientUpdateParticipants(const struct FConversationParticipants& InParticipants);
	class FText GetParticipantDisplayName();
	void OnRep_ConversationsActive(int32 OldConversationsActive);
	void RequestServerAdvanceConversation(const struct FAdvanceConversationRequest& InChoicePicked);
	void ServerAdvanceConversation(const struct FAdvanceConversationRequest& InChoicePicked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationParticipantComponent">();
	}
	static class UConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationParticipantComponent>();
	}
};

// Class CommonDialogueRuntime.ConversationNode
// 0x0030 (0x0058 - 0x0028)
class UConversationNode : public UObject
{
public:
	class UObject*                                EvalWorldContextObj;                               // 0x0028(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeName;                                          // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Compiled_NodeGUID;                                 // 0x0040(0x0010)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UConversationNode*                      ParentNode;                                        // 0x0050(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor GetDebugParticipantColor(const struct FGameplayTag& ParticipantID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationNode">();
	}
	static class UConversationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNode>();
	}
};

// Class CommonDialogueRuntime.ConversationSubNode
// 0x0000 (0x0058 - 0x0058)
class UConversationSubNode : public UConversationNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationSubNode">();
	}
	static class UConversationSubNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSubNode>();
	}
};

// Class CommonDialogueRuntime.ConversationChoiceNode
// 0x0038 (0x0090 - 0x0058)
class UConversationChoiceNode : public UConversationSubNode
{
public:
	class FText                                   DefaultChoiceDisplayText;                          // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ChoiceTags;                                        // 0x0070(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void FillChoice(const struct FConversationContext& Context, struct FClientConversationOptionEntry* ChoiceEntry) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationChoiceNode">();
	}
	static class UConversationChoiceNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationChoiceNode>();
	}
};

// Class CommonDialogueRuntime.ConversationContextHelpers
// 0x0000 (0x0028 - 0x0028)
class UConversationContextHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FConversationTaskResult AdvanceConversation(const struct FConversationContext& Context);
	static struct FConversationTaskResult AdvanceConversationWithChoice(const struct FConversationContext& Context, const struct FAdvanceConversationRequest& Choice);
	static class UConversationParticipantComponent* FindConversationComponent(class AActor* Actor);
	static class UConversationInstance* GetConversationInstance(const struct FConversationContext& Context);
	static class UConversationParticipantComponent* GetConversationParticipant(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static class AActor* GetConversationParticipantActor(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static struct FConversationNodeHandle GetCurrentConversationNodeHandle(const struct FConversationContext& Context);
	static void MakeConversationParticipant(const struct FConversationContext& Context, class AActor* ParticipantActor, const struct FGameplayTag& ParticipantTag);
	static struct FConversationTaskResult PauseConversationAndSendClientChoices(const struct FConversationContext& Context, const struct FClientConversationMessage& Message);
	static struct FConversationTaskResult ReturnToConversationStart(const struct FConversationContext& Context);
	static struct FConversationTaskResult ReturnToCurrentClientChoice(const struct FConversationContext& Context);
	static struct FConversationTaskResult ReturnToLastClientChoice(const struct FConversationContext& Context);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationContextHelpers">();
	}
	static class UConversationContextHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationContextHelpers>();
	}
};

// Class CommonDialogueRuntime.ConversationDatabase
// 0x00B8 (0x00E8 - 0x0030)
class UConversationDatabase final : public UPrimaryDataAsset
{
public:
	int32                                         CompilerVersion;                                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<struct FGuid, class UConversationNode*>  ReachableNodeMap;                                  // 0x0038(0x0050)(NativeAccessSpecifierPrivate)
	TArray<struct FConversationEntryList>         EntryTags;                                         // 0x0088(0x0010)(ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ExitTags;                                          // 0x0098(0x0020)(AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          InternalNodeIds;                                   // 0x00B8(0x0010)(ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          LinkedToNodeIds;                                   // 0x00C8(0x0010)(ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCommonDialogueBankParticipant> Speakers;                                          // 0x00D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationDatabase">();
	}
	static class UConversationDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationDatabase>();
	}
};

// Class CommonDialogueRuntime.ConversationNodeWithLinks
// 0x0010 (0x0068 - 0x0058)
class UConversationNodeWithLinks : public UConversationNode
{
public:
	TArray<struct FGuid>                          OutputConnections;                                 // 0x0058(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationNodeWithLinks">();
	}
	static class UConversationNodeWithLinks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNodeWithLinks>();
	}
};

// Class CommonDialogueRuntime.ConversationEntryPointNode
// 0x0008 (0x0070 - 0x0068)
class UConversationEntryPointNode final : public UConversationNodeWithLinks
{
public:
	struct FGameplayTag                           EntryTag;                                          // 0x0068(0x0008)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationEntryPointNode">();
	}
	static class UConversationEntryPointNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationEntryPointNode>();
	}
};

// Class CommonDialogueRuntime.ConversationInstance
// 0x0168 (0x0190 - 0x0028)
class UConversationInstance : public UObject
{
public:
	struct FConversationParticipants              Participants;                                      // 0x0028(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x158];                                     // 0x0038(0x0158)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationInstance">();
	}
	static class UConversationInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationInstance>();
	}
};

// Class CommonDialogueRuntime.ConversationLibrary
// 0x0000 (0x0028 - 0x0028)
class UConversationLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UConversationInstance* StartConversation(const struct FGameplayTag& ConversationEntryTag, class AActor* Instigator, const struct FGameplayTag& InstigatorTag, class AActor* Target, const struct FGameplayTag& TargetTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationLibrary">();
	}
	static class UConversationLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationLibrary>();
	}
};

// Class CommonDialogueRuntime.ConversationTaskNode
// 0x0010 (0x0078 - 0x0068)
class UConversationTaskNode : public UConversationNodeWithLinks
{
public:
	TArray<class UConversationSubNode*>           SubNodes;                                          // 0x0068(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ExecuteClientEffects(const struct FConversationContext& Context) const;
	struct FConversationTaskResult ExecuteTaskNode(const struct FConversationContext& Context) const;
	bool GetNodeBodyColor(struct FLinearColor* BodyColor) const;
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationTaskNode">();
	}
	static class UConversationTaskNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationTaskNode>();
	}
};

// Class CommonDialogueRuntime.ConversationLinkNode
// 0x0008 (0x0080 - 0x0078)
class UConversationLinkNode final : public UConversationTaskNode
{
public:
	struct FGameplayTag                           RemoteEntryTag;                                    // 0x0078(0x0008)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationLinkNode">();
	}
	static class UConversationLinkNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationLinkNode>();
	}
};

// Class CommonDialogueRuntime.ConversationRegistry
// 0x01A8 (0x01D8 - 0x0030)
class UConversationRegistry final : public UWorldSubsystem
{
public:
	struct FNetSerializeScriptStructCache_ConvVersion ConversationChoiceDataStructCache;             // 0x0030(0x0060)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x148];                                     // 0x0090(0x0148)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationRegistry">();
	}
	static class UConversationRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRegistry>();
	}
};

// Class CommonDialogueRuntime.ConversationRequirementNode
// 0x0000 (0x0058 - 0x0058)
class UConversationRequirementNode : public UConversationSubNode
{
public:
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationRequirementNode">();
	}
	static class UConversationRequirementNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRequirementNode>();
	}
};

// Class CommonDialogueRuntime.ConversationSettings
// 0x0028 (0x0060 - 0x0038)
class UConversationSettings final : public UDeveloperSettings
{
public:
	TSoftClassPtr<class UClass>                   ConversationInstanceClass;                         // 0x0038(0x0028)(Edit, Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationSettings">();
	}
	static class UConversationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSettings>();
	}
};

// Class CommonDialogueRuntime.ConversationSideEffectNode
// 0x0000 (0x0058 - 0x0058)
class UConversationSideEffectNode final : public UConversationSubNode
{
public:
	void ClientCauseSideEffect(const struct FConversationContext& Context) const;
	void ServerCauseSideEffect(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationSideEffectNode">();
	}
	static class UConversationSideEffectNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSideEffectNode>();
	}
};

}

