#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CommonDialogueRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum CommonDialogueRuntime.EConversationTaskResultType
// NumValues: 0x0009
enum class EConversationTaskResultType : uint8
{
	Invalid                                  = 0,
	AbortConversation                        = 1,
	AdvanceConversation                      = 2,
	AdvanceConversationWithChoice            = 3,
	PauseConversationAndSendClientChoices    = 4,
	ReturnToLastClientChoice                 = 5,
	ReturnToCurrentClientChoice              = 6,
	ReturnToConversationStart                = 7,
	EConversationTaskResultType_MAX          = 8,
};

// Enum CommonDialogueRuntime.EConversationRequirementResult
// NumValues: 0x0004
enum class EConversationRequirementResult : uint8
{
	Passed                                   = 0,
	FailedButVisible                         = 1,
	FailedAndHidden                          = 2,
	EConversationRequirementResult_MAX       = 3,
};

// Enum CommonDialogueRuntime.EConversationChoiceType
// NumValues: 0x0004
enum class EConversationChoiceType : uint8
{
	ServerOnly                               = 0,
	UserChoiceAvailable                      = 1,
	UserChoiceUnavailable                    = 2,
	EConversationChoiceType_MAX              = 3,
};

// ScriptStruct CommonDialogueRuntime.ConversationNodeHandle
// 0x0010 (0x0010 - 0x0000)
struct FConversationNodeHandle final
{
public:
	struct FGuid                                  NodeGUID;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationContext
// 0x0038 (0x0038 - 0x0000)
struct FConversationContext final
{
public:
	class UConversationRegistry*                  ConversationRegistry;                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UConversationInstance*                  ActiveConversation;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UConversationParticipantComponent*      ClientParticipant;                                 // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UConversationTaskNode*                  TaskBeingConsidered;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FConversationNodeHandle>        ReturnScopeStack;                                  // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bServer;                                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CommonDialogueRuntime.ConversationNodeParameterPair
// 0x0020 (0x0020 - 0x0000)
struct FConversationNodeParameterPair final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationChoiceReference
// 0x0020 (0x0020 - 0x0000)
struct FConversationChoiceReference final
{
public:
	struct FConversationNodeHandle                NodeReference;                                     // 0x0000(0x0010)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConversationNodeParameterPair> NodeParameters;                                    // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.AdvanceConversationRequest
// 0x0030 (0x0030 - 0x0000)
struct FAdvanceConversationRequest final
{
public:
	struct FConversationChoiceReference           Choice;                                            // 0x0000(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FConversationNodeParameterPair> UserParameters;                                    // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ClientConversationMessage
// 0x0038 (0x0038 - 0x0000)
struct FClientConversationMessage final
{
public:
	struct FGameplayTag                           SpeakerID;                                         // 0x0000(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ParticipantDisplayName;                            // 0x0008(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0020(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationTaskResult
// 0x0070 (0x0070 - 0x0000)
struct FConversationTaskResult final
{
public:
	EConversationTaskResultType                   Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAdvanceConversationRequest            AdvanceToChoice;                                   // 0x0008(0x0030)(NativeAccessSpecifierPrivate)
	struct FClientConversationMessage             Message;                                           // 0x0038(0x0038)(NativeAccessSpecifierPrivate)
};

// ScriptStruct CommonDialogueRuntime.CommonDialogueBankParticipant
// 0x0030 (0x0030 - 0x0000)
struct FCommonDialogueBankParticipant final
{
public:
	class FText                                   FallbackName;                                      // 0x0000(0x0018)(NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantName;                                   // 0x0018(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeTint;                                          // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationEntryList
// 0x0018 (0x0018 - 0x0000)
struct FConversationEntryList final
{
public:
	struct FGameplayTag                           EntryTag;                                          // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          DestinationList;                                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.NetSerializeScriptStructCache_ConvVersion
// 0x0060 (0x0060 - 0x0000)
struct FNetSerializeScriptStructCache_ConvVersion final
{
public:
	TMap<class UScriptStruct*, int32>             ScriptStructsToIndex;                              // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UScriptStruct*>                  IndexToScriptStructs;                              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ClientConversationOptionEntry
// 0x0070 (0x0070 - 0x0000)
struct FClientConversationOptionEntry final
{
public:
	class FText                                   ChoiceText;                                        // 0x0000(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ChoiceTags;                                        // 0x0018(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	EConversationChoiceType                       ChoiceType;                                        // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FConversationChoiceReference           ChoiceReference;                                   // 0x0040(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FConversationNodeParameterPair> ExtraData;                                         // 0x0060(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationParticipantEntry
// 0x0010 (0x0010 - 0x0000)
struct FConversationParticipantEntry final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantID;                                     // 0x0008(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationParticipants
// 0x0010 (0x0010 - 0x0000)
struct FConversationParticipants final
{
public:
	TArray<struct FConversationParticipantEntry>  List;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ClientConversationMessagePayload
// 0x0068 (0x0068 - 0x0000)
struct FClientConversationMessagePayload final
{
public:
	struct FClientConversationMessage             Message;                                           // 0x0000(0x0038)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FConversationParticipants              Participants;                                      // 0x0038(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FConversationNodeHandle                CurrentNode;                                       // 0x0048(0x0010)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FClientConversationOptionEntry> Options;                                           // 0x0058(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationBranchPoint
// 0x0080 (0x0080 - 0x0000)
struct FConversationBranchPoint final
{
public:
	TArray<struct FConversationNodeHandle>        ReturnScopeStack;                                  // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClientConversationOptionEntry         ClientChoice;                                      // 0x0010(0x0070)(NativeAccessSpecifierPublic)
};

// ScriptStruct CommonDialogueRuntime.ConversationChoiceDataHandle
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FConversationChoiceDataHandle final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct CommonDialogueRuntime.ConversationChoiceData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FConversationChoiceData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

