#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Components_DynamicActivationComponent

#include "Basic.hpp"

#include "Components_ActivationState_structs.hpp"


namespace SDK::Params
{

// Function Components_DynamicActivationComponent.Context_DynamicActivationComponent_WaitForTransitionComplete.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_DynamicActivationComponent_WaitForTransitionComplete_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Components_DynamicActivationComponent.Context_DynamicActivationComponent_WaitForTransitionStart.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_DynamicActivationComponent_WaitForTransitionStart_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Components_DynamicActivationComponent.DynamicActivationComponent.linkComponent
// 0x0008 (0x0008 - 0x0000)
struct DynamicActivationComponent_linkComponent final
{
public:
	class UEntityComponent*                       __verse_0x5F2F2619_componentToLink;                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Components_DynamicActivationComponent.DynamicActivationComponent.startTransition
// 0x0008 (0x0008 - 0x0000)
struct DynamicActivationComponent_startTransition final
{
public:
	float                                         __verse_0xFD6BB246_secondsToChange;                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActivationState                              __verse_0xDE4C766A_targetState;                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Components_DynamicActivationComponent.DynamicActivationComponent.unlinkComponent
// 0x0008 (0x0008 - 0x0000)
struct DynamicActivationComponent_unlinkComponent final
{
public:
	class UEntityComponent*                       __verse_0xEE9D0EE3_componentToUnlink;              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

