#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ConcertSyncCore

#include "Basic.hpp"

#include "Concert_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ConcertTransport_structs.hpp"


namespace SDK
{

// Enum ConcertSyncCore.EConcertDataStoreResultCode
// NumValues: 0x0007
enum class EConcertDataStoreResultCode : uint8
{
	Added                                    = 0,
	Fetched                                  = 1,
	Exchanged                                = 2,
	NotFound                                 = 3,
	TypeMismatch                             = 4,
	UnexpectedError                          = 5,
	EConcertDataStoreResultCode_MAX          = 6,
};

// Enum ConcertSyncCore.EConcertMovieScenePlayerStatus
// NumValues: 0x0008
enum class EConcertMovieScenePlayerStatus : uint8
{
	Stopped                                  = 0,
	Playing                                  = 1,
	Recording                                = 2,
	Scrubbing                                = 3,
	Jumping                                  = 4,
	Stepping                                 = 5,
	Paused                                   = 6,
	MAX                                      = 7,
};

// Enum ConcertSyncCore.EConcertSyncTransactionActivitySummaryType
// NumValues: 0x0005
enum class EConcertSyncTransactionActivitySummaryType : uint8
{
	Added                                    = 0,
	Updated                                  = 1,
	Renamed                                  = 2,
	Deleted                                  = 3,
	EConcertSyncTransactionActivitySummaryType_MAX = 4,
};

// Enum ConcertSyncCore.EConcertSyncActivityEventType
// NumValues: 0x0006
enum class EConcertSyncActivityEventType : uint8
{
	None                                     = 0,
	Connection                               = 1,
	Lock                                     = 2,
	Transaction                              = 3,
	Package                                  = 4,
	EConcertSyncActivityEventType_MAX        = 5,
};

// Enum ConcertSyncCore.EConcertSyncLockEventType
// NumValues: 0x0003
enum class EConcertSyncLockEventType : uint8
{
	Locked                                   = 0,
	Unlocked                                 = 1,
	EConcertSyncLockEventType_MAX            = 2,
};

// Enum ConcertSyncCore.EConcertSyncConnectionEventType
// NumValues: 0x0003
enum class EConcertSyncConnectionEventType : uint8
{
	Connected                                = 0,
	Disconnected                             = 1,
	EConcertSyncConnectionEventType_MAX      = 2,
};

// Enum ConcertSyncCore.EConcertPackageUpdateType
// NumValues: 0x0006
enum class EConcertPackageUpdateType : uint8
{
	Dummy                                    = 0,
	Added                                    = 1,
	Saved                                    = 2,
	Renamed                                  = 3,
	Deleted                                  = 4,
	EConcertPackageUpdateType_MAX            = 5,
};

// Enum ConcertSyncCore.EConcertPlaySessionEventType
// NumValues: 0x0005
enum class EConcertPlaySessionEventType : uint8
{
	None                                     = 0,
	BeginPlay                                = 1,
	SwitchPlay                               = 2,
	EndPlay                                  = 3,
	EConcertPlaySessionEventType_MAX         = 4,
};

// Enum ConcertSyncCore.EConcertResourceLockType
// NumValues: 0x0004
enum class EConcertResourceLockType : uint8
{
	None                                     = 0,
	Lock                                     = 1,
	Unlock                                   = 2,
	EConcertResourceLockType_MAX             = 3,
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_StoreValue
// 0x0030 (0x0030 - 0x0000)
struct FConcertDataStore_StoreValue final
{
public:
	class FName                                   TypeName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FConcertSessionSerializedPayload       SerializedValue;                                   // 0x0010(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_Response
// 0x0038 (0x0038 - 0x0000)
struct FConcertDataStore_Response final
{
public:
	EConcertDataStoreResultCode                   ResultCode;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FConcertDataStore_StoreValue           Value;                                             // 0x0008(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_Request
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_Request
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_CompareExchangeRequest
// 0x0048 (0x0058 - 0x0010)
struct FConcertDataStore_CompareExchangeRequest final : public FConcertDataStore_Request
{
public:
	uint32                                        ExpectedVersion;                                   // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FConcertSessionSerializedPayload       Expected;                                          // 0x0018(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedPayload       Desired;                                           // 0x0038(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_FetchOrAddRequest
// 0x0020 (0x0030 - 0x0010)
struct FConcertDataStore_FetchOrAddRequest final : public FConcertDataStore_Request
{
public:
	struct FConcertSessionSerializedPayload       SerializedValue;                                   // 0x0010(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_KeyValuePair
// 0x0038 (0x0038 - 0x0000)
struct FConcertDataStore_KeyValuePair final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertDataStore_StoreValue           Value;                                             // 0x0008(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_ReplicateEvent
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_ReplicateEvent final
{
public:
	TArray<struct FConcertDataStore_KeyValuePair> Values;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_Text
// 0x0018 (0x0018 - 0x0000)
struct FConcertDataStore_Text final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_String
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_String final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_Double
// 0x0008 (0x0008 - 0x0000)
struct FConcertDataStore_Double final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertDataStore_Integer
// 0x0008 (0x0008 - 0x0000)
struct FConcertDataStore_Integer final
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertClientPresenceEventBase
// 0x0004 (0x0004 - 0x0000)
struct FConcertClientPresenceEventBase
{
public:
	uint32                                        TransactionUpdateIndex;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertLaserData
// 0x0018 (0x0018 - 0x0000)
struct FConcertLaserData final
{
public:
	struct FVector                                LaserStart;                                        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaserEnd;                                          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertClientVRPresenceUpdateEvent
// 0x006C (0x0070 - 0x0004)
struct FConcertClientVRPresenceUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	struct FVector                                LeftMotionControllerPosition;                      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  LeftMotionControllerOrientation;                   // 0x0010(0x0010)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RightMotionControllerPosition;                     // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FQuat                                  RightMotionControllerOrientation;                  // 0x0030(0x0010)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FConcertLaserData                      Lasers[0x2];                                       // 0x0040(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertClientDesktopPresenceUpdateEvent
// 0x001C (0x0020 - 0x0004)
struct FConcertClientDesktopPresenceUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	struct FVector                                TraceStart;                                        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TraceEnd;                                          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMovingCamera;                                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertClientPresenceDataUpdateEvent
// 0x002C (0x0030 - 0x0004)
struct FConcertClientPresenceDataUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	class FName                                   WorldPath;                                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FQuat                                  Orientation;                                       // 0x0020(0x0010)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertClientPresenceInVREvent
// 0x0008 (0x0008 - 0x0000)
struct FConcertClientPresenceInVREvent final
{
public:
	class FName                                   VRDevice;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertClientPresenceVisibilityUpdateEvent
// 0x0014 (0x0014 - 0x0000)
struct FConcertClientPresenceVisibilityUpdateEvent final
{
public:
	struct FGuid                                  ModifiedEndpointId;                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibility;                                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertSequencerState
// 0x0028 (0x0028 - 0x0000)
struct FConcertSequencerState final
{
public:
	class FString                                 SequenceObjectPath;                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQualifiedFrameTime                    Time;                                              // 0x0010(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertMovieScenePlayerStatus                PlayerStatus;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         PlaybackSpeed;                                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSequencerStateSyncEvent
// 0x0010 (0x0010 - 0x0000)
struct FConcertSequencerStateSyncEvent final
{
public:
	TArray<struct FConcertSequencerState>         SequencerStates;                                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSequencerStateEvent
// 0x0028 (0x0028 - 0x0000)
struct FConcertSequencerStateEvent final
{
public:
	struct FConcertSequencerState                 State;                                             // 0x0000(0x0028)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSequencerCloseEvent
// 0x0018 (0x0018 - 0x0000)
struct FConcertSequencerCloseEvent final
{
public:
	class FString                                 SequenceObjectPath;                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMasterClose;                                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertSequencerOpenEvent
// 0x0010 (0x0010 - 0x0000)
struct FConcertSequencerOpenEvent final
{
public:
	class FString                                 SequenceObjectPath;                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncActivitySummary
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FConcertSyncActivitySummary
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertSyncPackageActivitySummary
// 0x0018 (0x0020 - 0x0008)
struct FConcertSyncPackageActivitySummary final : public FConcertSyncActivitySummary
{
public:
	class FName                                   PackageName;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewPackageName;                                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertPackageUpdateType                     PackageUpdateType;                                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSave;                                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreSave;                                          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertSyncTransactionActivitySummary
// 0x0040 (0x0048 - 0x0008)
struct FConcertSyncTransactionActivitySummary final : public FConcertSyncActivitySummary
{
public:
	EConcertSyncTransactionActivitySummaryType    TransactionSummaryType;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   TransactionTitle;                                  // 0x0010(0x0018)(NativeAccessSpecifierPublic)
	class FName                                   PrimaryObjectName;                                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PrimaryPackageName;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewObjectName;                                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumActions;                                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertSyncLockActivitySummary
// 0x0018 (0x0020 - 0x0008)
struct FConcertSyncLockActivitySummary final : public FConcertSyncActivitySummary
{
public:
	EConcertSyncLockEventType                     LockEventType;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   PrimaryResourceName;                               // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PrimaryPackageName;                                // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumResources;                                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncConnectionActivitySummary
// 0x0008 (0x0010 - 0x0008)
struct FConcertSyncConnectionActivitySummary final : public FConcertSyncActivitySummary
{
public:
	EConcertSyncConnectionEventType               ConnectionEventType;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertSyncActivity
// 0x0058 (0x0058 - 0x0000)
struct FConcertSyncActivity
{
public:
	int64                                         ActivityId;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnored;                                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  EndpointId;                                        // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDateTime                              EventTime;                                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertSyncActivityEventType                 EventType;                                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         EventId;                                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedCborPayload   EventSummary;                                      // 0x0038(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertPackageInfo
// 0x0038 (0x0038 - 0x0000)
struct FConcertPackageInfo final
{
public:
	class FName                                   PackageName;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewPackageName;                                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackageFileExtension;                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertPackageUpdateType                     PackageUpdateType;                                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         TransactionEventIdAtSave;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreSave;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSave;                                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertPackage
// 0x0058 (0x0058 - 0x0000)
struct FConcertPackage final
{
public:
	struct FConcertPackageInfo                    Info;                                              // 0x0000(0x0038)(NativeAccessSpecifierPublic)
	TArray<uint8>                                 PackageData;                                       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileId;                                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncPackageEvent
// 0x0060 (0x0060 - 0x0000)
struct FConcertSyncPackageEvent final
{
public:
	int64                                         PackageRevision;                                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertPackage                        Package;                                           // 0x0008(0x0058)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncPackageActivity
// 0x0060 (0x00B8 - 0x0058)
struct FConcertSyncPackageActivity final : public FConcertSyncActivity
{
public:
	struct FConcertSyncPackageEvent               EventData;                                         // 0x0058(0x0060)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertObjectId
// 0x002C (0x002C - 0x0000)
struct FConcertObjectId final
{
public:
	class FName                                   ObjectClassPathName;                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectPackageName;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectName;                                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectOuterPathName;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectExternalPackageName;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ObjectPersistentFlags;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSerializedObjectData
// 0x0038 (0x0038 - 0x0000)
struct FConcertSerializedObjectData final
{
public:
	bool                                          bAllowCreate;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPendingKill;                                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   NewPackageName;                                    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewName;                                           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewOuterPathName;                                  // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewExternalPackageName;                            // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<uint8>                                 SerializedData;                                    // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSerializedPropertyData
// 0x0018 (0x0018 - 0x0000)
struct FConcertSerializedPropertyData final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 SerializedData;                                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertExportedObject
// 0x0088 (0x0088 - 0x0000)
struct FConcertExportedObject final
{
public:
	struct FConcertObjectId                       ObjectId;                                          // 0x0000(0x002C)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ObjectPathDepth;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSerializedObjectData           ObjectData;                                        // 0x0030(0x0038)(NativeAccessSpecifierPublic)
	TArray<struct FConcertSerializedPropertyData> PropertyDatas;                                     // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 SerializedAnnotationData;                          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertTransactionEventBase
// 0x0088 (0x0088 - 0x0000)
struct FConcertTransactionEventBase
{
public:
	struct FGuid                                  TransactionId;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OperationId;                                       // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  TransactionEndpointId;                             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TransactionUpdateIndex;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         VersionIndex;                                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ModifiedPackages;                                  // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertObjectId                       PrimaryObjectId;                                   // 0x0048(0x002C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FConcertExportedObject>         ExportedObjects;                                   // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertTransactionFinalizedEvent
// 0x0028 (0x00B0 - 0x0088)
struct FConcertTransactionFinalizedEvent final : public FConcertTransactionEventBase
{
public:
	struct FConcertLocalIdentifierState           LocalIdentifierState;                              // 0x0088(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0098(0x0018)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncTransactionEvent
// 0x00B0 (0x00B0 - 0x0000)
struct FConcertSyncTransactionEvent final
{
public:
	struct FConcertTransactionFinalizedEvent      Transaction;                                       // 0x0000(0x00B0)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncTransactionActivity
// 0x00B0 (0x0108 - 0x0058)
struct FConcertSyncTransactionActivity final : public FConcertSyncActivity
{
public:
	struct FConcertSyncTransactionEvent           EventData;                                         // 0x0058(0x00B0)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncLockEvent
// 0x0018 (0x0018 - 0x0000)
struct FConcertSyncLockEvent final
{
public:
	EConcertSyncLockEventType                     LockEventType;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FName>                           ResourceNames;                                     // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncLockActivity
// 0x0018 (0x0070 - 0x0058)
struct FConcertSyncLockActivity final : public FConcertSyncActivity
{
public:
	struct FConcertSyncLockEvent                  EventData;                                         // 0x0058(0x0018)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncConnectionEvent
// 0x0001 (0x0001 - 0x0000)
struct FConcertSyncConnectionEvent final
{
public:
	EConcertSyncConnectionEventType               ConnectionEventType;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncConnectionActivity
// 0x0008 (0x0060 - 0x0058)
struct FConcertSyncConnectionActivity final : public FConcertSyncActivity
{
public:
	struct FConcertSyncConnectionEvent            EventData;                                         // 0x0058(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertSyncPackageEventMetaData
// 0x0040 (0x0040 - 0x0000)
struct FConcertSyncPackageEventMetaData final
{
public:
	int64                                         PackageRevision;                                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertPackageInfo                    PackageInfo;                                       // 0x0008(0x0038)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncEndpointData
// 0x00B8 (0x00B8 - 0x0000)
struct FConcertSyncEndpointData final
{
public:
	struct FConcertClientInfo                     ClientInfo;                                        // 0x0000(0x00B8)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncEndpointIdAndData
// 0x00C8 (0x00C8 - 0x0000)
struct FConcertSyncEndpointIdAndData final
{
public:
	struct FGuid                                  EndpointId;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSyncEndpointData               EndpointData;                                      // 0x0010(0x00B8)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.TransactionClassFilter
// 0x0028 (0x0028 - 0x0000)
struct FTransactionClassFilter final
{
public:
	struct FSoftClassPath                         ObjectOuterClass;                                  // 0x0000(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 ObjectClasses;                                     // 0x0018(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertTransactionRejectedEvent
// 0x0010 (0x0010 - 0x0000)
struct FConcertTransactionRejectedEvent final
{
public:
	struct FGuid                                  TransactionId;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertTransactionSnapshotEvent
// 0x0000 (0x0088 - 0x0088)
struct FConcertTransactionSnapshotEvent final : public FConcertTransactionEventBase
{
};

// ScriptStruct ConcertSyncCore.ConcertIgnoreActivityStateChangedEvent
// 0x0014 (0x0014 - 0x0000)
struct FConcertIgnoreActivityStateChangedEvent final
{
public:
	struct FGuid                                  EndpointId;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnore;                                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertPlaySessionEvent
// 0x0020 (0x0020 - 0x0000)
struct FConcertPlaySessionEvent final
{
public:
	EConcertPlaySessionEventType                  EventType;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  PlayEndpointId;                                    // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayPackageName;                                   // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSimulating;                                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertResourceLockResponse
// 0x0058 (0x0058 - 0x0000)
struct FConcertResourceLockResponse final
{
public:
	TMap<class FName, struct FGuid>               FailedResources;                                   // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	EConcertResourceLockType                      LockType;                                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertResourceLockRequest
// 0x0028 (0x0028 - 0x0000)
struct FConcertResourceLockRequest final
{
public:
	struct FGuid                                  ClientId;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ResourceNames;                                     // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertResourceLockType                      LockType;                                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertResourceLockEvent
// 0x0028 (0x0028 - 0x0000)
struct FConcertResourceLockEvent final
{
public:
	struct FGuid                                  ClientId;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ResourceNames;                                     // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertResourceLockType                      LockType;                                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertPackageRejectedEvent
// 0x0008 (0x0008 - 0x0000)
struct FConcertPackageRejectedEvent final
{
public:
	class FName                                   PackageName;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertPackageUpdateEvent
// 0x0058 (0x0058 - 0x0000)
struct FConcertPackageUpdateEvent final
{
public:
	struct FConcertPackage                        Package;                                           // 0x0000(0x0058)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncEventResponse
// 0x0020 (0x0020 - 0x0000)
struct FConcertSyncEventResponse final
{
public:
	struct FConcertSessionSerializedPayload       Event;                                             // 0x0000(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertSyncEventRequest
// 0x0010 (0x0010 - 0x0000)
struct FConcertSyncEventRequest final
{
public:
	EConcertSyncActivityEventType                 EventType;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         EventId;                                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertWorkspaceSyncCompletedEvent
// 0x0001 (0x0001 - 0x0000)
struct FConcertWorkspaceSyncCompletedEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertWorkspaceSyncRequestedEvent
// 0x0018 (0x0018 - 0x0000)
struct FConcertWorkspaceSyncRequestedEvent final
{
public:
	int64                                         FirstActivityIdToSync;                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         LastActivityIdToSync;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLiveSync;                                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertSyncCore.ConcertWorkspaceSyncEventBase
// 0x0004 (0x0004 - 0x0000)
struct FConcertWorkspaceSyncEventBase
{
public:
	int32                                         NumRemainingSyncEvents;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertWorkspaceSyncLockEvent
// 0x0054 (0x0058 - 0x0004)
struct FConcertWorkspaceSyncLockEvent final : public FConcertWorkspaceSyncEventBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class FName, struct FGuid>               LockedResources;                                   // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertWorkspaceSyncActivityEvent
// 0x0024 (0x0028 - 0x0004)
struct FConcertWorkspaceSyncActivityEvent final : public FConcertWorkspaceSyncEventBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FConcertSessionSerializedPayload       Activity;                                          // 0x0008(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertSyncCore.ConcertWorkspaceSyncEndpointEvent
// 0x00CC (0x00D0 - 0x0004)
struct FConcertWorkspaceSyncEndpointEvent final : public FConcertWorkspaceSyncEventBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FConcertSyncEndpointIdAndData          Endpoint;                                          // 0x0008(0x00C8)(NativeAccessSpecifierPublic)
};

}

