#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Concert

#include "Basic.hpp"

#include "Concert_structs.hpp"
#include "ConcertTransport_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Concert.ConcertServerConfig
// 0x0100 (0x0128 - 0x0028)
class UConcertServerConfig final : public UObject
{
public:
	bool                                          bAutoArchiveOnReboot;                              // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoArchiveOnShutdown;                            // 0x0029(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCleanWorkingDir;                                  // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NumSessionsToKeep;                                 // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionName;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FString>                           AuthorizedClientKeys;                              // 0x0050(0x0050)(Config, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionToRestore;                           // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionSettings                DefaultSessionSettings;                            // 0x00B0(0x0028)(Edit, Config, NativeAccessSpecifierPublic)
	struct FConcertServerSettings                 ServerSettings;                                    // 0x00D8(0x0008)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FConcertEndpointSettings               EndpointSettings;                                  // 0x00E0(0x000C)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 WorkingDir;                                        // 0x00F0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ArchiveDir;                                        // 0x0100(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionRepositoryRootDir;                          // 0x0110(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMountDefaultSessionRepository;                    // 0x0120(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConcertServerConfig">();
	}
	static class UConcertServerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcertServerConfig>();
	}
};

// Class Concert.ConcertClientConfig
// 0x00D8 (0x0100 - 0x0028)
class UConcertClientConfig final : public UObject
{
public:
	bool                                          bIsHeadless;                                       // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInstallEditorToolbarButton;                       // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoConnect;                                      // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetryAutoConnectOnError;                          // 0x002B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 DefaultServerURL;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionName;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionToRestore;                           // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSaveSessionAs;                              // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertClientSettings                 ClientSettings;                                    // 0x0070(0x0080)(Edit, Config, NativeAccessSpecifierPublic)
	struct FConcertSourceControlSettings          SourceControlSettings;                             // 0x00F0(0x0001)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FConcertEndpointSettings               EndpointSettings;                                  // 0x00F4(0x000C)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConcertClientConfig">();
	}
	static class UConcertClientConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcertClientConfig>();
	}
};

}

