#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ConcertTransport

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ConcertTransport.EConcertReliableHandshakeState
// NumValues: 0x0004
enum class EConcertReliableHandshakeState : uint8
{
	None                                     = 0,
	Negotiate                                = 1,
	Success                                  = 2,
	EConcertReliableHandshakeState_MAX       = 3,
};

// Enum ConcertTransport.EConcertResponseCode
// NumValues: 0x0007
enum class EConcertResponseCode : uint8
{
	Pending                                  = 0,
	Success                                  = 1,
	Failed                                   = 2,
	InvalidRequest                           = 3,
	UnknownRequest                           = 4,
	TimedOut                                 = 5,
	EConcertResponseCode_MAX                 = 6,
};

// Enum ConcertTransport.EConcertMessageFlags
// NumValues: 0x0004
enum class EConcertMessageFlags : uint8
{
	None                                     = 0,
	ReliableOrdered                          = 1,
	UniqueId                                 = 2,
	EConcertMessageFlags_MAX                 = 3,
};

// ScriptStruct ConcertTransport.ConcertLocalIdentifierState
// 0x0010 (0x0010 - 0x0000)
struct FConcertLocalIdentifierState final
{
public:
	TArray<class FString>                         MappedNames;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertTransport.ConcertMessageData
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FConcertMessageData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  ConcertEndpointId;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  MessageID;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        MessageOrderIndex;                                 // 0x0028(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ChannelId;                                         // 0x002A(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ConcertTransport.ConcertKeepAlive
// 0x0000 (0x0030 - 0x0030)
struct FConcertKeepAlive final : public FConcertMessageData
{
};

// ScriptStruct ConcertTransport.ConcertAckData
// 0x0018 (0x0048 - 0x0030)
struct FConcertAckData final : public FConcertMessageData
{
public:
	int64                                         AckSendTimeTicks;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SourceMessageId;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertTransport.ConcertEventData
// 0x0000 (0x0030 - 0x0030)
struct FConcertEventData : public FConcertMessageData
{
};

// ScriptStruct ConcertTransport.ConcertEndpointDiscoveryEvent
// 0x0000 (0x0030 - 0x0030)
struct FConcertEndpointDiscoveryEvent : public FConcertEventData
{
};

// ScriptStruct ConcertTransport.ConcertReliableHandshakeData
// 0x0010 (0x0040 - 0x0030)
struct FConcertReliableHandshakeData final : public FConcertEndpointDiscoveryEvent
{
public:
	EConcertReliableHandshakeState                HandshakeState;                                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x1];                                       // 0x0031(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	uint16                                        ReliableChannelId;                                 // 0x0032(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        NextMessageIndex;                                  // 0x0034(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int64                                         EndpointTimeoutTick;                               // 0x0038(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertTransport.ConcertEndpointClosedData
// 0x0000 (0x0030 - 0x0030)
struct FConcertEndpointClosedData final : public FConcertMessageData
{
};

// ScriptStruct ConcertTransport.ConcertResponseData
// 0x0030 (0x0060 - 0x0030)
struct FConcertResponseData : public FConcertMessageData
{
public:
	struct FGuid                                  RequestMessageId;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertResponseCode                          ResponseCode;                                      // 0x0040(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Reason;                                            // 0x0048(0x0018)(Edit, EditConst, AdvancedDisplay, NativeAccessSpecifierPublic)
};

// ScriptStruct ConcertTransport.ConcertRequestData
// 0x0000 (0x0030 - 0x0030)
struct FConcertRequestData : public FConcertMessageData
{
};

// ScriptStruct ConcertTransport.ConcertEndpointSettings
// 0x000C (0x000C - 0x0000)
struct FConcertEndpointSettings final
{
public:
	bool                                          bEnableLogging;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         PurgeProcessedMessageDelaySeconds;                 // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemoteEndpointTimeoutSeconds;                      // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

