#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ConcertSyncCore

#include "Basic.hpp"

#include "ConcertSyncCore_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ConcertSyncCore.ConcertSyncConfig
// 0x0038 (0x0060 - 0x0028)
class UConcertSyncConfig final : public UObject
{
public:
	bool                                          bInteractiveHotReload;                             // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPresenceInPIE;                                // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SnapshotTransactionsPerSecond;                     // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransactionClassFilter>        IncludeObjectClassFilters;                         // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransactionClassFilter>        ExcludeTransactionClassFilters;                    // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TFieldPath<class FProperty>>           AllowedTransientProperties;                        // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConcertSyncConfig">();
	}
	static class UConcertSyncConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcertSyncConfig>();
	}
};

}

