#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DA_AshtonPack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_AshtonPack.DA_AshtonPack_C
// 0x0080 (0x0E10 - 0x0D90)
class ADA_AshtonPack_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PunchPicker;                                       // 0x0D98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLanded;                                         // 0x0D9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9D[0x3];                                      // 0x0D9D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  AshtonAbilityTags;                                 // 0x0DA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GC_JumpTrails;                                     // 0x0DC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GC_SkydiveTrails;                                  // 0x0DE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           PrimaryFireEventTag;                               // 0x0E00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondaryFireEventTag;                             // 0x0E08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DA_AshtonPack(int32 EntryPoint);
	void Landed(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_AshtonPack_C">();
	}
	static class ADA_AshtonPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_AshtonPack_C>();
	}
};

}

