#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DataTrackerParameterData

#include "Basic.hpp"

#include "E_DataTrackerTagTypes_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct DataTrackerParameterData.DataTrackerParameterData
// 0x0018 (0x0018 - 0x0000)
struct FDataTrackerParameterData final
{
public:
	E_DataTrackerTagTypes                         Type_4_CF035C87466B64CD227DA6806FC20AA0;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Tag_8_61F575734DB64A573924BCAFD5B4423F;            // 0x0004(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	float                                         Value_5_E5013D364BA60BD90AECCF88EFF313A4;          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackSpeed_13_C792F853487F8768F5EC91A10AE35BF9;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReleaseSpeed_14_3B43A34E49AB27C329C287B6FDF1FDE7;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

