#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DataAssetDirectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DataAssetDirectory_structs.hpp"


namespace SDK
{

// Class DataAssetDirectory.DataAssetDirectoryManager
// 0x0120 (0x0148 - 0x0028)
class UDataAssetDirectoryManager : public UObject
{
public:
	uint8                                         Pad_28[0x108];                                     // 0x0028(0x0108)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDateTime                              LastUpdateCheck;                                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdateCheckPending;                               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        UpdateCheckLimitSeconds;                           // 0x013C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0140(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFailOnError;                                      // 0x0141(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataAssetDirectoryManager">();
	}
	static class UDataAssetDirectoryManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectoryManager>();
	}
};

// Class DataAssetDirectory.DataAssetDirectorySimpleObject
// 0x0008 (0x0030 - 0x0028)
class UDataAssetDirectorySimpleObject final : public UObject
{
public:
	int32                                         IntProperty;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataAssetDirectorySimpleObject">();
	}
	static class UDataAssetDirectorySimpleObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectorySimpleObject>();
	}
};

// Class DataAssetDirectory.DataAssetDirectoryTestPODAsset
// 0x0050 (0x0078 - 0x0028)
class UDataAssetDirectoryTestPODAsset final : public UObject
{
public:
	class FString                                 AssetName;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataAssetDirectoryTestEnum                   EnumProperty;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         IntProperty;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatProperty;                                     // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolProperty;                                      // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 StringProperty;                                    // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameProperty;                                      // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   TextProperty;                                      // 0x0060(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataAssetDirectoryTestPODAsset">();
	}
	static class UDataAssetDirectoryTestPODAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectoryTestPODAsset>();
	}
};

// Class DataAssetDirectory.DataAssetDirectoryTestStructAsset
// 0x0040 (0x0068 - 0x0028)
class UDataAssetDirectoryTestStructAsset final : public UObject
{
public:
	struct FDataAssetDirectoryTestPODStruct       TestStruct;                                        // 0x0028(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataAssetDirectoryTestStructAsset">();
	}
	static class UDataAssetDirectoryTestStructAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectoryTestStructAsset>();
	}
};

// Class DataAssetDirectory.DataAssetDirectoryTestArrayAsset
// 0x0020 (0x0048 - 0x0028)
class UDataAssetDirectoryTestArrayAsset final : public UObject
{
public:
	TArray<int32>                                 IntArray;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDataAssetDirectoryTestSimpleStruct> SimpleStructArray;                            // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataAssetDirectoryTestArrayAsset">();
	}
	static class UDataAssetDirectoryTestArrayAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectoryTestArrayAsset>();
	}
};

// Class DataAssetDirectory.DataAssetDirectoryTestObjectAsset
// 0x0008 (0x0030 - 0x0028)
class UDataAssetDirectoryTestObjectAsset final : public UObject
{
public:
	class UDataAssetDirectorySimpleObject*        SimpleObject;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataAssetDirectoryTestObjectAsset">();
	}
	static class UDataAssetDirectoryTestObjectAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectoryTestObjectAsset>();
	}
};

// Class DataAssetDirectory.DataAssetDirectoryTestMapAsset
// 0x00F0 (0x0118 - 0x0028)
class UDataAssetDirectoryTestMapAsset final : public UObject
{
public:
	TMap<class FString, int32>                    StringIntMap;                                      // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    ShrinkStringIntMap;                                // 0x0078(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    GrowStringIntMap;                                  // 0x00C8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataAssetDirectoryTestMapAsset">();
	}
	static class UDataAssetDirectoryTestMapAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectoryTestMapAsset>();
	}
};

}

