#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Diagnostics_Diagnostics

#include "Basic.hpp"

#include "Diagnostics_DiagnosticsLogLevel_structs.hpp"


namespace SDK::Params
{

// Function Diagnostics_Diagnostics.Diagnostics.Log
// 0x0028 (0x0028 - 0x0000)
struct Diagnostics_Log final
{
public:
	EDiagnosticsLogLevel                          __verse_0x5B36F6B3_vLogLevel;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 __verse_0x5A4551A8_channel;                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 __verse_0xD212B012_message;                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Diagnostics_Diagnostics.Diagnostics.logCallstackToScreen
// 0x0010 (0x0010 - 0x0000)
struct Diagnostics_logCallstackToScreen final
{
public:
	class UColor*                                 __verse_0x6E3776DD_color;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x2EF20D38_duration;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Diagnostics_Diagnostics.Diagnostics.logMsg
// 0x0010 (0x0010 - 0x0000)
struct Diagnostics_logMsg final
{
public:
	class FString                                 __verse_0xD212B012_message;                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Diagnostics_Diagnostics.Diagnostics.logToScreen
// 0x0038 (0x0038 - 0x0000)
struct Diagnostics_logToScreen final
{
public:
	EDiagnosticsLogLevel                          __verse_0x5B36F6B3_vLogLevel;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 __verse_0x5A4551A8_channel;                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 __verse_0xD212B012_message;                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class UColor*                                 __verse_0x6E3776DD_color;                          // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x2EF20D38_duration;                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

