#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DynamicHUD

#include "Basic.hpp"

#include "DynamicHUD_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class DynamicHUD.DynamicHUDDirectorBase
// 0x0018 (0x0238 - 0x0220)
class ADynamicHUDDirectorBase final : public AActor
{
public:
	TArray<class UDynamicHUDScene*>               DefaultScenes;                                     // 0x0220(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicHUDWidgetCatalog*               WidgetCatalog;                                     // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDDirectorBase">();
	}
	static class ADynamicHUDDirectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicHUDDirectorBase>();
	}
};

// Class DynamicHUD.DynamicHUDConstraintBase
// 0x0008 (0x0030 - 0x0028)
class UDynamicHUDConstraintBase : public UObject
{
public:
	EDynamicHUDStrength                           Strength;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDConstraintBase">();
	}
	static class UDynamicHUDConstraintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintBase>();
	}
};

// Class DynamicHUD.DynamicHUDConstraintPosition
// 0x0040 (0x0070 - 0x0030)
class UDynamicHUDConstraintPosition final : public UDynamicHUDConstraintBase
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0058(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Position;                                          // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDAnchor                             Anchor;                                            // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDConstraintPosition">();
	}
	static class UDynamicHUDConstraintPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintPosition>();
	}
};

// Class DynamicHUD.DynamicHUDConstraintAlignment
// 0x0038 (0x0068 - 0x0030)
class UDynamicHUDConstraintAlignment final : public UDynamicHUDConstraintBase
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0058(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0061(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	EDynamicHUDAnchor                             Anchor;                                            // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDConstraintAlignment">();
	}
	static class UDynamicHUDConstraintAlignment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintAlignment>();
	}
};

// Class DynamicHUD.DynamicHUDConstraintWidget
// 0x0070 (0x00A0 - 0x0030)
class UDynamicHUDConstraintWidget final : public UDynamicHUDConstraintBase
{
public:
	TSoftClassPtr<class UClass>                   WidgetA;                                           // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagA;                                              // 0x0058(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDAnchor                             AnchorA;                                           // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftClassPtr<class UClass>                   WidgetB;                                           // 0x0068(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagB;                                              // 0x0090(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDAnchor                             AnchorB;                                           // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDConstraintWidget">();
	}
	static class UDynamicHUDConstraintWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintWidget>();
	}
};

// Class DynamicHUD.DynamicHUDConstraintComparison
// 0x0078 (0x00A8 - 0x0030)
class UDynamicHUDConstraintComparison final : public UDynamicHUDConstraintBase
{
public:
	TSoftClassPtr<class UClass>                   WidgetA;                                           // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagA;                                              // 0x0058(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDSide                               SideA;                                             // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetA;                                           // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDComparison                         Comparison;                                        // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftClassPtr<class UClass>                   WidgetB;                                           // 0x0070(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagB;                                              // 0x0098(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDSide                               SideB;                                             // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetB;                                           // 0x00A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDConstraintComparison">();
	}
	static class UDynamicHUDConstraintComparison* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintComparison>();
	}
};

// Class DynamicHUD.DynamicHUDConstraintEquation
// 0x0078 (0x00A8 - 0x0030)
class UDynamicHUDConstraintEquation final : public UDynamicHUDConstraintBase
{
public:
	TSoftClassPtr<class UClass>                   WidgetA;                                           // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagA;                                              // 0x0058(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDSide                               SideA;                                             // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDOperator                           Operator;                                          // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   WidgetB;                                           // 0x0068(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TagB;                                              // 0x0090(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDSide                               SideB;                                             // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDComparison                         Comparison;                                        // 0x009C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Result;                                            // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDConstraintEquation">();
	}
	static class UDynamicHUDConstraintEquation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDConstraintEquation>();
	}
};

// Class DynamicHUD.DynamicHUDManager
// 0x00C8 (0x00F8 - 0x0030)
class UDynamicHUDManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class UDynamicHUDScene*, uint8>          ActiveScenes;                                      // 0x0050(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FString, struct FDirectorData>     ActiveDirectors;                                   // 0x00A0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class UDynamicHUDWidgetCatalog*               CurrentWidgetCatalog;                              // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AddScene(const class UDynamicHUDScene* Scene);
	void AddScenes(const TArray<class UDynamicHUDScene*>& Scenes);
	class UDynamicHUDWidgetCatalog* GetCurrentWidgetCatalog();
	void RemoveScene(const class UDynamicHUDScene* Scene);
	void RemoveScenes(const TArray<class UDynamicHUDScene*>& Scenes);
	void SetCurrentWidgetCatalog(class UDynamicHUDWidgetCatalog* InWidgetCatalog);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDManager">();
	}
	static class UDynamicHUDManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDManager>();
	}
};

// Class DynamicHUD.DynamicHUDScene
// 0x0050 (0x0080 - 0x0030)
class UDynamicHUDScene final : public UDataAsset
{
public:
	TArray<TSoftClassPtr<class UClass>>           Allowed;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           Unallowed;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   AllowedTags;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   UnallowedTags;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDynamicHUDConstraintBase*>      LayoutConstraints;                                 // 0x0070(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDScene">();
	}
	static class UDynamicHUDScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDScene>();
	}
};

// Class DynamicHUD.DynamicHUDVisualizerWidget
// 0x0030 (0x0290 - 0x0260)
class UDynamicHUDVisualizerWidget final : public UUserWidget
{
public:
	TArray<class UDynamicHUDScene*>               Scenes;                                            // 0x0260(0x0010)(Edit, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicHUDWidgetCatalog*               WidgetCatalog;                                     // 0x0270(0x0008)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRefresh;                                          // 0x0278(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_279[0x17];                                     // 0x0279(0x0017)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDVisualizerWidget">();
	}
	static class UDynamicHUDVisualizerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDVisualizerWidget>();
	}
};

// Class DynamicHUD.DynamicHUDWidgetCatalog
// 0x0050 (0x0080 - 0x0030)
class UDynamicHUDWidgetCatalog final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FWidgetCatalogEntryClass> MapOfEntries;                         // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicHUDWidgetCatalog">();
	}
	static class UDynamicHUDWidgetCatalog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicHUDWidgetCatalog>();
	}
};

}

