#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DynamicHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicHUD.DynamicHUDManager.AddScene
// 0x0008 (0x0008 - 0x0000)
struct DynamicHUDManager_AddScene final
{
public:
	const class UDynamicHUDScene*                 Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicHUD.DynamicHUDManager.AddScenes
// 0x0010 (0x0010 - 0x0000)
struct DynamicHUDManager_AddScenes final
{
public:
	TArray<class UDynamicHUDScene*>               Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicHUD.DynamicHUDManager.GetCurrentWidgetCatalog
// 0x0008 (0x0008 - 0x0000)
struct DynamicHUDManager_GetCurrentWidgetCatalog final
{
public:
	class UDynamicHUDWidgetCatalog*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicHUD.DynamicHUDManager.RemoveScene
// 0x0008 (0x0008 - 0x0000)
struct DynamicHUDManager_RemoveScene final
{
public:
	const class UDynamicHUDScene*                 Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicHUD.DynamicHUDManager.RemoveScenes
// 0x0010 (0x0010 - 0x0000)
struct DynamicHUDManager_RemoveScenes final
{
public:
	TArray<class UDynamicHUDScene*>               Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicHUD.DynamicHUDManager.SetCurrentWidgetCatalog
// 0x0008 (0x0008 - 0x0000)
struct DynamicHUDManager_SetCurrentWidgetCatalog final
{
public:
	class UDynamicHUDWidgetCatalog*               InWidgetCatalog;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

