#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Entity_ScriptComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Entity_ScriptComponent.ScriptComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_IsEnabled final
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function Entity_ScriptComponent.ScriptComponent.addToCreateComponentList
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_addToCreateComponentList final
{
public:
	TArray<class UClass*>                         __verse_0xC3E99120_components;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function Entity_ScriptComponent.ScriptComponent.addToRequiredComponentList
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_addToRequiredComponentList final
{
public:
	TArray<class UClass*>                         __verse_0xC3E99120_components;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function Entity_ScriptComponent.ScriptComponent.getAllComponentsOfType
// 0x0018 (0x0018 - 0x0000)
struct ScriptComponent_getAllComponentsOfType final
{
public:
	class UClass*                                 __verse_0x159E825F_componentType;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function Entity_ScriptComponent.ScriptComponent.getComponentOfType
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_getComponentOfType final
{
public:
	class UClass*                                 __verse_0x159E825F_componentType;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEntityComponent*                       RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_ScriptComponent.ScriptComponent.GetFullName
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_GetFullName final
{
public:
	class FString                                 RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};

// Function Entity_ScriptComponent.ScriptComponent.GetName
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_GetName final
{
public:
	class FString                                 RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};

// Function Entity_ScriptComponent.ScriptComponent.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_OnEnabledChanged final
{
public:
	uint8                                         __verse_0x09FAA202_IsEnabled : 1;                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};

// Function Entity_ScriptComponent.ScriptComponent.OnTick
// 0x0004 (0x0004 - 0x0000)
struct ScriptComponent_OnTick final
{
public:
	float                                         __verse_0xEDA0BF94_DeltaTime;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_ScriptComponent.ScriptComponent.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_SetEnabled final
{
public:
	uint8                                         __verse_0x09FAA202_IsEnabled : 1;                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};

// Function Entity_ScriptComponent.ScriptComponent.SetTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_SetTickEnabled final
{
public:
	uint8                                         __verse_0xD50E43B9_InIsEnabled : 1;                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};

}

