#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Entity_Physics_PhysicsTrace

#include "Basic.hpp"

#include "Entity_Physics_PhysicsTraceChannel_structs.hpp"
#include "Entity_Physics_PhysicsTraceCategory_structs.hpp"
#include "Entity_Physics_PhysicsTraceType_structs.hpp"
#include "Entity_Physics_PhysicsTraceShape_structs.hpp"


namespace SDK::Params
{

// Function Entity_Physics_PhysicsTrace.Context_PhysicsTrace_WaitPhysicsTrace.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_PhysicsTrace_WaitPhysicsTrace_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_Physics_PhysicsTrace.PhysicsTrace.initPhysicsTrace
// 0x0048 (0x0048 - 0x0000)
struct PhysicsTrace_initPhysicsTrace final
{
public:
	class UObject*                                __verse_0x9866B8E7_contextObject;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicsTraceCategory                         __verse_0x8D8FA293_traceCategory;                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicsTraceType                             __verse_0xA0F73428_traceType;                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicsTraceShape                            __verse_0x30682E54_traceShape;                     // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicsTraceChannel                          __verse_0x54D810ED_traceChannel;                   // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UVector3*                               __verse_0xA0F336DD_start;                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               __verse_0xAA0F01BA_end;                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x598FB218_ignoreCallingEntity : 1;        // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UVector3*                               __verse_0x55F5C86E_traceExtent;                    // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x159DEA67_traceRadius;                    // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 __verse_0xD1A8CE6F_profileName;                    // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};

}

