#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Entity_ScaleComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Entity_ScaleComponent.ScaleComponent.addToScale
// 0x0008 (0x0008 - 0x0000)
struct ScaleComponent_addToScale final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_ScaleComponent.ScaleComponent.getScale
// 0x0008 (0x0008 - 0x0000)
struct ScaleComponent_getScale final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_ScaleComponent.ScaleComponent.GetScaleX
// 0x0004 (0x0004 - 0x0000)
struct ScaleComponent_GetScaleX final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_ScaleComponent.ScaleComponent.GetScaleY
// 0x0004 (0x0004 - 0x0000)
struct ScaleComponent_GetScaleY final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_ScaleComponent.ScaleComponent.GetScaleZ
// 0x0004 (0x0004 - 0x0000)
struct ScaleComponent_GetScaleZ final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_ScaleComponent.ScaleComponent.SetScale
// 0x0008 (0x0008 - 0x0000)
struct ScaleComponent_SetScale final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

