#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Entity_PositionComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Entity_PositionComponent.PositionComponent.addToPosition
// 0x0008 (0x0008 - 0x0000)
struct PositionComponent_addToPosition final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_PositionComponent.PositionComponent.GetPosition
// 0x0008 (0x0008 - 0x0000)
struct PositionComponent_GetPosition final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_PositionComponent.PositionComponent.SetPosition
// 0x0008 (0x0008 - 0x0000)
struct PositionComponent_SetPosition final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_PositionComponent.PositionComponent.X
// 0x0004 (0x0004 - 0x0000)
struct PositionComponent_X final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_PositionComponent.PositionComponent.Y
// 0x0004 (0x0004 - 0x0000)
struct PositionComponent_Y final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_PositionComponent.PositionComponent.Z
// 0x0004 (0x0004 - 0x0000)
struct PositionComponent_Z final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

