#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Entity_RotationComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Entity_RotationComponent.RotationComponent.addToEulerRotation
// 0x0008 (0x0008 - 0x0000)
struct RotationComponent_addToEulerRotation final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_RotationComponent.RotationComponent.getEulerRotation
// 0x0008 (0x0008 - 0x0000)
struct RotationComponent_getEulerRotation final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_RotationComponent.RotationComponent.GetForwardVector
// 0x0008 (0x0008 - 0x0000)
struct RotationComponent_GetForwardVector final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_RotationComponent.RotationComponent.GetRightVector
// 0x0008 (0x0008 - 0x0000)
struct RotationComponent_GetRightVector final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_RotationComponent.RotationComponent.GetUpVector
// 0x0008 (0x0008 - 0x0000)
struct RotationComponent_GetUpVector final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_RotationComponent.RotationComponent.setEulerRotation
// 0x0008 (0x0008 - 0x0000)
struct RotationComponent_setEulerRotation final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Entity_RotationComponent.RotationComponent.setForwardVectorFromXY
// 0x0010 (0x0010 - 0x0000)
struct RotationComponent_setForwardVectorFromXY final
{
public:
	class UVector3*                               __verse_0x6F57CF8F_x;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               __verse_0x0A307337_y;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

