#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Entity_Physics_CollisionComponent

#include "Basic.hpp"

#include "Interop_CoroutineContext_classes.hpp"
#include "EntityActor_classes.hpp"
#include "Entity_Physics_DOFMovementMode_structs.hpp"


namespace SDK
{

// SolarisGeneratedClass Entity_Physics_CollisionComponent.CollisionComponent
// 0x0010 (0x0110 - 0x0100)
class UCollisionComponent final : public UEntityActorCollisionComponent
{
public:
	uint8                                         Pad_100[0x10];                                     // 0x0100(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _InitCDO();
	void _InitInstance();
	class FString GetCollisionProfileName();
	uint8 getEnabled();
	uint8 getGravityEnabled();
	uint8 getMovable();
	uint8 getSendHitEventsOnCollide();
	uint8 getSendOverlapEvents();
	uint8 getUseContinuousCollisionDetection();
	void SetCollisionProfileName(const class FString& __verse_0x29B886CB_CollisionProfile);
	void setCustomDegreeOfFreedomConstrain(class UVector3* __verse_0x64488B5B_CustomMovementPlaneNormal);
	void setDegreeOfFreedomContraint(EDOFMovementMode __verse_0xC6FC7EEF_MovementMode);
	void SetEnabled(uint8 __verse_0xD50E43B9_InIsEnabled);
	void setGravityEnabled(uint8 __verse_0x322B83BC_EnableGravity);
	void setMovable(uint8 __verse_0xD261A0E8_IsMovable);
	void setSendHitEventsOnCollide(uint8 __verse_0x9FB5B901_EnableHitEvents);
	void setSendOverlapEvents(uint8 __verse_0xD2175A3C_EnableOverlapEvents);
	void setUseContinuousCollisionDetection(uint8 __verse_0xD79DBFC5_UseCCD);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollisionComponent">();
	}
	static class UCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollisionComponent>();
	}
};

// SolarisGeneratedClass Entity_Physics_CollisionComponent.Context_CollisionComponent_WaitBeginOverlap
// 0x0010 (0x00A8 - 0x0098)
class UContext_CollisionComponent_WaitBeginOverlap final : public UCoroutineContext
{
public:
	class UCollisionComponent*                    _Self;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlapResult*                         _RetVal;                                           // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_CollisionComponent_WaitBeginOverlap">();
	}
	static class UContext_CollisionComponent_WaitBeginOverlap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_CollisionComponent_WaitBeginOverlap>();
	}
};

// SolarisGeneratedClass Entity_Physics_CollisionComponent.Context_CollisionComponent_WaitEndOverlap
// 0x0010 (0x00A8 - 0x0098)
class UContext_CollisionComponent_WaitEndOverlap final : public UCoroutineContext
{
public:
	class UCollisionComponent*                    _Self;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlapResult*                         _RetVal;                                           // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_CollisionComponent_WaitEndOverlap">();
	}
	static class UContext_CollisionComponent_WaitEndOverlap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_CollisionComponent_WaitEndOverlap>();
	}
};

// SolarisGeneratedClass Entity_Physics_CollisionComponent.Context_CollisionComponent_WaitHit
// 0x0010 (0x00A8 - 0x0098)
class UContext_CollisionComponent_WaitHit final : public UCoroutineContext
{
public:
	class UCollisionComponent*                    _Self;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHitResult*                             _RetVal;                                           // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_CollisionComponent_WaitHit">();
	}
	static class UContext_CollisionComponent_WaitHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_CollisionComponent_WaitHit>();
	}
};

}

