#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EventModeUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function EventModeUI.FocusButton.HandleCanUseEventModeFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct FocusButton_HandleCanUseEventModeFocusChanged final
{
public:
	bool                                          bCanUseEventModeFocus;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EventModeUI.FocusButton.HandleEventModeFocusingChanged
// 0x0001 (0x0001 - 0x0000)
struct FocusButton_HandleEventModeFocusingChanged final
{
public:
	bool                                          bIsEventModeFocusing;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EventModeUI.FortEventModeEmotesWidget.OnFocusAvailableChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEventModeEmotesWidget_OnFocusAvailableChanged final
{
public:
	bool                                          bIsFocusAvailable;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EventModeUI.FortEventModeEmotesWidget.OnFocusStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEventModeEmotesWidget_OnFocusStateChanged final
{
public:
	bool                                          bIsFocusing;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EventModeUI.FortMobileActionButtonBehavior_Focus.HandleCanUseEventModeFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortMobileActionButtonBehavior_Focus_HandleCanUseEventModeFocusChanged final
{
public:
	bool                                          bCanUseEventModeFocus;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EventModeUI.FortMobileActionButtonBehavior_Focus.HandleEventModeFocusingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortMobileActionButtonBehavior_Focus_HandleEventModeFocusingChanged final
{
public:
	bool                                          bIsEventModeFocusing;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

