#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FoleySound

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FoleySound_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class FoleySound.AnimNotifyState_FoleySound
// 0x0018 (0x0048 - 0x0030)
class UAnimNotifyState_FoleySound final : public UAnimNotifyState
{
public:
	class UFoleySoundContext*                     SoundContext;                                      // 0x0030(0x0008)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFoleyPlaySoundResult                  PlaybackResult;                                    // 0x0038(0x000C)(BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bShouldStopOnEnd;                                  // 0x0044(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_FoleySound">();
	}
	static class UAnimNotifyState_FoleySound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_FoleySound>();
	}
};

// Class FoleySound.FoleySoundSubsystem
// 0x00F0 (0x0120 - 0x0030)
class UFoleySoundSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0xF0];                                      // 0x0030(0x00F0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddLibrary(const class AActor* Actor, TSubclassOf<class UFoleySoundLibrary> Library);
	void RemoveLibrary(const class AActor* Actor, TSubclassOf<class UFoleySoundLibrary> Library);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FoleySoundSubsystem">();
	}
	static class UFoleySoundSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFoleySoundSubsystem>();
	}
};

// Class FoleySound.FoleySoundContext
// 0x0008 (0x0030 - 0x0028)
class UFoleySoundContext : public UObject
{
public:
	class AActor*                                 Actor;                                             // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FoleySoundContext">();
	}
	static class UFoleySoundContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFoleySoundContext>();
	}
};

// Class FoleySound.SimpleFoleyContext
// 0x0010 (0x0040 - 0x0030)
class USimpleFoleyContext final : public UFoleySoundContext
{
public:
	struct FGameplayTag                           EventName;                                         // 0x0030(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs1P;                                             // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleFoleyContext">();
	}
	static class USimpleFoleyContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleFoleyContext>();
	}
};

// Class FoleySound.FoleySoundLibrary
// 0x0088 (0x00B0 - 0x0028)
class UFoleySoundLibrary : public UObject
{
public:
	TMap<struct FGameplayTag, TSoftObjectPtr<class USoundBase>> Sounds;                              // 0x0028(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     LoadedSoundObjects;                                // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FoleySoundLibrary">();
	}
	static class UFoleySoundLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFoleySoundLibrary>();
	}
};

}

