#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteConversationUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteConversationUI_structs.hpp"
#include "FortniteConversationRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FortniteConversationUI.FortBasicBrief.OnChoiceTextReceived
// 0x0018 (0x0018 - 0x0000)
struct FortBasicBrief_OnChoiceTextReceived final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortItemTransactionBrief.OnTransactionInfoReceived
// 0x0008 (0x0008 - 0x0000)
struct FortItemTransactionBrief_OnTransactionInfoReceived final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBuyBrief.OnDisplayUnavailability
// 0x0001 (0x0001 - 0x0000)
struct FortBuyBrief_OnDisplayUnavailability final
{
public:
	ECannotBuyReason                              CannotBuyReason;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortBuyBrief.OnPurchaseDataReceived
// 0x0008 (0x0008 - 0x0000)
struct FortBuyBrief_OnPurchaseDataReceived final
{
public:
	int32                                         StackSize;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemainingForSale;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnInteractionRangeChanged
// 0x0001 (0x0001 - 0x0000)
struct FortConversationMarker_OnInteractionRangeChanged final
{
public:
	EInteractionRange                             TargetInteractionRange;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnMessageShownOverActor
// 0x0008 (0x0008 - 0x0000)
struct FortConversationMarker_OnMessageShownOverActor final
{
public:
	class AActor*                                 OverActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMarker.OnSetIndicatedActor
// 0x0008 (0x0008 - 0x0000)
struct FortConversationMarker_OnSetIndicatedActor final
{
public:
	class AActor*                                 NewIndicatorActor;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationScreen.OnConversationOptionUnavailable
// 0x0008 (0x0008 - 0x0000)
struct FortConversationScreen_OnConversationOptionUnavailable final
{
public:
	class UFortRadialSlot*                        SelectedEntry;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationScreen.OnItemSelected
// 0x0004 (0x0004 - 0x0000)
struct FortConversationScreen_OnItemSelected final
{
public:
	int32                                         OriginalIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationScreen.OnSelectedItemAvailabilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortConversationScreen_OnSelectedItemAvailabilityChanged final
{
public:
	bool                                          bIsAvailable;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMessageWidget.OnMainMessageSet
// 0x0030 (0x0030 - 0x0000)
struct FortConversationMessageWidget_OnMainMessageSet final
{
public:
	class FText                                   NPCName;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   MessageBody;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMessageWidget.OnPreviewMessageSet
// 0x0018 (0x0018 - 0x0000)
struct FortConversationMessageWidget_OnPreviewMessageSet final
{
public:
	class FText                                   PreviewText;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationMessageWidget.SetPreviewMessage
// 0x0018 (0x0018 - 0x0000)
struct FortConversationMessageWidget_SetPreviewMessage final
{
public:
	class FText                                   MessageToSet;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.OnSetupFromDisplayAsset
// 0x0008 (0x0008 - 0x0000)
struct FortConversationOption_OnSetupFromDisplayAsset final
{
public:
	class UObject*                                DisplayAsset;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.OnSetupFromItemDef
// 0x0008 (0x0008 - 0x0000)
struct FortConversationOption_OnSetupFromItemDef final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.OnSetupPivotFromRadialInformation
// 0x0008 (0x0008 - 0x0000)
struct FortConversationOption_OnSetupPivotFromRadialInformation final
{
public:
	int32                                         NumElements;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOption.IsAvailable
// 0x0001 (0x0001 - 0x0000)
struct FortConversationOption_IsAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortConversationOptionsPanel.AddChildToDynamicPanel
// 0x0010 (0x0010 - 0x0000)
struct FortConversationOptionsPanel_AddChildToDynamicPanel final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPanelSlot*                             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortDuelBrief.DisplayLootItems
// 0x0010 (0x0010 - 0x0000)
struct FortDuelBrief_DisplayLootItems final
{
public:
	TArray<class UFortItem*>                      Items;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortQuestBrief.OnQuestExpirationTimeSet
// 0x0001 (0x0001 - 0x0000)
struct FortQuestBrief_OnQuestExpirationTimeSet final
{
public:
	bool                                          bDisplayExpirationTime;                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortQuestBrief.OnQuestInformationRecieved
// 0x00A8 (0x00A8 - 0x0000)
struct FortQuestBrief_OnQuestInformationRecieved final
{
public:
	class FText                                   Objective;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortRarityItemData                    RarityData;                                        // 0x0018(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CategoryTag;                                       // 0x0098(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         XPReward;                                          // 0x00A0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MoneyReward;                                       // 0x00A4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortTransactionStrip.OnTransactionInfoReceived
// 0x0008 (0x0008 - 0x0000)
struct FortTransactionStrip_OnTransactionInfoReceived final
{
public:
	int32                                         TransactionCost;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedCurrency;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortUpgradeBrief.OnUnableToUpgrade
// 0x0001 (0x0001 - 0x0000)
struct FortUpgradeBrief_OnUnableToUpgrade final
{
public:
	EFortWeaponUpgradeInteractionResult           CannotUpgradeCause;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteConversationUI.FortUpgradeBrief.OnUpgradeInfoReceived
// 0x0008 (0x0008 - 0x0000)
struct FortUpgradeBrief_OnUpgradeInfoReceived final
{
public:
	class UFortItem*                              CurrentWeapon;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

