#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteConversationRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonDialogueRuntime_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// Class FortniteConversationRuntime.FortConversationContextCondition
// 0x0000 (0x0028 - 0x0028)
class UFortConversationContextCondition : public UObject
{
public:
	bool DoesContextPass(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition">();
	}
	static class UFortConversationContextCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantHasMetaTag
// 0x0010 (0x0038 - 0x0028)
class UFortConversationContextCondition_ParticipantHasMetaTag final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           MetaTag;                                           // 0x0030(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantHasMetaTag">();
	}
	static class UFortConversationContextCondition_ParticipantHasMetaTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantHasMetaTag>();
	}
};

// Class FortniteConversationRuntime.FortConversationMarkerInterface
// 0x0000 (0x0000 - 0x0000)
class IFortConversationMarkerInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationMarkerInterface">();
	}
	static class IFortConversationMarkerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortConversationMarkerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FortniteConversationRuntime.FortConversationParticipantComponent
// 0x0000 (0x0168 - 0x0168)
class UFortConversationParticipantComponent : public UConversationParticipantComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationParticipantComponent">();
	}
	static class UFortConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationParticipantComponent>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantHasCID
// 0x0018 (0x0040 - 0x0028)
class UFortConversationContextCondition_ParticipantHasCID final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSoftObjectPath>                AllowedCIDs;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantHasCID">();
	}
	static class UFortConversationContextCondition_ParticipantHasCID* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantHasCID>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantHasOwnedTag
// 0x0010 (0x0038 - 0x0028)
class UFortConversationContextCondition_ParticipantHasOwnedTag final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           OwnedTag;                                          // 0x0030(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantHasOwnedTag">();
	}
	static class UFortConversationContextCondition_ParticipantHasOwnedTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantHasOwnedTag>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantControllerMeetsRequirement
// 0x0010 (0x0038 - 0x0028)
class UFortConversationContextCondition_ParticipantControllerMeetsRequirement final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortControllerRequirement*             Requirement;                                       // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantControllerMeetsRequirement">();
	}
	static class UFortConversationContextCondition_ParticipantControllerMeetsRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantControllerMeetsRequirement>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextConditionHelpers
// 0x0000 (0x0028 - 0x0028)
class UFortConversationContextConditionHelpers final : public UBlueprintFunctionLibrary
{
public:
	static bool GetMessageForContext(const struct FFortConversationNodeConditionalMessages& Messages, const struct FConversationContext& Context, class FText* OutText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextConditionHelpers">();
	}
	static class UFortConversationContextConditionHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextConditionHelpers>();
	}
};

// Class FortniteConversationRuntime.FortPlayerConversationComponent
// 0x01A8 (0x0310 - 0x0168)
class UFortPlayerConversationComponent : public UFortConversationParticipantComponent
{
public:
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UFortNonPlayerConversationParticipantComponent*> ConversationParticipantsInRange;   // 0x0170(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DialogWidgetSoftClass;                             // 0x0180(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DialogMarkerSoftClass;                             // 0x01A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   MobileDialogWidgetSoftClass;                       // 0x01D0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                DialogWidgetClass;                                 // 0x01F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                DialogMarkerClass;                                 // 0x0200(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         GreetSphereRadius;                                 // 0x0208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         IconVisibilityRadius;                              // 0x020C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AbortConversationRange;                            // 0x0210(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_214[0x2C];                                     // 0x0214(0x002C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUserWidgetPool                        DialogWidgetPool;                                  // 0x0240(0x0080)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class UFortNonPlayerConversationParticipantComponent*, class UUserWidget*> ComponentToIndicator; // 0x02C0(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void HandleWaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void RequestServerAbortConversation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerConversationComponent">();
	}
	static class UFortPlayerConversationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerConversationComponent>();
	}
};

}

