#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteEngineLoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class FortniteEngineLoadingScreen.FortniteUserInterfaceSettings
// 0x0550 (0x0588 - 0x0038)
class UFortniteUserInterfaceSettings final : public UDeveloperSettings
{
public:
	struct FRuntimeFloatCurve                     WidthScaleCurve;                                   // 0x0038(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve;                                  // 0x00C0(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_iOS_InGame;                        // 0x0148(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_iOS_InGame;                       // 0x01D0(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_iOS_FrontEnd;                      // 0x0258(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_iOS_FrontEnd;                     // 0x02E0(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_Android_InGame;                    // 0x0368(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_Android_InGame;                   // 0x03F0(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_Android_FrontEnd;                  // 0x0478(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_Android_FrontEnd;                 // 0x0500(0x0088)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortniteUserInterfaceSettings">();
	}
	static class UFortniteUserInterfaceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortniteUserInterfaceSettings>();
	}
};

}

