#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent

#include "Basic.hpp"

#include "GA_Athena_ActivePower_StandardActivation_Parent_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent.GA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_C
// 0x0038 (0x0CB8 - 0x0C80)
class UGA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_C : public UGA_Athena_ActivePower_StandardActivation_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_C; // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CommitOnEveryTargeting;                            // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C89[0x3];                                      // 0x0C89(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Tag_ApplyEffectNotify;                             // 0x0C8C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C94[0x4];                                      // 0x0C94(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 GE_ToApply;                                        // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectLevel;                                       // 0x0CA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEH_ToApply;                                       // 0x0CA4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_ApplyEffect;                                    // 0x0CAC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyEffectGCUsesParams;                           // 0x0CB4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EndAbilityAfterApply;                              // 0x0CB5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent(int32 EntryPoint);
	void CastMontageBlendOut();
	void ApplyEffectToSelf();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void CastMontageNotifyEndAbility();
	void CastMontageCancelledOrInterrupted();
	void PowerCommitFailed();
	struct FGameplayCueParameters ApplyEffectGCParams();
	struct FGameplayEffectSpecHandle MakeEffectSpec();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_C">();
	}
	static class UGA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_C>();
	}
};

}

