#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Athena_Throw_SneakySnowmanV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_ThrowConsumable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Throw_SneakySnowmanV2.GA_Athena_Throw_SneakySnowmanV2_C
// 0x0088 (0x0ED0 - 0x0E48)
class UGA_Athena_Throw_SneakySnowmanV2_C : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_Throw_SneakySnowmanV2_C;  // 0x0E48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftClassPtr<class UClass>                   GolfCartSoftClass;                                 // 0x0E50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x0E80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attribute;                                         // 0x0E90(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 AttributeCostGE;                                   // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2(int32 EntryPoint);
	void K2_CommitExecute();
	void K2_ActivateAbility();

	void SpawnLocationAndRotation(struct FVector* OutLoc, struct FRotator* OutRot) const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Throw_SneakySnowmanV2_C">();
	}
	static class UGA_Athena_Throw_SneakySnowmanV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Throw_SneakySnowmanV2_C>();
	}
};

}

