#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Athena_ActivePower_StandardActivation_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Athena_ActivePower_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ActivePower_StandardActivation_Parent.GA_Athena_ActivePower_StandardActivation_Parent_C
// 0x00F0 (0x0C80 - 0x0B90)
class UGA_Athena_ActivePower_StandardActivation_Parent_C : public UGA_Athena_ActivePower_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_StandardActivation_Parent_C; // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ActivatesOnRelease;                                // 0x0B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BlockMovementDuringHold;                           // 0x0B99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Charges;                                           // 0x0B9A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9B[0x1];                                      // 0x0B9B(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ChargeTime;                                        // 0x0B9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MaxChargeTime;                                 // 0x0BA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ChargePercent;                                     // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            Curve_ChargeMultiplier;                            // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeMultiplier;                                  // 0x0BD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargePercentMin;                                  // 0x0BDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargePercentMax;                                  // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayCastOnActivate;                                // 0x0BE4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnActivatedJumpToCastSection;                      // 0x0BE5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE6[0x2];                                      // 0x0BE6(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   CastSectionName;                                   // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HoverOnActivate;                                   // 0x0BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          StopHoverOnRelease;                                // 0x0BF1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OverlapPawnCollisionDuringAbility;                 // 0x0BF2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EndOnWaterEnter;                                   // 0x0BF3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF4[0x4];                                      // 0x0BF4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           Timer_ReachedMaxCharge;                            // 0x0BF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_MaxCharge;                                      // 0x0C00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          MaxChargeGCUsesParams;                             // 0x0C08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C09[0x3];                                      // 0x0C09(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           GC_InputHeldLoop;                                  // 0x0C0C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          InputHeldLoopGCUsesParams;                         // 0x0C14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C15[0x3];                                      // 0x0C15(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 ActivateCameraMode;                                // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClearsCameraModeOnRelease;                         // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ReleaseFiresIfOnCooldown;                          // 0x0C21(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RemoveEffectsOnPress;                              // 0x0C22(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RemoveEffectsOnRelease;                            // 0x0C23(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C24[0x4];                                      // 0x0C24(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FGameplayTag>                   GrantedTagsToRemove;                               // 0x0C28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   AssetTagsToRemove;                                 // 0x0C38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Charging;                                          // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C49[0x3];                                      // 0x0C49(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Tag_DBNO;                                          // 0x0C4C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EndOnDBNO;                                         // 0x0C54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C55[0x3];                                      // 0x0C55(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         HoverTimeLimit;                                    // 0x0C58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5C[0x4];                                      // 0x0C5C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           HoverTimer;                                        // 0x0C60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TestAlreadyReleased;                               // 0x0C68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C69[0x3];                                      // 0x0C69(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Tag_Knockback;                                     // 0x0C6C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EndOnKnockback;                                    // 0x0C74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C75[0x3];                                      // 0x0C75(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           Tag_CancelPower;                                   // 0x0C78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_StandardActivation_Parent(int32 EntryPoint);
	void TurnOffHover();
	void SetupCancelBinds();
	void Released(float HoldTime);
	void ResetActivationReleaseDoOnce();
	void InitActivateOnRelease();
	void ReachedMaxCharge();
	void SetWaterBinding();
	void PlayerEnterWater(class AFortPlayerPawn* FortPlayerPawn);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAbilityActivated();
	void Added_07BC1D794BE0002195A38CB4134458E6();
	void Added_801F31CD4D620EDDB68D17B410BDB787();
	void Added_E9914498452A35619843A98F9F1B9632();
	void OnRelease_018C747C4949783488106FB2DE06764D(float TimeHeld);
	void CalculateReleaseTime(float ReleaseTime);
	void CalculateCharge(float ChargeTime_0);
	struct FGameplayCueParameters MaxChargeGCParams();
	struct FGameplayCueParameters InputHeldLoopGCParams();
	void Set_Valid_Camera(class UClass* InputPin);
	void ClearReleaseCameraMode();
	void InitAbility();
	void RemoveSpecifiedEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ActivePower_StandardActivation_Parent_C">();
	}
	static class UGA_Athena_ActivePower_StandardActivation_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_StandardActivation_Parent_C>();
	}
};

}

