#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Cosmos_MeleeAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Cosmos_MeleeAttack.GA_Cosmos_MeleeAttack_C
// 0x0198 (0x0C50 - 0x0AB8)
class UGA_Cosmos_MeleeAttack_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x0AC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SuccessfulHit;                                     // 0x0AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE9[0x3];                                      // 0x0AE9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           MeleeMissCue;                                      // 0x0AEC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_FindTarget;                                    // 0x0AF4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FailsafeAbilityDuration;                           // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Fail_Safe_Timer_Handle;                            // 0x0B00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToTarget;                                  // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActorsCombinedScaledRadiusSize;                    // 0x0B14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DesiredLandingDistanceFromTarget;                  // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinTravelDuration;                                 // 0x0B40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxTravelDuration;                                 // 0x0B68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveVector*                           PathOffsetCurve;                                   // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         TravelDistanceNoTarget;                            // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_DamageContainer;                               // 0x0BC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_EndAbility;                                    // 0x0BC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstrainNoTargetMovementToHorizontalOnly;         // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD1[0x7];                                      // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         SpeedAfterTravelNoTarget;                          // 0x0BD8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ZVelocityClampAfterTravelNoTarget;                 // 0x0C00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityTask_ApplyRootMotionMoveToActorForce* Root_Motion_Move_To_Actor_Task;              // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* Root_Motion_Move_To_Force_Task;                   // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartSection;                                      // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MontageSkipDistance;                               // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MontageSkipSwingCue;                               // 0x0C44(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Cosmos_MeleeAttack(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void FinishedMoving();
	void Fail_Safe_Timer();
	void Finish_Ability();
	void Targeted_DB6139E54974E4A27C34B3B144B01901(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_DB6139E54974E4A27C34B3B144B01901(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnTimedOut_55988410466F4B811603C39FBDEDB75B();
	void OnTimedOutAndDestinationReached_55988410466F4B811603C39FBDEDB75B();
	void OnFinished_09748868457E0AA8857B9F89F6E42535(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation);
	void Targeted_453821FA48EC0BD4FC67B885836EB33D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_453821FA48EC0BD4FC67B885836EB33D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnCompleted_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnBlendOut_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnInterrupted_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnCancelled_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnNotifyBegin_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnNotifyEnd_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);

	bool ShouldPlayFailedMontage(const struct FGameplayTagContainer& FailedReason) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Cosmos_MeleeAttack_C">();
	}
	static class UGA_Cosmos_MeleeAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Cosmos_MeleeAttack_C>();
	}
};

}

