#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_WaffleTruck_TrackingPistol_Indicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_WaffleTruck_TrackingPistol_Indicator.GA_WaffleTruck_TrackingPistol_Indicator_C
// 0x0060 (0x0B18 - 0x0AB8)
class UGA_WaffleTruck_TrackingPistol_Indicator_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         HitActors;                                         // 0x0AC0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class UParticleSystem*                        IndicatorParticleSystem;                           // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IndicatorActorParamName;                           // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IndicatorVectorParamName;                          // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 IndicatorGroupID;                                  // 0x0AE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         IndicatorDuration;                                 // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AFC[0x4];                                      // 0x0AFC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             IndicatorSound;                                    // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         EnemyMarkingGE;                                    // 0x0B08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_WaffleTruck_TrackingPistol_Indicator(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void GetAvatarAsFortPawn(class AFortPawn** AsFort_Pawn);
	class AFortPlayerController* GetAvatarAsFortPlayerController();
	TArray<class AActor*> GetHitActorsFromEventData(const struct FGameplayEventData& GameplayEventData);
	bool IsPawnAndNotFriendly(const class AActor* OwningController, const class AActor* HitActor);
	bool IsDamgeFromSourceWeapon(const struct FGameplayEventData& GameplayEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_WaffleTruck_TrackingPistol_Indicator_C">();
	}
	static class UGA_WaffleTruck_TrackingPistol_Indicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_WaffleTruck_TrackingPistol_Indicator_C>();
	}
};

}

