#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayBehaviorsModule

#include "Basic.hpp"


namespace SDK
{

// Enum GameplayBehaviorsModule.EGameplayBehaviorInstantiationPolicy
// NumValues: 0x0004
enum class EGameplayBehaviorInstantiationPolicy : uint8
{
	Instantiate                              = 0,
	ConditionallyInstantiate                 = 1,
	DontInstantiate                          = 2,
	EGameplayBehaviorInstantiationPolicy_MAX = 3,
};

// ScriptStruct GameplayBehaviorsModule.AgentGameplayBehaviors
// 0x0010 (0x0010 - 0x0000)
struct FAgentGameplayBehaviors final
{
public:
	TArray<class UGameplayBehavior*>              Behaviors;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayBehaviorsModule.MontagePlaybackData
// 0x0048 (0x0048 - 0x0000)
struct FMontagePlaybackData final
{
public:
	class AActor*                                 Avatar;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           AnimMontage;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                AbilityComponent;                                  // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x30];                                      // 0x0018(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

