#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayStateMachine

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameplayStateMachine.GameplayState.AddStateRuntimeTag
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_AddStateRuntimeTag final
{
public:
	struct FGameplayTag                           AddedTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.BeginStateEvent
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_BeginStateEvent final
{
public:
	struct FGameplayTag                           PrevStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.BeginStateEventClient
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_BeginStateEventClient final
{
public:
	struct FGameplayTag                           PrevStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.BeginStateEventServer
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_BeginStateEventServer final
{
public:
	struct FGameplayTag                           PrevStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.EndStateEvent
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_EndStateEvent final
{
public:
	struct FGameplayTag                           NextStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.EndStateEventClient
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_EndStateEventClient final
{
public:
	struct FGameplayTag                           NextStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.EndStateEventServer
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_EndStateEventServer final
{
public:
	struct FGameplayTag                           NextStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.RemoveStateRuntimeTag
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_RemoveStateRuntimeTag final
{
public:
	struct FGameplayTag                           RemovedTag;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.UpdateStateEvent
// 0x0004 (0x0004 - 0x0000)
struct GameplayState_UpdateStateEvent final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.UpdateStateEventClient
// 0x0004 (0x0004 - 0x0000)
struct GameplayState_UpdateStateEventClient final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.UpdateStateEventServer
// 0x0004 (0x0004 - 0x0000)
struct GameplayState_UpdateStateEventServer final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.GetGameplayStateMachine
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_GetGameplayStateMachine final
{
public:
	class UGameplayStateMachine*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.GetOwningActor
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_GetOwningActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.GetStateId
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_GetStateId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.GetStateRuntimeTags
// 0x0020 (0x0020 - 0x0000)
struct GameplayState_GetStateRuntimeTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.HasAuthority
// 0x0001 (0x0001 - 0x0000)
struct GameplayState_HasAuthority final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.SetState
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_SetState final
{
public:
	struct FGameplayTag                           InStateId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.GetActiveStateId
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetActiveStateId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.GetActiveStateObject
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetActiveStateObject final
{
public:
	class UGameplayState*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.GetStateMachineId
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetStateMachineId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

