#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayBehaviorsModule

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameplayBehaviorsModule.GameplayBehavior.K2_AbortBehavior
// 0x0008 (0x0008 - 0x0000)
struct GameplayBehavior_K2_AbortBehavior final
{
public:
	class AActor*                                 Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_EndBehavior
// 0x0008 (0x0008 - 0x0000)
struct GameplayBehavior_K2_EndBehavior final
{
public:
	class AActor*                                 Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_OnFinished
// 0x0010 (0x0010 - 0x0000)
struct GameplayBehavior_K2_OnFinished final
{
public:
	class AActor*                                 Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasInterrupted;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_OnFinishedCharacter
// 0x0010 (0x0010 - 0x0000)
struct GameplayBehavior_K2_OnFinishedCharacter final
{
public:
	class ACharacter*                             Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasInterrupted;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_OnFinishedPawn
// 0x0010 (0x0010 - 0x0000)
struct GameplayBehavior_K2_OnFinishedPawn final
{
public:
	class APawn*                                  Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasInterrupted;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_OnTriggered
// 0x0010 (0x0010 - 0x0000)
struct GameplayBehavior_K2_OnTriggered final
{
public:
	class AActor*                                 Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UGameplayBehaviorConfig*          Config;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_OnTriggeredCharacter
// 0x0010 (0x0010 - 0x0000)
struct GameplayBehavior_K2_OnTriggeredCharacter final
{
public:
	class ACharacter*                             Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UGameplayBehaviorConfig*          Config;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_OnTriggeredPawn
// 0x0010 (0x0010 - 0x0000)
struct GameplayBehavior_K2_OnTriggeredPawn final
{
public:
	class APawn*                                  Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UGameplayBehaviorConfig*          Config;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_TriggerBehavior
// 0x0010 (0x0010 - 0x0000)
struct GameplayBehavior_K2_TriggerBehavior final
{
public:
	class AActor*                                 Avatar;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayBehaviorConfig*                Config;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayBehaviorsModule.GameplayBehavior.K2_GetNextActorIndexInSequence
// 0x0008 (0x0008 - 0x0000)
struct GameplayBehavior_K2_GetNextActorIndexInSequence final
{
public:
	int32                                         CurrentIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayBehaviorsModule.GameplayBehavior_AnimationBased.OnMontageFinished
// 0x0018 (0x0018 - 0x0000)
struct GameplayBehavior_AnimationBased_OnMontageFinished final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 InAvatar;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

