#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GCNL_Nightmare_Cloak_Loop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "NightmareRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Nightmare_Cloak_Loop.GCNL_Nightmare_Cloak_Loop_C
// 0x0220 (0x0A08 - 0x07E8)
class AGCNL_Nightmare_Cloak_Loop_C final : public AFortNightmareGameCueNotifyLoop_Cloak
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_InteractionFadeInOut_Visbility_C77E5F5F4F157688A242B6998BCC9E95; // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_InteractionFadeInOut__Direction_C77E5F5F4F157688A242B6998BCC9E95; // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F5[0x3];                                      // 0x07F5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline_InteractionFadeInOut;                     // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_Duration;                                      // 0x0800(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ExpireTellDuration;                            // 0x0828(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_StationaryVisMult;                             // 0x0850(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxSpeedVisMult;                               // 0x0878(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAudioComponent*>                LoopingAudioComponents;                            // 0x08A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class UFXSystemComponent*                     AttachedFXHead;                                    // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     AttachedFXBody;                                    // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ExpireTellDelayTimer;                              // 0x08C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         PlayerSkeletalMeshes;                              // 0x08C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FScalableFloat                         Row_FriendlyVisMultMin;                            // 0x08D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_InteractVisMultAddMax;                         // 0x0900(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_VisibilityLevelChangeRate;                     // 0x0928(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   MatParameterName_MovementOpacity;                  // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteractVisMultAddMax;                             // 0x0958(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AudioVelocityInterp;                               // 0x095C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AudioParameterName_Velocity;                       // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExpirationSoundPeriod;                             // 0x0968(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96C[0x4];                                      // 0x096C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           ExpirationSoundTimer;                              // 0x0970(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_Cloaked;                                         // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  MaterialOverrideId;                                // 0x0980(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  PartTypes;                                         // 0x0990(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeApplyingCloakMaterialOverride;          // 0x09A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           ApplyCloakMaterialOverrideHandle;                  // 0x09A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeRemovingCloakMaterialOverride;          // 0x09B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           RemoveCloakMaterialOverrideHandle;                 // 0x09B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DeactivateFXTemplate;                              // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ActivateFXTemplate;                                // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExpirationSoundPeriodScale;                        // 0x09D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D4[0x4];                                      // 0x09D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortPawnMaterialOverrideCopiedParameters MaterialParametersToCopy;                       // 0x09D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCNL_Nightmare_Cloak_Loop(int32 EntryPoint);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void Initialize_Player_Skeletal_Meshes();
	void UpdateTeamVisbility();
	void SetMaterialCloaked();
	void EndedInteract();
	void StartedInteract();
	void SetMaterialUncloaked();
	void Audio_Tick(float Velocity);
	void ExpireWarningTick();
	void ClearExpireTell();
	void BeginExpireTell();
	void ReceiveTick(float DeltaSeconds);
	void OnLoopingStartGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Timeline_InteractionFadeInOut__UpdateFunc();
	void Timeline_InteractionFadeInOut__FinishedFunc();
	bool ShouldRenderAsLocalPlayer();
	void IsPlayerControllerFriendly(class AController* PlayerController, bool* Is_Friendly_Player);
	void ApplyCloakMaterialOverride();
	void RemoveCloakMaterialOverride();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Nightmare_Cloak_Loop_C">();
	}
	static class AGCNL_Nightmare_Cloak_Loop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Nightmare_Cloak_Loop_C>();
	}
};

}

