#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GooseRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GooseRuntime.AthenaGoosePickup.OnCollide
// 0x0008 (0x0008 - 0x0000)
struct AthenaGoosePickup_OnCollide final
{
public:
	class AActor*                                 CollidingActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.AthenaGoosePickup.SetStaticMesh
// 0x0020 (0x0020 - 0x0000)
struct AthenaGoosePickup_SetStaticMesh final
{
public:
	class UStaticMesh*                            NewStaticMesh;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MaterialsToSwap;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InDisplayIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GooseRuntime.FortAthenaMutator_Goose.HandleClientPawnEnteredVehicle
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaMutator_Goose_HandleClientPawnEnteredVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              Pawn;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GooseRuntime.FortAthenaMutator_Goose.HandleClientPawnExitedVehicle
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaMutator_Goose_HandleClientPawnExitedVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              Pawn;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GooseRuntime.FortAthenaMutator_Goose.HandleClientVehicleDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Goose_HandleClientVehicleDestroyed final
{
public:
	class AActor*                                 VehicleActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortAthenaMutator_Goose.KillPlayerPawns
// 0x0040 (0x0040 - 0x0000)
struct FortAthenaMutator_Goose_KillPlayerPawns final
{
public:
	TArray<TWeakObjectPtr<class AFortPlayerPawn>> PawnsToKill;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DeathReasonTags;                                   // 0x0010(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortAthenaMutator_Goose.OnPawnDied
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Goose_OnPawnDied final
{
public:
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortAthenaMutator_Goose.OnVehicleDied
// 0x0038 (0x0038 - 0x0000)
struct FortAthenaMutator_Goose_OnVehicleDied final
{
public:
	class AFortAthenaVehicle*                     DestroyedVehicle;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortAthenaMutator_Goose.OnVehicleStolen
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_Goose_OnVehicleStolen final
{
public:
	uint8                                         OldID;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NewID;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortCheatManager_Goose.GooseGivePlaneBoostGE
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Goose_GooseGivePlaneBoostGE final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortCheatManager_Goose.GooseGivePlaneEffect
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Goose_GooseGivePlaneEffect final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortCheatManager_Goose.GooseGivePlaneHealthGE
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Goose_GooseGivePlaneHealthGE final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortCheatManager_Goose.GooseSetPlaneHealthPercent
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Goose_GooseSetPlaneHealthPercent final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortCheatManager_Goose.GooseSetPlaneLives
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Goose_GooseSetPlaneLives final
{
public:
	int32                                         NewLives;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortCheatManager_Goose.GooseToggleDrops
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_Goose_GooseToggleDrops final
{
public:
	bool                                          bToggleValue;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseRuntime.FortCheatManager_Goose.GooseUpgradePlaneGuns
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Goose_GooseUpgradePlaneGuns final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

