#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GooseUI

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "GooseUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class GooseUI.GooseInventoryWidget
// 0x0068 (0x0380 - 0x0318)
class UGooseInventoryWidget final : public ULTMWidgetBase
{
public:
	struct FScalableFloat                         WidgetEnabled;                                     // 0x0318(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x40];                                     // 0x0340(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CloseWidget();
	void OpenWidget(class UTexture2D* IconTexture, const class UFortWorldItemDefinition* ItemDef);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GooseInventoryWidget">();
	}
	static class UGooseInventoryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGooseInventoryWidget>();
	}
};

// Class GooseUI.GooseWidgetBase
// 0x0018 (0x0330 - 0x0318)
class UGooseWidgetBase : public ULTMWidgetBase
{
public:
	uint8                                         Pad_318[0x18];                                     // 0x0318(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnUpdateNumberOfPlanes(int32 FriendlyPlaneCount, int32 EnemyPlaneCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GooseWidgetBase">();
	}
	static class UGooseWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGooseWidgetBase>();
	}
};

// Class GooseUI.GooseLeaderboardWidget
// 0x0008 (0x0338 - 0x0330)
class UGooseLeaderboardWidget final : public UGooseWidgetBase
{
public:
	uint8                                         Pad_330[0x4];                                      // 0x0330(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bOnlyListEnemySquads;                              // 0x0334(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void UpdateLeaderboardUI(const TArray<struct FGooseLeaderboardData>& SortedLeaderboardInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GooseLeaderboardWidget">();
	}
	static class UGooseLeaderboardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGooseLeaderboardWidget>();
	}
};

// Class GooseUI.GoosePlanePickupWidget
// 0x0030 (0x0348 - 0x0318)
class UGoosePlanePickupWidget final : public ULTMWidgetBase
{
public:
	TArray<struct FGoosePickupDisplayData>        DisplayData;                                       // 0x0318(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x20];                                     // 0x0328(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CloseWidget();
	void OpenWidget(int32 DisplayIndex, class FName ChestName, const class FText& DisplayText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GoosePlanePickupWidget">();
	}
	static class UGoosePlanePickupWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGoosePlanePickupWidget>();
	}
};

// Class GooseUI.GoosePlaneWeaponWidget
// 0x0030 (0x0348 - 0x0318)
class UGoosePlaneWeaponWidget final : public ULTMWidgetBase
{
public:
	TArray<struct FGooseWeaponDisplayData>        DisplayData;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_328[0x20];                                     // 0x0328(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CloseWidget();
	void OpenWidget(int32 DisplayIndex, const struct FGooseWeaponDisplayData& InDisplayData, float StartTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GoosePlaneWeaponWidget">();
	}
	static class UGoosePlaneWeaponWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGoosePlaneWeaponWidget>();
	}
};

// Class GooseUI.GooseRadarIconWidget
// 0x0010 (0x0298 - 0x0288)
class UGooseRadarIconWidget final : public UCommonUserWidget
{
public:
	ERadarIconState                               IconState;                                         // 0x0288(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_289[0xF];                                      // 0x0289(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnNewIconState(ERadarIconState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GooseRadarIconWidget">();
	}
	static class UGooseRadarIconWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGooseRadarIconWidget>();
	}
};

// Class GooseUI.GooseRadarWidgetBase
// 0x0018 (0x02E0 - 0x02C8)
class UGooseRadarWidgetBase final : public UFortHUDElementWidget
{
public:
	class UCanvasPanel*                           MyPanel;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UGooseRadarIconWidget*>          IconWidgets;                                       // 0x02D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPlaneRep(const TArray<class AFortAthenaVehicle*>& Planes);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GooseRadarWidgetBase">();
	}
	static class UGooseRadarWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGooseRadarWidgetBase>();
	}
};

// Class GooseUI.GooseSkydivingWidget
// 0x0010 (0x0328 - 0x0318)
class UGooseSkydivingWidget final : public ULTMWidgetBase
{
public:
	uint8                                         Pad_318[0x10];                                     // 0x0318(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnEndSkydiving();
	void OnStartSkydiving();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GooseSkydivingWidget">();
	}
	static class UGooseSkydivingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGooseSkydivingWidget>();
	}
};

// Class GooseUI.GooseTargetLeadingWidget
// 0x0138 (0x0468 - 0x0330)
class UGooseTargetLeadingWidget final : public UGooseWidgetBase
{
public:
	class AFortAthenaVehicle*                     TargetVehicle;                                     // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     BestNextTargetCandidate;                           // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     ViewingPlayerVehicle;                              // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                       AimingReticleWidgetComponent;                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortWeapon*                            PlayerWeapon;                                      // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AimingReticleComponentTag;                         // 0x0358(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TargetChangeDelay;                                 // 0x0360(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TargetFindDelay;                                   // 0x0388(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VehicleDetectionRange;                             // 0x03B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VehicleDetectionAngle;                             // 0x03D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ScreenDetectionBoxHalfSize;                        // 0x0400(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TargetUpdateRate;                                  // 0x0428(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x10];                                     // 0x0450(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class AFortPawn>               CachedPawn;                                        // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPlayerControllerPawnChanged(class AFortPawn* NewPawn);
	void OnPlayerEnterVehicle();
	void OnPlayerExitVehicle();
	void OnPlayerWeaponChanged(class AFortPawn* InPawn, class AFortWeapon* InNewWeapon, class AFortWeapon* InPlayerWeapon);
	void ShowLeadingReticle(bool bShow);
	void UpdateLeadingReticlePosition(const struct FVector& TargetPosition, float InDeltaTime);
	void UpdateTargetVehicle();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GooseTargetLeadingWidget">();
	}
	static class UGooseTargetLeadingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGooseTargetLeadingWidget>();
	}
};

}

