#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GooseRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GooseRuntime.EGoosePickupState
// NumValues: 0x0006
enum class EGoosePickupState : uint8
{
	None                                     = 0,
	Falling                                  = 1,
	Deployed                                 = 2,
	ImpactedByPlane                          = 3,
	DeployTimerUp                            = 4,
	EGoosePickupState_MAX                    = 5,
};

// ScriptStruct GooseRuntime.GooseWeaponTierData
// 0x0010 (0x0010 - 0x0000)
struct FGooseWeaponTierData final
{
public:
	TArray<class UFortWeaponItemDefinition*>      WeaponItemDefinitions;                             // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GooseRuntime.GooseDisplayData
// 0x0020 (0x0020 - 0x0000)
struct FGooseDisplayData final
{
public:
	class FName                                   LootTableName;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MaterialsToSwap;                                   // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GooseRuntime.PlanePickupSpawnData
// 0x0030 (0x0030 - 0x0000)
struct FPlanePickupSpawnData final
{
public:
	TSubclassOf<class AAthenaGoosePickup>         PickupClass;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x28];                                       // 0x0008(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct GooseRuntime.PlaneLootEntry
// 0x0030 (0x0030 - 0x0000)
struct FPlaneLootEntry final
{
public:
	class FName                                   LootTableName;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         LootWeight;                                        // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct GooseRuntime.PlaneLootHeightEntry
// 0x0088 (0x0088 - 0x0000)
struct FPlaneLootHeightEntry final
{
public:
	struct FScalableFloat                         RelativeWeight;                                    // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinHeightOffGround;                                // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxHeightOffGround;                                // 0x0050(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FPlaneLootEntry>                LootEntries;                                       // 0x0078(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GooseRuntime.PlaneLootTypeEntry
// 0x0038 (0x0038 - 0x0000)
struct FPlaneLootTypeEntry final
{
public:
	struct FScalableFloat                         RelativeWeight;                                    // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FPlaneLootHeightEntry>          LootHeightEntries;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GooseRuntime.PlaneSpawnData
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FPlaneSpawnData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct GooseRuntime.PlaneSquadInfo
// 0x0044 (0x0050 - 0x000C)
struct FPlaneSquadInfo final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AFortPlayerControllerAthena*>    Controllers;                                       // 0x0010(0x0010)(ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 LastDriver;                                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SquadId;                                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         PlanesRemaining;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LastCollectedChest;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumOfPlaneEliminations;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortAthenaVehicle*                     LastCollectedChestVehicle;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastCollectedChestServerTime;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct GooseRuntime.PlaneSquadInfoArray
// 0x0028 (0x0130 - 0x0108)
struct FPlaneSquadInfoArray final : public FFastArraySerializer
{
public:
	TArray<struct FPlaneSquadInfo>                SquadData;                                         // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerControllerAthena*>    RemovedControllers;                                // 0x0118(0x0010)(ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

