#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GooseUI

#include "Basic.hpp"

#include "GooseUI_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GooseUI.GooseInventoryWidget.OpenWidget
// 0x0010 (0x0010 - 0x0000)
struct GooseInventoryWidget_OpenWidget final
{
public:
	class UTexture2D*                             IconTexture;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortWorldItemDefinition*         ItemDef;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GooseWidgetBase.OnUpdateNumberOfPlanes
// 0x0008 (0x0008 - 0x0000)
struct GooseWidgetBase_OnUpdateNumberOfPlanes final
{
public:
	int32                                         FriendlyPlaneCount;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EnemyPlaneCount;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GooseLeaderboardWidget.UpdateLeaderboardUI
// 0x0010 (0x0010 - 0x0000)
struct GooseLeaderboardWidget_UpdateLeaderboardUI final
{
public:
	TArray<struct FGooseLeaderboardData>          SortedLeaderboardInfo;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GoosePlanePickupWidget.OpenWidget
// 0x0028 (0x0028 - 0x0000)
struct GoosePlanePickupWidget_OpenWidget final
{
public:
	int32                                         DisplayIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChestName;                                         // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   DisplayText;                                       // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GooseUI.GoosePlaneWeaponWidget.OpenWidget
// 0x0048 (0x0048 - 0x0000)
struct GoosePlaneWeaponWidget_OpenWidget final
{
public:
	int32                                         DisplayIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGooseWeaponDisplayData                InDisplayData;                                     // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GooseUI.GooseRadarIconWidget.OnNewIconState
// 0x0001 (0x0001 - 0x0000)
struct GooseRadarIconWidget_OnNewIconState final
{
public:
	ERadarIconState                               NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GooseRadarWidgetBase.OnPlaneRep
// 0x0010 (0x0010 - 0x0000)
struct GooseRadarWidgetBase_OnPlaneRep final
{
public:
	TArray<class AFortAthenaVehicle*>             Planes;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GooseTargetLeadingWidget.OnPlayerControllerPawnChanged
// 0x0008 (0x0008 - 0x0000)
struct GooseTargetLeadingWidget_OnPlayerControllerPawnChanged final
{
public:
	class AFortPawn*                              NewPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GooseTargetLeadingWidget.OnPlayerWeaponChanged
// 0x0018 (0x0018 - 0x0000)
struct GooseTargetLeadingWidget_OnPlayerWeaponChanged final
{
public:
	class AFortPawn*                              InPawn;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            InNewWeapon;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            InPlayerWeapon;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GooseTargetLeadingWidget.ShowLeadingReticle
// 0x0001 (0x0001 - 0x0000)
struct GooseTargetLeadingWidget_ShowLeadingReticle final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GooseUI.GooseTargetLeadingWidget.UpdateLeadingReticlePosition
// 0x0010 (0x0010 - 0x0000)
struct GooseTargetLeadingWidget_UpdateLeadingReticlePosition final
{
public:
	struct FVector                                TargetPosition;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDeltaTime;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

