#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HydrogenRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.AddBonusVictoryPointsForLockedCapturePoints
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Hydrogen_AddBonusVictoryPointsForLockedCapturePoints final
{
public:
	uint8                                         InTeam;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.CheckVictoryPoints
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Hydrogen_CheckVictoryPoints final
{
public:
	float                                         TimePassed;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.EndGame
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Hydrogen_EndGame final
{
public:
	uint8                                         Winner;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GetActorOnPathLocation
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Hydrogen_GetActorOnPathLocation final
{
public:
	int32                                         InPathIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GetNextActorOnPathLocation
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Hydrogen_GetNextActorOnPathLocation final
{
public:
	int32                                         InPathIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GetOwnedCapturePointCount
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Hydrogen_GetOwnedCapturePointCount final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GetTimeToNextNode
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Hydrogen_GetTimeToNextNode final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GiveObjectiveAccolade
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Hydrogen_GiveObjectiveAccolade final
{
public:
	class AFortPlayerControllerAthena*            FortController;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.OwningTeamChange
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Hydrogen_OwningTeamChange final
{
public:
	class AHydrogenObjectiveActor*                Objective;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NewTeam;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         OldTeam;                                           // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.SetupSafeZoneRoute
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Hydrogen_SetupSafeZoneRoute final
{
public:
	struct FVector                                StartVector;                                       // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndVector;                                         // 0x000C(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.TickHydrogenStormShield
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Hydrogen_TickHydrogenStormShield final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.bHasStormStarted
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Hydrogen_bHasStormStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.bHasWinnerBeenDeclared
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Hydrogen_bHasWinnerBeenDeclared final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GetAllCapturePoints
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Hydrogen_GetAllCapturePoints final
{
public:
	TArray<class AHydrogenObjectiveActor*>        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GetSortedActivePointIndices
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Hydrogen_GetSortedActivePointIndices final
{
public:
	TArray<int32>                                 OutSortedIndices;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.GetStormSpeed
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Hydrogen_GetStormSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.IsInStormShield
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Hydrogen_IsInStormShield final
{
public:
	struct FVector                                TestLocation;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HydrogenRuntime.FortAthenaMutator_Hydrogen.SetCapturePointFillAmount
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Hydrogen_SetCapturePointFillAmount final
{
public:
	class AHydrogenObjectiveActor*                InCapturePointActor;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InPlayerTeam;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HydrogenRuntime.HydrogenObjectiveActor.OnComponentBeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct HydrogenObjectiveActor_OnComponentBeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.HydrogenObjectiveActor.OnOverlapBegin
// 0x00B0 (0x00B0 - 0x0000)
struct HydrogenObjectiveActor_OnOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function HydrogenRuntime.HydrogenObjectiveActor.OnTimelineFlashing
// 0x0004 (0x0004 - 0x0000)
struct HydrogenObjectiveActor_OnTimelineFlashing final
{
public:
	float                                         IconOpacity;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.HydrogenObjectiveActor.ProcessOverlap
// 0x0008 (0x0008 - 0x0000)
struct HydrogenObjectiveActor_ProcessOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.HydrogenObjectiveActor.SetActive
// 0x0001 (0x0001 - 0x0000)
struct HydrogenObjectiveActor_SetActive final
{
public:
	bool                                          bInIsActive;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.HydrogenObjectiveActor.SetUpMaterialInstanceDynamic
// 0x0090 (0x0090 - 0x0000)
struct HydrogenObjectiveActor_SetUpMaterialInstanceDynamic final
{
public:
	struct FSlateBrush                            MapIconBrush;                                      // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               DrawBrushMID;                                      // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HydrogenRuntime.HydrogenObjectiveActor.GetIsActive
// 0x0001 (0x0001 - 0x0000)
struct HydrogenObjectiveActor_GetIsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

