#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemAnimLayerInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemUpperBody
// 0x0260 (0x0260 - 0x0000)
struct ItemAnimLayerInterface_C_ItemUpperBody final
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0010(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemUpperBody_0;                                   // 0x0250(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFullBodySprint
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFullBodySprint final
{
public:
	struct FPoseLink                              InPoseSprint;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodySprint_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemIdleAdditive final
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemIdleAdditive_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemCrouchTurningAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemCrouchTurningAdditive final
{
public:
	struct FPoseLink                              ItemCrouchTurningAdditive_0;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSlopeSliding
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSlopeSliding final
{
public:
	struct FPoseLink                              ItemSlopeSliding_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJumpUpAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJumpUpAdditive final
{
public:
	struct FPoseLink                              ItemJumpUpAdditive_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJumpLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJumpLoopAdditive final
{
public:
	struct FPoseLink                              ItemJumpLoopAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFallAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFallAdditive final
{
public:
	struct FPoseLink                              ItemFallAdditive_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFallLandAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFallLandAdditive final
{
public:
	struct FPoseLink                              ItemFallLandAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJetPackStartAdditive final
{
public:
	struct FPoseLink                              ItemJetPackStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJetPackJumpAdditive final
{
public:
	struct FPoseLink                              ItemJetPackJumpAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemZipLineStartAdditive final
{
public:
	struct FPoseLink                              ItemZipLineStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFlyModeStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFlyModeStartAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFlyModeLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFlyModeLoopAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeLoopAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJogStartAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJogStartAdditive final
{
public:
	struct FPoseLink                              InPoseJogStartAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStartAdditive_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJogStopAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJogStopAdditive final
{
public:
	struct FPoseLink                              InPoseJogStopAdditive;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStopAdditive_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJogPrePivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJogPrePivotAdditive final
{
public:
	struct FPoseLink                              InPosePrePivotAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPrePivotAdditive_0;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPostPivotAdditive_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemLowerBodyMovement final
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyMovement_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemLowerBodyLeanAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemLowerBodyLeanAdditive final
{
public:
	struct FPoseLink                              InPoseLowerBodyLeanAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyLeanAdditive_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemLowerBodyJogStart
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemLowerBodyJogStart final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStart;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStart_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemLowerBodyJogStop
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemLowerBodyJogStop final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStop;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStop_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemLowerBodyJogPrePivot
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemLowerBodyJogPrePivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPrePivot;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPrePivot_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPostPivot_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemRelaxedEntry final
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemRelaxedEntry_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpStart
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpStart final
{
public:
	struct FPoseLink                              ItemSwimJumpStart_0;                               // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpStartLoop
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpStartLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpStartLoop_0;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpFallLoop
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpFallLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpFallLoop_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpSurfaceLoop
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpSurfaceLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpSurfaceLoop_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpSurfaceEnd
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpSurfaceEnd final
{
public:
	struct FPoseLink                              ItemSwimJumpSurfaceEnd_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSkeletalControl
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSkeletalControl final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemSkeletalControl_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemAimOffset
// 0x0040 (0x0040 - 0x0000)
struct ItemAnimLayerInterface_C_ItemAimOffset final
{
public:
	struct FPoseLink                              InPose_AimOffset;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         AimOffsetAlpha;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPoseLink                              InPose_UpperLowerPreMeleeAO;                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemAimOffset_0;                                   // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFullBodyOverride final
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodyOverride_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemPreIK
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemPreIK final
{
public:
	struct FPoseLink                              InPose_PreIK;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemPreIK_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

