#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: KairosSceneCapture

#include "Basic.hpp"

#include "KairosSceneCapture_structs.hpp"
#include "WebBrowser_structs.hpp"


namespace SDK::Params
{

// Function KairosSceneCapture.KairosCaptureStatics.GetSceneManager
// 0x0010 (0x0010 - 0x0000)
struct KairosCaptureStatics_GetSceneManager final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AKairosSceneManagerActor*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosCaptureStatics.ToggleAutoRotate
// 0x0001 (0x0001 - 0x0000)
struct KairosCaptureStatics_ToggleAutoRotate final
{
public:
	bool                                          bIsAutoRotateAllowed;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosCaptureStatics.PauseOrResumeSnippet
// 0x0038 (0x0038 - 0x0000)
struct KairosCaptureStatics_PauseOrResumeSnippet final
{
public:
	struct FKairosSnippetParams                   Params_0;                                          // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FWebJSResponse                         Response;                                          // 0x0018(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosGameModeBase.GetDefaultConfig
// 0x0008 (0x0008 - 0x0000)
struct KairosGameModeBase_GetDefaultConfig final
{
public:
	class UKairosConfig*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosHeroBase.BeginCapture
// 0x0160 (0x0160 - 0x0000)
struct KairosHeroBase_BeginCapture final
{
public:
	struct FKairosAnimationFramingInfo            FramingInfo;                                       // 0x0000(0x0050)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKairosCaptureParams                   CaptureParams;                                     // 0x0050(0x0100)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0150(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0xF];                                      // 0x0151(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function KairosSceneCapture.KairosHeroBase.EndCapture
// 0x0001 (0x0001 - 0x0000)
struct KairosHeroBase_EndCapture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosSceneManagerActor.BeginEmotePlaybackForPlayer
// 0x0020 (0x0020 - 0x0000)
struct KairosSceneManagerActor_BeginEmotePlaybackForPlayer final
{
public:
	class FString                                 PlayerID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EmoteId;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosSceneManagerActor.GetSceneInfo
// 0x0020 (0x0020 - 0x0000)
struct KairosSceneManagerActor_GetSceneInfo final
{
public:
	struct FKairosSceneInfo                       ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosSceneManagerActor.OLD_OnSceneSetupComplete
// 0x0020 (0x0020 - 0x0000)
struct KairosSceneManagerActor_OLD_OnSceneSetupComplete final
{
public:
	struct FKairosSceneInfo                       CompleteSceneInfoCopy;                             // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// Function KairosSceneCapture.KairosSceneManagerActor.PauseOrResumeSnippet
// 0x0018 (0x0018 - 0x0000)
struct KairosSceneManagerActor_PauseOrResumeSnippet final
{
public:
	class FString                                 PlayerID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPase;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

