#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LandscapeWaterInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LandscapeWaterInfo.LandscapeWaterInfo_C
// 0x0070 (0x0290 - 0x0220)
class ALandscapeWaterInfo_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Flood_Water_Level;                                 // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             Game_Texture__Water_Velocity_and_Height;           // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LS_Transform;                                      // 0x0240(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FIntPoint                              LS_RT_Res;                                         // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Quad_Size;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Terrain_Velocity_and_Height_Texture;           // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               External_Water_MID_To_Update;                      // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LandscapeWaterInfo(int32 EntryPoint);
	void Set_Flood_Water_Level();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Set_Water_MPC_Values();
	void Update_Water_MID(class UTexture* Texture);
	void UpdateGameTexture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LandscapeWaterInfo_C">();
	}
	static class ALandscapeWaterInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeWaterInfo_C>();
	}
};

}

