#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LiveStreamAnimation

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "LiveStreamAnimation_structs.hpp"


namespace SDK
{

// Class LiveStreamAnimation.LiveStreamAnimationChannel
// 0x0010 (0x0078 - 0x0068)
class ULiveStreamAnimationChannel final : public UChannel
{
public:
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveStreamAnimationChannel">();
	}
	static class ULiveStreamAnimationChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationChannel>();
	}
};

// Class LiveStreamAnimation.LiveStreamAnimationDataHandler
// 0x0010 (0x0038 - 0x0028)
class ULiveStreamAnimationDataHandler : public UObject
{
public:
	class ULiveStreamAnimationSubsystem*          OwningSubsystem;                                   // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveStreamAnimationDataHandler">();
	}
	static class ULiveStreamAnimationDataHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationDataHandler>();
	}
};

// Class LiveStreamAnimation.LiveStreamAnimationSettings
// 0x0038 (0x0070 - 0x0038)
class ULiveStreamAnimationSettings final : public UDeveloperSettings
{
public:
	TArray<class FName>                           HandleNames;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, Transient, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSoftClassPath>                 ConfiguredDataHandlers;                            // 0x0048(0x0010)(Edit, ZeroConstructor, Transient, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveStreamAnimationSettings">();
	}
	static class ULiveStreamAnimationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationSettings>();
	}
};

// Class LiveStreamAnimation.LiveStreamAnimationSubsystem
// 0x0048 (0x0078 - 0x0030)
class ULiveStreamAnimationSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bEnabled;                                          // 0x0050(0x0001)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x17];                                      // 0x0051(0x0017)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class ULiveStreamAnimationDataHandler*> ConfiguredDataHandlers;                           // 0x0068(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetAcceptClientPackets_Private(bool bInShouldAcceptClientPackets);
	void SetRole(const ELiveStreamAnimationRole NewRole);

	class ULiveStreamAnimationDataHandler* GetDataHandler(TSubclassOf<class ULiveStreamAnimationDataHandler> Type) const;
	ELiveStreamAnimationRole GetRole() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveStreamAnimationSubsystem">();
	}
	static class ULiveStreamAnimationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationSubsystem>();
	}
};

}

