#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LiveStreamAnimation

#include "Basic.hpp"

#include "LiveStreamAnimation_structs.hpp"


namespace SDK::Params
{

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.SetAcceptClientPackets_Private
// 0x0001 (0x0001 - 0x0000)
struct LiveStreamAnimationSubsystem_SetAcceptClientPackets_Private final
{
public:
	bool                                          bInShouldAcceptClientPackets;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.SetRole
// 0x0001 (0x0001 - 0x0000)
struct LiveStreamAnimationSubsystem_SetRole final
{
public:
	ELiveStreamAnimationRole                      NewRole;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.GetDataHandler
// 0x0010 (0x0010 - 0x0000)
struct LiveStreamAnimationSubsystem_GetDataHandler final
{
public:
	TSubclassOf<class ULiveStreamAnimationDataHandler> Type;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULiveStreamAnimationDataHandler*        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.GetRole
// 0x0001 (0x0001 - 0x0000)
struct LiveStreamAnimationSubsystem_GetRole final
{
public:
	ELiveStreamAnimationRole                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

