#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LSALiveLink

#include "Basic.hpp"

#include "LiveStreamAnimation_structs.hpp"
#include "LSALiveLink_structs.hpp"


namespace SDK::Params
{

// Function LSALiveLink.LSALiveLinkDataHandler.StartTrackingLiveLinkSubject
// 0x0020 (0x0020 - 0x0000)
struct LSALiveLinkDataHandler_StartTrackingLiveLinkSubject final
{
public:
	class FName                                   LiveLinkSubject;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveStreamAnimationHandleWrapper      RegisteredName;                                    // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLSALiveLinkSourceOptions              Options;                                           // 0x0010(0x0001)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLiveStreamAnimationHandleWrapper      TranslationProfile;                                // 0x0014(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LSALiveLink.LSALiveLinkDataHandler.StopTrackingLiveLinkSubject
// 0x0008 (0x0008 - 0x0000)
struct LSALiveLinkDataHandler_StopTrackingLiveLinkSubject final
{
public:
	struct FLiveStreamAnimationHandleWrapper      RegisteredName;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LSALiveLink.LiveLinkTestSkelMeshTrackerComponent.StartTrackingSkelMesh
// 0x0008 (0x0008 - 0x0000)
struct LiveLinkTestSkelMeshTrackerComponent_StartTrackingSkelMesh final
{
public:
	class FName                                   InSubjectName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

