#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: M_MED_TacticalScuba_CtrlRig

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass M_MED_TacticalScuba_CtrlRig.M_MED_TacticalScuba_CtrlRig_C
// 0x0288 (0x05F0 - 0x0368)
class UM_MED_TacticalScuba_CtrlRig_C final : public UControlRig
{
public:
	struct FRigUnit_BeginExecution                BeginExecution;                                    // 0x0368(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRigUnit_GetBoneTransform              GetBoneTransform_1_0_0_0_1;                        // 0x0390(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_0_0_0_0_1;                        // 0x03F0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionGetAxis         MathQuaternionGetAxis_0_1_0_0_1;                   // 0x0450(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorSub                 MathVectorSub_0_1_0_0_1;                           // 0x0480(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionFromTwoVectors  MathQuaternionFromTwoVectors_0_1_0_0_1;            // 0x04B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionMul             MathQuaternionMul_0_1_0_0_1;                       // 0x04E0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_0_1_0_0_1;                         // 0x0520(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformTransformVector  MathTransformTransformVector_0_1_0_0_1;            // 0x0570(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorNegate              MathVectorNegate_0_0_1;                            // 0x05D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_TacticalScuba_CtrlRig_C">();
	}
	static class UM_MED_TacticalScuba_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_TacticalScuba_CtrlRig_C>();
	}
};

}

