#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MagicLeapSharedWorld

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MagicLeapARPin_structs.hpp"


namespace SDK
{

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldAlignmentTransforms
// 0x0010 (0x0010 - 0x0000)
struct FMagicLeapSharedWorldAlignmentTransforms final
{
public:
	TArray<struct FTransform>                     AlignmentTransforms;                               // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldSharedData
// 0x0010 (0x0010 - 0x0000)
struct FMagicLeapSharedWorldSharedData final
{
public:
	TArray<struct FGuid>                          PinIDs;                                            // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldPinData
// 0x0020 (0x0020 - 0x0000)
struct FMagicLeapSharedWorldPinData final
{
public:
	struct FGuid                                  PinID;                                             // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMagicLeapARPinState                   PinState;                                          // 0x0010(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldLocalData
// 0x0010 (0x0010 - 0x0000)
struct FMagicLeapSharedWorldLocalData final
{
public:
	TArray<struct FMagicLeapSharedWorldPinData>   LocalPins;                                         // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

