#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Math_Vector4_V

#include "Basic.hpp"


namespace SDK::Params
{

// Function Math_Vector4_V.Vector4_V.Create
// 0x0018 (0x0018 - 0x0000)
struct Vector4_V_Create final
{
public:
	float                                         __verse_0x3205F605_inX;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x57624ABD_inY;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0xB9CDFFAF_inZ;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x6415955D_inW;                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector4_V*                             RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Vector4_V.Vector4_V.createZero
// 0x0008 (0x0008 - 0x0000)
struct Vector4_V_createZero final
{
public:
	class UVector4_V*                             RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Vector4_V.Vector4_V.Equals
// 0x0010 (0x0010 - 0x0000)
struct Vector4_V_Equals final
{
public:
	class UVector4_V*                             __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0xB4A6AEEC_tolerance;                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function Math_Vector4_V.Vector4_V.ToString
// 0x0010 (0x0010 - 0x0000)
struct Vector4_V_ToString final
{
public:
	class FString                                 RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};

}

