#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Math_Quat4

#include "Basic.hpp"


namespace SDK::Params
{

// Function Math_Quat4.Quat4.calcTangents
// 0x0028 (0x0028 - 0x0000)
struct Quat4_calcTangents final
{
public:
	class UQuat4*                                 __verse_0x07BDAE31_prevQ;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0xE518C7F2_q;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0xC170DC03_nextQ;                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x35918A51_tension;                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.Create
// 0x0018 (0x0018 - 0x0000)
struct Quat4_Create final
{
public:
	class UVector3*                               __verse_0xAB14FAEF_axis;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x8ADC6410_radians;                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.createFromRotation
// 0x0010 (0x0010 - 0x0000)
struct Quat4_createFromRotation final
{
public:
	class URotation3*                             __verse_0xAA1ABDC9_rotation;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.createIdentity
// 0x0008 (0x0008 - 0x0000)
struct Quat4_createIdentity final
{
public:
	class UQuat4*                                 RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.createZero
// 0x0008 (0x0008 - 0x0000)
struct Quat4_createZero final
{
public:
	class UQuat4*                                 RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.Error
// 0x0018 (0x0018 - 0x0000)
struct Quat4_Error final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.fastBilerp
// 0x0030 (0x0030 - 0x0000)
struct Quat4_fastBilerp final
{
public:
	class UQuat4*                                 __verse_0x47EC792A_p00;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0xD9ECD3E6_p10;                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x228BC592_p01;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0xBC8B6F5E_p11;                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x4DC01E1F_fracX;                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x28A7A2A7_fracY;                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.fastLerp
// 0x0020 (0x0020 - 0x0000)
struct Quat4_fastLerp final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x05A40B7F_alpha;                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.findBetween
// 0x0018 (0x0018 - 0x0000)
struct Quat4_findBetween final
{
public:
	class UVector3*                               __verse_0xBAD88A47_v1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               __verse_0x54773F55_v2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.findBetweenNormals
// 0x0018 (0x0018 - 0x0000)
struct Quat4_findBetweenNormals final
{
public:
	class UVector3*                               __verse_0x24F2D4E8_n1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               __verse_0xCA5D61FA_n2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.findBetweenVectors
// 0x0018 (0x0018 - 0x0000)
struct Quat4_findBetweenVectors final
{
public:
	class UVector3*                               __verse_0xBAD88A47_v1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               __verse_0x54773F55_v2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.safeError
// 0x0018 (0x0018 - 0x0000)
struct Quat4_safeError final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.slerp
// 0x0020 (0x0020 - 0x0000)
struct Quat4_slerp final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x05A40B7F_alpha;                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.slerpFullPath
// 0x0020 (0x0020 - 0x0000)
struct Quat4_slerpFullPath final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x05A40B7F_alpha;                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.slerpFullPathNotNormalized
// 0x0020 (0x0020 - 0x0000)
struct Quat4_slerpFullPathNotNormalized final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x05A40B7F_alpha;                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.slerpNotNormalized
// 0x0020 (0x0020 - 0x0000)
struct Quat4_slerpNotNormalized final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x05A40B7F_alpha;                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.Squad
// 0x0030 (0x0030 - 0x0000)
struct Quat4_Squad final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0xC7DFAF05_t1;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x29701A17_t2;                             // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x05A40B7F_alpha;                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.squadFullPath
// 0x0030 (0x0030 - 0x0000)
struct Quat4_squadFullPath final
{
public:
	class UQuat4*                                 __verse_0xA3D14F4D_q1;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0xC7DFAF05_t1;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x4D7EFA5F_q2;                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 __verse_0x29701A17_t2;                             // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x05A40B7F_alpha;                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.Add
// 0x0010 (0x0010 - 0x0000)
struct Quat4_Add final
{
public:
	class UQuat4*                                 __verse_0xE518C7F2_q;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.angularRadianDistance
// 0x0010 (0x0010 - 0x0000)
struct Quat4_angularRadianDistance final
{
public:
	class UQuat4*                                 __verse_0xE518C7F2_q;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.divideByScalar
// 0x0018 (0x0018 - 0x0000)
struct Quat4_divideByScalar final
{
public:
	float                                         __verse_0x6ED0CE58_s;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x0FA0AFBE_reciprocal_0;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.DoT
// 0x0010 (0x0010 - 0x0000)
struct Quat4_DoT final
{
public:
	class UQuat4*                                 __verse_0xE518C7F2_q;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.enforceShortestArcWith
// 0x0008 (0x0008 - 0x0000)
struct Quat4_enforceShortestArcWith final
{
public:
	class UQuat4*                                 __verse_0xE518C7F2_q;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.Equals
// 0x0010 (0x0010 - 0x0000)
struct Quat4_Equals final
{
public:
	class UQuat4*                                 __verse_0xE518C7F2_q;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0xB4A6AEEC_tolerance;                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function Math_Quat4.Quat4.Exp
// 0x0008 (0x0008 - 0x0000)
struct Quat4_Exp final
{
public:
	class UQuat4*                                 RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getAngle
// 0x0004 (0x0004 - 0x0000)
struct Quat4_getAngle final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getAxisX
// 0x0008 (0x0008 - 0x0000)
struct Quat4_getAxisX final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getAxisY
// 0x0008 (0x0008 - 0x0000)
struct Quat4_getAxisY final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getAxisZ
// 0x0008 (0x0008 - 0x0000)
struct Quat4_getAxisZ final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getNormalized
// 0x0010 (0x0010 - 0x0000)
struct Quat4_getNormalized final
{
public:
	float                                         __verse_0xB4A6AEEC_tolerance;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.GetRotationAxis
// 0x0008 (0x0008 - 0x0000)
struct Quat4_GetRotationAxis final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getSwing
// 0x0010 (0x0010 - 0x0000)
struct Quat4_getSwing final
{
public:
	class UVector3*                               __verse_0x32625C4E_twistAxis;                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getTwist
// 0x0010 (0x0010 - 0x0000)
struct Quat4_getTwist final
{
public:
	class UVector3*                               __verse_0x32625C4E_twistAxis;                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.getTwistRadianAngle
// 0x0010 (0x0010 - 0x0000)
struct Quat4_getTwistRadianAngle final
{
public:
	class UVector3*                               __verse_0x32625C4E_twistAxis;                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.inverse
// 0x0008 (0x0008 - 0x0000)
struct Quat4_inverse final
{
public:
	class UQuat4*                                 RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.isIdentity
// 0x0008 (0x0008 - 0x0000)
struct Quat4_isIdentity final
{
public:
	float                                         __verse_0xB4A6AEEC_tolerance;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0004(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function Math_Quat4.Quat4.isNormalized
// 0x0001 (0x0001 - 0x0000)
struct Quat4_isNormalized final
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function Math_Quat4.Quat4.IsValid
// 0x0001 (0x0001 - 0x0000)
struct Quat4_IsValid final
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function Math_Quat4.Quat4.Log
// 0x0008 (0x0008 - 0x0000)
struct Quat4_Log final
{
public:
	class UQuat4*                                 RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.multiplyByScalar
// 0x0010 (0x0010 - 0x0000)
struct Quat4_multiplyByScalar final
{
public:
	float                                         __verse_0x6ED0CE58_s;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.normalize
// 0x0004 (0x0004 - 0x0000)
struct Quat4_normalize final
{
public:
	float                                         __verse_0xB4A6AEEC_tolerance;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.RotateVector
// 0x0010 (0x0010 - 0x0000)
struct Quat4_RotateVector final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.Size
// 0x0004 (0x0004 - 0x0000)
struct Quat4_Size final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.sizeSquared
// 0x0004 (0x0004 - 0x0000)
struct Quat4_sizeSquared final
{
public:
	float                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.Subtract
// 0x0010 (0x0010 - 0x0000)
struct Quat4_Subtract final
{
public:
	class UQuat4*                                 __verse_0xE518C7F2_q;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuat4*                                 RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.toEulerRotation3
// 0x0008 (0x0008 - 0x0000)
struct Quat4_toEulerRotation3 final
{
public:
	class URotation3*                             RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.ToRotation3
// 0x0008 (0x0008 - 0x0000)
struct Quat4_ToRotation3 final
{
public:
	class URotation3*                             RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.ToString
// 0x0010 (0x0010 - 0x0000)
struct Quat4_ToString final
{
public:
	class FString                                 RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};

// Function Math_Quat4.Quat4.unrotateVector
// 0x0010 (0x0010 - 0x0000)
struct Quat4_unrotateVector final
{
public:
	class UVector3*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

