#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Math_MathUtil

#include "Basic.hpp"


namespace SDK::Params
{

// Function Math_MathUtil.MathUtil.abs
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_abs final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.ceil
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_ceil final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.clampFloat
// 0x0010 (0x0010 - 0x0000)
struct MathUtil_clampFloat final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0x299075D9_min;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0xDF83E27F_max;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.clampInt
// 0x0010 (0x0010 - 0x0000)
struct MathUtil_clampInt final
{
public:
	int32                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x299075D9_min;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0xDF83E27F_max;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.convertToFloat
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_convertToFloat final
{
public:
	int32                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.Cos
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_Cos final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.Floor
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_Floor final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.Round
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_Round final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.Sin
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_Sin final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.Sqrt
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_Sqrt final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.Tan
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_Tan final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Math_MathUtil.MathUtil.trunc
// 0x0008 (0x0008 - 0x0000)
struct MathUtil_trunc final
{
public:
	float                                         __verse_0xE50A13DD_val;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

