#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Niagara

#include "Basic.hpp"

#include "NiagaraCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NiagaraShader_classes.hpp"


namespace SDK
{

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0010 (0x00F8 - 0x00E8)
class UMovieSceneNiagaraSystemSpawnSection final : public UMovieSceneSection
{
public:
	ENiagaraSystemSpawnSectionStartBehavior       SectionStartBehavior;                              // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SectionEvaluateBehavior;                           // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SectionEndBehavior;                                // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemSpawnSection">();
	}
	static class UMovieSceneNiagaraSystemSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemSpawnSection>();
	}
};

// Class Niagara.NiagaraParticleCallbackHandler
// 0x0000 (0x0000 - 0x0000)
class INiagaraParticleCallbackHandler final
{
public:
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraParticleCallbackHandler">();
	}
	static class INiagaraParticleCallbackHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<INiagaraParticleCallbackHandler>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class Niagara.NiagaraDataInterface
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface">();
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x0088 - 0x0078)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0078(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraTrack">();
	}
	static class UMovieSceneNiagaraTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTrack>();
	}
};

// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0020 (0x00A8 - 0x0088)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0088(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraParameterTrack">();
	}
	static class UMovieSceneNiagaraParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraParameterTrack>();
	}
};

// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0008 (0x00B0 - 0x00A8)
class UMovieSceneNiagaraBoolParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraBoolParameterTrack">();
	}
	static class UMovieSceneNiagaraBoolParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraBoolParameterTrack>();
	}
};

// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0008 (0x00B0 - 0x00A8)
class UMovieSceneNiagaraColorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraColorParameterTrack">();
	}
	static class UMovieSceneNiagaraColorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraColorParameterTrack>();
	}
};

// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0008 (0x00B0 - 0x00A8)
class UMovieSceneNiagaraFloatParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraFloatParameterTrack">();
	}
	static class UMovieSceneNiagaraFloatParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraFloatParameterTrack>();
	}
};

// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0008 (0x00B0 - 0x00A8)
class UMovieSceneNiagaraIntegerParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraIntegerParameterTrack">();
	}
	static class UMovieSceneNiagaraIntegerParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraIntegerParameterTrack>();
	}
};

// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0008 (0x0090 - 0x0088)
class UMovieSceneNiagaraSystemTrack final : public UMovieSceneNiagaraTrack
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemTrack">();
	}
	static class UMovieSceneNiagaraSystemTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemTrack>();
	}
};

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0010 (0x00B8 - 0x00A8)
class UMovieSceneNiagaraVectorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ChannelsUsed;                                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraVectorParameterTrack">();
	}
	static class UMovieSceneNiagaraVectorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraVectorParameterTrack>();
	}
};

// Class Niagara.NiagaraActor
// 0x0010 (0x0230 - 0x0220)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bDestroyOnSystemFinish : 1;                        // 0x0228(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnNiagaraSystemFinished(class UNiagaraComponent* FinishedComponent);
	void SetDestroyOnSystemFinish(bool bShouldDestroyOnSystemFinish);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraActor">();
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};

// Class Niagara.NiagaraComponent
// 0x01A0 (0x05F0 - 0x0450)
class UNiagaraComponent : public UFXSystemComponent
{
public:
	class UNiagaraSystem*                         Asset;                                             // 0x0448(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraTickBehavior                          TickBehavior;                                      // 0x0450(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RandomSeedOffset;                                  // 0x0454(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNiagaraUserRedirectionParameterStore  OverrideParameters;                                // 0x0458(0x00C8)(NativeAccessSpecifierPrivate)
	uint8                                         bForceSolo : 1;                                    // 0x0520(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bEnableGpuComputeDebug : 1;                        // 0x0520(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_520_2 : 6;                                  // 0x0520(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-8 ])
	uint8                                         Pad_521[0x2F];                                     // 0x0521(0x002F)(Fixing Size After Last Property [ Dumper-8 ])
	uint8                                         bAutoDestroy : 1;                                  // 0x0550(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRenderingEnabled : 1;                             // 0x0550(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bAutoManageAttachment : 1;                         // 0x0550(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoAttachWeldSimulatedBodies : 1;                // 0x0550(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         MaxTimeBeforeForceUpdateTransform;                 // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraMaterialOverride>       EmitterMaterials;                                  // 0x0558(0x0010)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class UNiagaraComponent* PSystem)> OnSystemFinished;               // 0x0570(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         AutoAttachParent;                                  // 0x0580(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AutoAttachSocketName;                              // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachLocationRule;                            // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachRotationRule;                            // 0x0591(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachScaleRule;                               // 0x0592(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_593[0x5D];                                     // 0x0593(0x005D)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AdvanceSimulation(int32 TickCount, float TickDeltaSeconds);
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);
	class UNiagaraDataInterface* GetDataInterface(const class FString& Name_0);
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const class FString& InEmitterName);
	TArray<float> GetNiagaraParticleValues_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	void InitForPerformanceBaseline();
	void ReinitializeSystem();
	void ResetSystem();
	void SeekToDesiredAge(float InDesiredAge);
	void SetAgeUpdateMode(ENiagaraAgeUpdateMode InAgeUpdateMode);
	void SetAllowScalability(bool bAllow);
	void SetAsset(class UNiagaraSystem* InAsset);
	void SetAutoDestroy(bool bInAutoDestroy);
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);
	void SetDesiredAge(float InDesiredAge);
	void SetForceSolo(bool bInForceSolo);
	void SetGpuComputeDebug(bool bEnableDebug);
	void SetLockDesiredAgeDeltaTimeToSeekDelta(bool bLock);
	void SetMaxSimTime(float InMaxTime);
	void SetNiagaraVariableActor(const class FString& InVariableName, class AActor* Actor);
	void SetNiagaraVariableBool(const class FString& InVariableName, bool InValue);
	void SetNiagaraVariableFloat(const class FString& InVariableName, float InValue);
	void SetNiagaraVariableInt(const class FString& InVariableName, int32 InValue);
	void SetNiagaraVariableLinearColor(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetNiagaraVariableObject(const class FString& InVariableName, class UObject* Object);
	void SetNiagaraVariableQuat(const class FString& InVariableName, const struct FQuat& InValue);
	void SetNiagaraVariableVec2(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetNiagaraVariableVec3(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableVec4(const class FString& InVariableName, const struct FVector4& InValue);
	void SetPaused(bool bInPaused);
	void SetPreviewLODDistance(bool bEnablePreviewLODDistance, float PreviewLODDistance);
	void SetRandomSeedOffset(int32 NewRandomSeedOffset);
	void SetRenderingEnabled(bool bInRenderingEnabled);
	void SetSeekDelta(float InSeekDelta);
	void SetTickBehavior(ENiagaraTickBehavior NewTickBehavior);
	void SetVariableActor(class FName InVariableName, class AActor* Actor);
	void SetVariableBool(class FName InVariableName, bool InValue);
	void SetVariableFloat(class FName InVariableName, float InValue);
	void SetVariableInt(class FName InVariableName, int32 InValue);
	void SetVariableLinearColor(class FName InVariableName, const struct FLinearColor& InValue);
	void SetVariableMaterial(class FName InVariableName, class UMaterialInterface* Object);
	void SetVariableObject(class FName InVariableName, class UObject* Object);
	void SetVariableQuat(class FName InVariableName, const struct FQuat& InValue);
	void SetVariableTextureRenderTarget(class FName InVariableName, class UTextureRenderTarget* TextureRenderTarget);
	void SetVariableVec2(class FName InVariableName, const struct FVector2D& InValue);
	void SetVariableVec3(class FName InVariableName, const struct FVector& InValue);
	void SetVariableVec4(class FName InVariableName, const struct FVector4& InValue);

	ENiagaraAgeUpdateMode GetAgeUpdateMode() const;
	class UNiagaraSystem* GetAsset() const;
	float GetDesiredAge() const;
	bool GetForceSolo() const;
	bool GetLockDesiredAgeDeltaTimeToSeekDelta() const;
	float GetMaxSimTime() const;
	float GetPreviewLODDistance() const;
	bool GetPreviewLODDistanceEnabled() const;
	int32 GetRandomSeedOffset() const;
	float GetSeekDelta() const;
	ENiagaraTickBehavior GetTickBehavior() const;
	bool IsPaused() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponent">();
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};

// Class Niagara.NiagaraComponentPool
// 0x0058 (0x0080 - 0x0028)
class UNiagaraComponentPool final : public UObject
{
public:
	TMap<class UNiagaraSystem*, struct FNCPool>   WorldParticleSystemPools;                          // 0x0028(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentPool">();
	}
	static class UNiagaraComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentPool>();
	}
};

// Class Niagara.NiagaraRendererProperties
// 0x0058 (0x0080 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0028(0x0030)(Edit, NativeAccessSpecifierPublic)
	int32                                         SortOrderHint;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotionBlurEnabled;                                // 0x005D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x22];                                      // 0x005E(0x0022)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRendererProperties">();
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};

// Class Niagara.NiagaraComponentRendererProperties
// 0x0138 (0x01B8 - 0x0080)
class UNiagaraComponentRendererProperties final : public UNiagaraRendererProperties
{
public:
	TSubclassOf<class USceneComponent>            ComponentType;                                     // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ComponentCountLimit;                               // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FNiagaraVariableAttributeBinding       EnabledBinding;                                    // 0x0090(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererVisibilityTagBinding;                      // 0x00E8(0x0058)(Edit, NativeAccessSpecifierPublic)
	bool                                          bAssignComponentsOnParticleID;                     // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyCreateComponentsOnParticleSpawn;              // 0x0141(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RendererVisibility;                                // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        TemplateComponent;                                 // 0x0148(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraComponentPropertyBinding> PropertyBindings;                                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_160[0x58];                                     // 0x0160(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentRendererProperties">();
	}
	static class UNiagaraComponentRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentRendererProperties>();
	}
};

// Class Niagara.NiagaraComponentSettings
// 0x00F0 (0x0118 - 0x0028)
class UNiagaraComponentSettings final : public UObject
{
public:
	TSet<class FName>                             SuppressActivationList;                            // 0x0028(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             ForceAutoPooolingList;                             // 0x0078(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<struct FNiagaraEmitterNameSettingsRef>   SuppressEmitterList;                               // 0x00C8(0x0050)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentSettings">();
	}
	static class UNiagaraComponentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentSettings>();
	}
};

// Class Niagara.NiagaraConvertInPlaceUtilityBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraConvertInPlaceUtilityBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraConvertInPlaceUtilityBase">();
	}
	static class UNiagaraConvertInPlaceUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraConvertInPlaceUtilityBase>();
	}
};

// Class Niagara.NiagaraDataInterface2DArrayTexture
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterface2DArrayTexture final : public UNiagaraDataInterface
{
public:
	class UTexture2DArray*                        Texture;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface2DArrayTexture">();
	}
	static class UNiagaraDataInterface2DArrayTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface2DArrayTexture>();
	}
};

// Class Niagara.NiagaraDataInterfaceArray
// 0x0018 (0x0050 - 0x0038)
class UNiagaraDataInterfaceArray : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         MaxElements;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArray">();
	}
	static class UNiagaraDataInterfaceArray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArray>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayFloat
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayFloat final : public UNiagaraDataInterfaceArray
{
public:
	TArray<float>                                 FloatData;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat">();
	}
	static class UNiagaraDataInterfaceArrayFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayFloat2
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayFloat2 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector2D>                      FloatData;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat2">();
	}
	static class UNiagaraDataInterfaceArrayFloat2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat2>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayFloat3
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayFloat3 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector>                        FloatData;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat3">();
	}
	static class UNiagaraDataInterfaceArrayFloat3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat3>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayFloat4
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayFloat4 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector4>                       FloatData;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat4">();
	}
	static class UNiagaraDataInterfaceArrayFloat4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat4>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayColor
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayColor final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FLinearColor>                   ColorData;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayColor">();
	}
	static class UNiagaraDataInterfaceArrayColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayColor>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayQuat
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayQuat final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FQuat>                          QuatData;                                          // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayQuat">();
	}
	static class UNiagaraDataInterfaceArrayQuat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayQuat>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraDataInterfaceArrayFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<bool> GetNiagaraArrayBool(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FLinearColor> GetNiagaraArrayColor(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<float> GetNiagaraArrayFloat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<int32> GetNiagaraArrayInt32(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FQuat> GetNiagaraArrayQuat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FVector> GetNiagaraArrayVector(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FVector2D> GetNiagaraArrayVector2D(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FVector4> GetNiagaraArrayVector4(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static void SetNiagaraArrayBool(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<bool>& ArrayData);
	static void SetNiagaraArrayColor(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FLinearColor>& ArrayData);
	static void SetNiagaraArrayFloat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<float>& ArrayData);
	static void SetNiagaraArrayInt32(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<int32>& ArrayData);
	static void SetNiagaraArrayQuat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FQuat>& ArrayData);
	static void SetNiagaraArrayVector(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FVector>& ArrayData);
	static void SetNiagaraArrayVector2D(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FVector2D>& ArrayData);
	static void SetNiagaraArrayVector4(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FVector4>& ArrayData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFunctionLibrary">();
	}
	static class UNiagaraDataInterfaceArrayFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFunctionLibrary>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayInt32
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayInt32 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<int32>                                 IntData;                                           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayInt32">();
	}
	static class UNiagaraDataInterfaceArrayInt32* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayInt32>();
	}
};

// Class Niagara.NiagaraDataInterfaceArrayBool
// 0x0010 (0x0060 - 0x0050)
class UNiagaraDataInterfaceArrayBool final : public UNiagaraDataInterfaceArray
{
public:
	TArray<bool>                                  BoolData;                                          // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayBool">();
	}
	static class UNiagaraDataInterfaceArrayBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayBool>();
	}
};

// Class Niagara.NiagaraDataInterfaceAudioSubmix
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceAudioSubmix : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                           Submix;                                            // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioSubmix">();
	}
	static class UNiagaraDataInterfaceAudioSubmix* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioSubmix>();
	}
};

// Class Niagara.NiagaraDataInterfaceAudioOscilloscope
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceAudioOscilloscope final : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                           Submix;                                            // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Resolution;                                        // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScopeInMilliseconds;                               // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioOscilloscope">();
	}
	static class UNiagaraDataInterfaceAudioOscilloscope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioOscilloscope>();
	}
};

// Class Niagara.NiagaraDataInterfaceAudioPlayer
// 0x0038 (0x0070 - 0x0038)
class UNiagaraDataInterfaceAudioPlayer final : public UNiagaraDataInterface
{
public:
	class USoundBase*                             SoundToPlay;                                       // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      Attenuation;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundConcurrency*                      Concurrency;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ParameterNames;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitPlaysPerTick;                                // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         MaxPlaysPerTick;                                   // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenComponentIsDestroyed;                     // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioPlayer">();
	}
	static class UNiagaraDataInterfaceAudioPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioPlayer>();
	}
};

// Class Niagara.NiagaraDataInterfaceAudioSpectrum
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceAudioSpectrum final : public UNiagaraDataInterfaceAudioSubmix
{
public:
	int32                                         Resolution;                                        // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumFrequency;                                  // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumFrequency;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseFloorDb;                                      // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioSpectrum">();
	}
	static class UNiagaraDataInterfaceAudioSpectrum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioSpectrum>();
	}
};

// Class Niagara.NiagaraDataInterfaceCamera
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceCamera final : public UNiagaraDataInterface
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireCurrentFrameData;                          // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCamera">();
	}
	static class UNiagaraDataInterfaceCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCamera>();
	}
};

// Class Niagara.NiagaraDataInterfaceCollisionQuery
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceCollisionQuery final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCollisionQuery">();
	}
	static class UNiagaraDataInterfaceCollisionQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCollisionQuery>();
	}
};

// Class Niagara.NiagaraDataInterfaceCurveBase
// 0x0038 (0x0070 - 0x0038)
class UNiagaraDataInterfaceCurveBase : public UNiagaraDataInterface
{
public:
	TArray<float>                                 ShaderLUT;                                         // 0x0038(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTMinTime;                                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTMaxTime;                                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTInvTimeRange;                                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTNumSamplesMinusOne;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseLUT : 1;                                       // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExposeCurve : 1;                                  // 0x0058(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   ExposedName;                                       // 0x005C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             ExposedTexture;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCurveBase">();
	}
	static class UNiagaraDataInterfaceCurveBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurveBase>();
	}
};

// Class Niagara.NiagaraDataInterfaceColorCurve
// 0x0200 (0x0270 - 0x0070)
class UNiagaraDataInterfaceColorCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             RedCurve;                                          // 0x0070(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             GreenCurve;                                        // 0x00F0(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             BlueCurve;                                         // 0x0170(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             AlphaCurve;                                        // 0x01F0(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceColorCurve">();
	}
	static class UNiagaraDataInterfaceColorCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceColorCurve>();
	}
};

// Class Niagara.NiagaraDataInterfaceCurlNoise
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceCurlNoise final : public UNiagaraDataInterface
{
public:
	uint32                                        Seed;                                              // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0xC];                                       // 0x003C(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCurlNoise">();
	}
	static class UNiagaraDataInterfaceCurlNoise* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurlNoise>();
	}
};

// Class Niagara.NiagaraDataInterfaceCurve
// 0x0080 (0x00F0 - 0x0070)
class UNiagaraDataInterfaceCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             Curve;                                             // 0x0070(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCurve">();
	}
	static class UNiagaraDataInterfaceCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurve>();
	}
};

// Class Niagara.NiagaraDataInterfaceExport
// 0x0030 (0x0068 - 0x0038)
class UNiagaraDataInterfaceExport final : public UNiagaraDataInterface
{
public:
	struct FNiagaraUserParameterBinding           CallbackHandlerParameter;                          // 0x0038(0x0020)(Edit, NativeAccessSpecifierPublic)
	ENDIExport_GPUAllocationMode                  GPUAllocationMode;                                 // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         GPUAllocationFixedSize;                            // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPUAllocationPerParticleSize;                      // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceExport">();
	}
	static class UNiagaraDataInterfaceExport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceExport>();
	}
};

// Class Niagara.NiagaraDataInterfaceGBuffer
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceGBuffer final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceGBuffer">();
	}
	static class UNiagaraDataInterfaceGBuffer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGBuffer>();
	}
};

// Class Niagara.NiagaraDataInterfaceRWBase
// 0x00A0 (0x00D8 - 0x0038)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:
	TSet<int32>                                   OutputShaderStages;                                // 0x0038(0x0050)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSet<int32>                                   IterationShaderStages;                             // 0x0088(0x0050)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRWBase">();
	}
	static class UNiagaraDataInterfaceRWBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRWBase>();
	}
};

// Class Niagara.NiagaraDataInterfaceGrid2D
// 0x0020 (0x00F8 - 0x00D8)
class UNiagaraDataInterfaceGrid2D : public UNiagaraDataInterfaceRWBase
{
public:
	int32                                         NumCellsX;                                         // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCellsY;                                         // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCellsMaxAxis;                                   // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumAttributes;                                     // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetGridFromMaxAxis;                                // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector2D                              WorldBBoxSize;                                     // 0x00EC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceGrid2D">();
	}
	static class UNiagaraDataInterfaceGrid2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGrid2D>();
	}
};

// Class Niagara.NiagaraDataInterfaceGrid2DCollection
// 0x00C8 (0x01C0 - 0x00F8)
class UNiagaraDataInterfaceGrid2DCollection final : public UNiagaraDataInterfaceGrid2D
{
public:
	struct FNiagaraUserParameterBinding           RenderTargetUserParameter;                         // 0x00F8(0x0020)(Edit, NativeAccessSpecifierPublic)
	ENiagaraGpuBufferFormat                       OverrideBufferFormat;                              // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverrideFormat : 1;                               // 0x0119(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11A[0x56];                                     // 0x011A(0x0056)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<uint64, class UTextureRenderTarget2DArray*> ManagedRenderTargets;                           // 0x0170(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	bool FillRawTexture2D(const class UNiagaraComponent* Component, class UTextureRenderTarget2D* Dest, int32* TilesX, int32* TilesY);
	bool FillTexture2D(const class UNiagaraComponent* Component, class UTextureRenderTarget2D* Dest, int32 AttributeIndex);
	void GetRawTextureSize(const class UNiagaraComponent* Component, int32* SizeX, int32* SizeY);
	void GetTextureSize(const class UNiagaraComponent* Component, int32* SizeX, int32* SizeY);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceGrid2DCollection">();
	}
	static class UNiagaraDataInterfaceGrid2DCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGrid2DCollection>();
	}
};

// Class Niagara.NiagaraDataInterfaceGrid2DCollectionReader
// 0x0070 (0x0168 - 0x00F8)
class UNiagaraDataInterfaceGrid2DCollectionReader final : public UNiagaraDataInterfaceGrid2D
{
public:
	class FString                                 EmitterName;                                       // 0x00F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DIName;                                            // 0x0108(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x50];                                     // 0x0118(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceGrid2DCollectionReader">();
	}
	static class UNiagaraDataInterfaceGrid2DCollectionReader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGrid2DCollectionReader>();
	}
};

// Class Niagara.NiagaraDataInterfaceGrid3D
// 0x0028 (0x0100 - 0x00D8)
class UNiagaraDataInterfaceGrid3D : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntVector                             NumCells;                                          // 0x00D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellSize;                                          // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCellsMaxAxis;                                   // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESetResolutionMethod                          SetResolutionMethod;                               // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldBBoxSize;                                     // 0x00F0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceGrid3D">();
	}
	static class UNiagaraDataInterfaceGrid3D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGrid3D>();
	}
};

// Class Niagara.NiagaraDataInterfaceGrid3DCollection
// 0x0080 (0x0180 - 0x0100)
class UNiagaraDataInterfaceGrid3DCollection final : public UNiagaraDataInterfaceGrid3D
{
public:
	int32                                         NumAttributes;                                     // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FNiagaraUserParameterBinding           RenderTargetUserParameter;                         // 0x0108(0x0020)(Edit, NativeAccessSpecifierPublic)
	ENiagaraGpuBufferFormat                       OverrideBufferFormat;                              // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverrideFormat : 1;                               // 0x0129(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_12A[0x56];                                     // 0x012A(0x0056)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool FillRawVolumeTexture(const class UNiagaraComponent* Component, class UVolumeTexture* Dest, int32* TilesX, int32* TilesY, int32* TileZ);
	bool FillVolumeTexture(const class UNiagaraComponent* Component, class UVolumeTexture* Dest, int32 AttributeIndex);
	void GetRawTextureSize(const class UNiagaraComponent* Component, int32* SizeX, int32* SizeY, int32* SizeZ);
	void GetTextureSize(const class UNiagaraComponent* Component, int32* SizeX, int32* SizeY, int32* SizeZ);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceGrid3DCollection">();
	}
	static class UNiagaraDataInterfaceGrid3DCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGrid3DCollection>();
	}
};

// Class Niagara.NiagaraDataInterfaceLandscape
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceLandscape final : public UNiagaraDataInterface
{
public:
	class AActor*                                 SourceLandscape;                                   // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceLandscape">();
	}
	static class UNiagaraDataInterfaceLandscape* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceLandscape>();
	}
};

// Class Niagara.NiagaraDataInterfaceMeshRendererInfo
// 0x0018 (0x0050 - 0x0038)
class UNiagaraDataInterfaceMeshRendererInfo final : public UNiagaraDataInterface
{
public:
	class UNiagaraMeshRendererProperties*         MeshRenderer;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceMeshRendererInfo">();
	}
	static class UNiagaraDataInterfaceMeshRendererInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceMeshRendererInfo>();
	}
};

// Class Niagara.NiagaraDataInterfaceNeighborGrid3D
// 0x0008 (0x0108 - 0x0100)
class UNiagaraDataInterfaceNeighborGrid3D final : public UNiagaraDataInterfaceGrid3D
{
public:
	uint32                                        MaxNeighborsPerCell;                               // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceNeighborGrid3D">();
	}
	static class UNiagaraDataInterfaceNeighborGrid3D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceNeighborGrid3D>();
	}
};

// Class Niagara.NiagaraDataInterfaceOcclusion
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceOcclusion final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceOcclusion">();
	}
