#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NitrogenRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NitrogenRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class NitrogenRuntime.FortAthenaMutator_Nitrogen
// 0x0E38 (0x1208 - 0x03D0)
class AFortAthenaMutator_Nitrogen final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_3D0[0x88];                                     // 0x03D0(0x0088)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnFareEventWidgetAvailable;                        // 0x0458(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PlayerSpecialActorTag;                             // 0x0468(0x0008)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PassengerSpecialActorTag;                          // 0x0470(0x0008)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VehicleSpecialActorTag;                            // 0x0478(0x0008)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNitrogenPOICombinationMap>     NitrogenPOICombinationList;                        // 0x0480(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  MatchStartVehicleCleanupTags;                      // 0x0490(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MatchNearEndScoreRatio;                            // 0x04B0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UNitrogenPlayerComponent>   NitrogenPlayerComponentClass;                      // 0x04D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenPlayerGameplayAbilityOption> PlayerGameplayAbilityOptionList;             // 0x04E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenPickupItemToDropOnDeath> PickupItemsToDropOnDeath;                        // 0x04F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  VehicleInteractionAbilityTags;                     // 0x0500(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DisallowedDamageTagsInSameVehicle;                 // 0x0520(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HitByVehicleTag;                                   // 0x0540(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  FareDeliveryAccoladeTags;                          // 0x0560(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CoinPickupAccoladeTag;                             // 0x0580(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowRedeployGliders;                             // 0x0588(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StormShieldRadiusCalculationMultiplier;            // 0x05B0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StormShieldRadiusOffset;                           // 0x05D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FVector>     OverridePOILocationsByTagMap;                      // 0x0600(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FPrimaryAssetId                        NitrogenVehicleAssetId;                            // 0x0650(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VehicleSpawnZOffset;                               // 0x0660(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ANavArrow>                  NavArrowClass;                                     // 0x0688(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfExtraVehiclesToMaintain;                      // 0x0690(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            ExplosionDamageMultiplierGE;                       // 0x06B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortSquadStartSearchParamData         SquadStartSearchParam;                             // 0x06C0(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RemoveLoadingScreenFailsafeTimerDuration;          // 0x0780(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortSquadStartSearchParamData         RespawnPointSearchParam;                           // 0x07A8(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnPointCooldownDuration;                      // 0x0868(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                VehicleOverlapCheckBoxExtent;                      // 0x0890(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         MinTeleportHeightAboveGround;                      // 0x08A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   TeleportingPlayersText;                            // 0x08C8(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenFare>              NitrogenFareClass;                                 // 0x08E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenTraversePoint>     PickUpTraversePointClass;                          // 0x08E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenTraversePoint>     DropOffTraversePointClass;                         // 0x08F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowSharedDropOffs;                              // 0x08F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumDistanceBetweenPickupPoints;                // 0x0920(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bUseFarePortraitTextures;                          // 0x0948(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfTopTeamsToShowOnMap;                          // 0x0970(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenMapPlacementIcon>      PlacementBasedMapIcons;                            // 0x0998(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNitrogenMapIcon                       PickUpPointMapIcon;                                // 0x09A8(0x00B0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenMapIcon                       DropOffPointMapIcon;                               // 0x0A58(0x00B0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenMapIcon                       VehicleMapIcon;                                    // 0x0B08(0x00B0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfFaresToShowOnCompass;                         // 0x0BB8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfVehiclesToShowOnCompass;                      // 0x0BE0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 FareCompassIcon;                                   // 0x0C08(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 DropOffPointCompassIcon;                           // 0x0CA8(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 VehicleCompassIcon;                                // 0x0D48(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     DropOffWidgetActorClass;                           // 0x0DE8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     NearbyVehicleWidgetActorClass;                     // 0x0DF0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortSquadStartSearchParamData         PickupCashbagSearchParam;                          // 0x0DF8(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CashbagSelectedPercentage;                         // 0x0EB8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FNitrogenPickupCashbagData> CashbagDataMap;                     // 0x0EE0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PassengerDespawnDelay;                             // 0x0F30(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PlayerSpecialActorRepInterval;                     // 0x0F58(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NitrogenVehicleTag;                                // 0x0F80(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F88[0x4];                                      // 0x0F88(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	ENitrogenGamePhase                            NitrogenGamePhase;                                 // 0x0F8C(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8D[0x13];                                     // 0x0F8D(0x0013)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FNitrogenTeamData>              SortedTeamDataByScore;                             // 0x0FA0(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerStateAthena*>         CacheLeadingReplicatedPlayerStates;                // 0x0FB0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClass*                                 NitrogenVehicleClass;                              // 0x0FC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FNitrogenVehicle>               NitrogenVehiclesList;                              // 0x0FC8(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortSquadStart*>                NitrogenSquadStarts;                               // 0x0FD8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FE8[0x28];                                     // 0x0FE8(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortAthenaMutator_SynchronizedTeleport* TeleportMutator;                                  // 0x1010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_GameStartCountdown*  GameStartCountdownMutator;                         // 0x1018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_InventoryOverride*   InventoryMutator;                                  // 0x1020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1028[0xA0];                                    // 0x1028(0x00A0)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<struct FGameplayTag, struct FNitrogenPOITraversePoints> UnassignedPickupPointsPerPOIMap;    // 0x10C8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FNitrogenPOITraversePoints> UnassignedPOIBasedDropoffPointsMap; // 0x1118(0x0050)(NativeAccessSpecifierPrivate)
	TArray<class ANitrogenTraversePoint*>         UnassignedDistanceBasedDropoffPointsArray;         // 0x1168(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1178[0x10];                                    // 0x1178(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class ANavArrow*                              ClientNavArrow;                                    // 0x1188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1190[0x18];                                    // 0x1190(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class ANitrogenFare*>                  CurrentFares;                                      // 0x11A8(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ANitrogenFare*>                  CurrentActiveFares;                                // 0x11B8(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C8[0x40];                                    // 0x11C8(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleGameStartCountdownEnd();
	void HandleGroupTeleportComplete();
	void HandlePlayerTeleportComplete(class AFortPlayerStateAthena* PlayerState);
	void OnNitrogenVehicleDestroyed(class AActor* VehicleDestroyed);
	void OnNitrogenVehicleDriverChanged(const class AFortPlayerControllerAthena* NewController, class AFortAthenaVehicle* Vehicle);
	void OnNitrogenVehiclePlayerExit(const class AFortPlayerControllerAthena* PlayerController, class AFortAthenaVehicle* Vehicle);
	void OnRep_CurrentFares();
	void OnRep_NitrogenGamePhase();
	void OnRep_SortedTeamDataByScore();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Nitrogen">();
	}
	static class AFortAthenaMutator_Nitrogen* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Nitrogen>();
	}
};

// Class NitrogenRuntime.FortCheatManager_Nitrogen
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_Nitrogen final : public UFortCheatManager_Coupled
{
public:
	void CompleteNitrogenFare();
	void SetNitrogenNavDestinationToCurrentLocation();
	void SetNitrogenScore(const int32 Score, const uint8 ScoreReason);
	void SpawnNitrogenFare(const float PickUpDistance, const float DropOffDistance);
	void TeleportToNitrogenRespawnActor(const int32 Index_0);
	void TeleportToNitrogenSpawnActor(const int32 Index_0);
	void TeleportToSquadStartAtIndex(const int32 Index_0, const struct FFortSquadStartSearchParamData& SearchParam, class FString* TeleportReasonString);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_Nitrogen">();
	}
	static class UFortCheatManager_Nitrogen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Nitrogen>();
	}
};

// Class NitrogenRuntime.NitrogenFare
// 0x0F10 (0x1130 - 0x0220)
class ANitrogenFare final : public AActor
{
public:
	class AFortPlayerPawnAthena*                  Passenger;                                         // 0x0220(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANitrogenTraversePoint*                 PickUpPoint;                                       // 0x0228(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANitrogenTraversePoint*                 DropOffPoint;                                      // 0x0230(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DropOffPointLocation;                              // 0x0238(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FNitrogenBonusStats                    BonusStats;                                        // 0x0248(0x0D08)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FastDeliveryKmph;                                  // 0x0F50(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_F78[0x30];                                     // 0x0F78(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UFortAthenaAISpawnerData>   PassengerSpawnerDataClass;                         // 0x0FA8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNitrogenPassengerPawnComponent> NitrogenPassengerPawnComponentClass;          // 0x0FB0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PassengerSeatIndex;                                // 0x0FB8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FBC[0x4];                                      // 0x0FBC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         PassengerSpawnRetryRate;                           // 0x0FC0(0x0028)(Edit, DisableEditOnInstance, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	int32                                         RewardValue;                                       // 0x0FE8(0x0004)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FastDeliveryTime;                                  // 0x0FEC(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FastDeliveryBonusPoints;                           // 0x0FF0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FF4[0x4];                                      // 0x0FF4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         FastDeliveryMargin;                                // 0x0FF8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         DistanceThresholdIndex;                            // 0x1020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1024[0x4];                                     // 0x1024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         PickupTime;                                        // 0x1028(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DropoffTime;                                       // 0x1050(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EFareGenerationMethod                         FareGenerationMethod;                              // 0x1078(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1079[0x7];                                     // 0x1079(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         bDisablePassengerCollision;                        // 0x1080(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortPlayerStateAthena*                 AssignedPlayerState;                               // 0x10A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortPlayerStateAthena*                 PreviousPlayerState;                               // 0x10B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPassengerPickedUp;                                // 0x10B8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10B9[0x1F];                                    // 0x10B9(0x001F)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class AFortPlayerStateAthena*, struct FTimerHandle> PickupTimerHandles;                     // 0x10D8(0x0050)(NativeAccessSpecifierPrivate)
	struct FTimerHandle                           DropOffTimerHandle;                                // 0x1128(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DropOffPointExited(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);
	void DropOffPointOverlapped(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);
	void OnRep_PassengerPickedUp();
	void OnVehicleDestroyed(class AFortDagwoodVehicle* DestroyedVehicle);
	void OnVehicleDriverChanged(const class AFortPlayerControllerAthena* NewDriver, class AFortAthenaVehicle* Vehicle);
	void OnVehicleEndPlay(class AActor* DestroyedVehicle, EEndPlayReason EndPlayReason);
	void PickUpPointExited(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);
	void PickUpPointOverlapped(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);

	const int32 GetRewardValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenFare">();
	}
	static class ANitrogenFare* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenFare>();
	}
};

// Class NitrogenRuntime.NitrogenPickup
// 0x0018 (0x0678 - 0x0660)
class ANitrogenPickup final : public AFortGameModePickup
{
public:
	ENitrogenScoreReason                          ScoreReason;                                       // 0x0660(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USphereComponent*                       AutoPickupTouchComponent;                          // 0x0668(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENitrogenPickupType                           NitrogenPickupType;                                // 0x0670(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoAllowInteraction;                             // 0x0671(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         TeamHidden;                                        // 0x0672(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_673[0x5];                                      // 0x0673(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnNitrogenPickupOverlapped(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnRep_TeamHidden();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenPickup">();
	}
	static class ANitrogenPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenPickup>();
	}
};

// Class NitrogenRuntime.NitrogenFareValueIndicator
// 0x0028 (0x0248 - 0x0220)
class ANitrogenFareValueIndicator final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedMeshComp;                                 // 0x0220(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenFareValueMeshTransformInfo> FareValueMeshTransformInfo;                   // 0x0228(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         IndicatorValue;                                    // 0x0238(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldActorRotateOnTickToFacePlayerCamera;        // 0x0239(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerCameraManager*                   LocalPlayerCameraManager;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFareIndicatorValueChanged(const uint8 NewIndicatorValue);
	void OnRep_IndicatorValue();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenFareValueIndicator">();
	}
	static class ANitrogenFareValueIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenFareValueIndicator>();
	}
};

// Class NitrogenRuntime.NitrogenNavArrow
// 0x0368 (0x0590 - 0x0228)
class alignas(0x10) ANitrogenNavArrow final : public ANavArrow
{
public:
	struct FVector                                LocationRelativeToOwner;                           // 0x0228(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFollowCamera;                                     // 0x0234(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                LocationRelativeToCamera;                          // 0x0238(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         PitchRelativeToCamera;                             // 0x0248(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ArrowSizeRelativeToScreen;                         // 0x0270(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ArrowPlacementHeightRelativeToScreen;              // 0x0298(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                LocationRelativeToDestination;                     // 0x02C0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bThrowingEnabled;                                  // 0x02CC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         ApproachRadius;                                    // 0x02D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DepartRadius;                                      // 0x02F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ThrowTranslationCurve;                             // 0x0320(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ThrowRotationCurve;                                // 0x0328(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PrimaryColorParameterName;                         // 0x0330(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveLinearColor*                      ArrowColorCurve;                                   // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ColorFadeOuterRadius;                              // 0x0340(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ColorFadeInnerRadius;                              // 0x0344(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PulseParameterName;                                // 0x0348(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            PulseParameterCurve;                               // 0x0350(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            PulseSpeedCurve;                                   // 0x0358(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PulseAccelOuterRadius;                             // 0x0360(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PulseAccelInnerRadius;                             // 0x0364(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ScaleCurve;                                        // 0x0368(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ArrowComponent;                                    // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x210];                                    // 0x0378(0x0210)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               ArrowDynamicMaterial;                              // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RecallArrowToOwner();
	void ThrowArrowToDestination();
	void UpdatePrimaryColorForDistance();
	void UpdatePulseSpeedForDistance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenNavArrow">();
	}
	static class ANitrogenNavArrow* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenNavArrow>();
	}
};

// Class NitrogenRuntime.NitrogenPassengerPawnComponent
// 0x00F0 (0x01A0 - 0x00B0)
class UNitrogenPassengerPawnComponent final : public UFortPawnComponent
{
public:
	TMap<ENitrogenPassengerState, class UAnimationAsset*> MalePassengerStateAnimationMap;            // 0x00B0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ENitrogenPassengerState, class UAnimationAsset*> FemalePassengerStateAnimationMap;          // 0x0100(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bDestroyFareValueIndicatorOnDisable;               // 0x0150(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenFareValueIndicator> FareValueIndicatorClass;                          // 0x0178(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FareValueIndicatorOffset;                          // 0x0180(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ANitrogenFareValueIndicator*            FareValueIndicator;                                // 0x0190(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENitrogenPassengerState                       PassengerState;                                    // 0x0198(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ClientHandleFinishedCharacterCustomization(class AFortPlayerPawn* PlayerPawn);
	void ClientPlayDeathEffects();
	void OnRep_FareValueIndicator();
	void OnRep_PassengerState();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenPassengerPawnComponent">();
	}
	static class UNitrogenPassengerPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitrogenPassengerPawnComponent>();
	}
};

// Class NitrogenRuntime.NitrogenFareDataRepActor
// 0x0028 (0x0248 - 0x0220)
class ANitrogenFareDataRepActor final : public AActor
{
public:
	struct FNitrogenFareRepData                   FareRepData;                                       // 0x0220(0x0018)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x10];                                     // 0x0238(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_FareRepData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenFareDataRepActor">();
	}
	static class ANitrogenFareDataRepActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenFareDataRepActor>();
	}
};

// Class NitrogenRuntime.NitrogenPlayerComponent
// 0x02B8 (0x0368 - 0x00B0)
class UNitrogenPlayerComponent final : public UFortControllerComponent
{
public:
	class AActor*                                 CurrentFareWidgetActor;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnClientBeginFare;                                 // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool FareCompleted)> OnClientEndFare;                              // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x40];                                      // 0x00D8(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bPlayerIsAlreadyDrivingNitrogenVehicle;            // 0x0118(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class AFortAthenaMutator_Nitrogen> CachedMutator;                                 // 0x011C(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         NearbyVehicleUpdateRate;                           // 0x0128(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumVehicleAirTimeBeforeStatTracking;           // 0x0150(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class USoundMix*                              LoadingScreenSoundSuppressionSoundMix;             // 0x0178(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowHighlightNearbyLeadingPlayers;               // 0x0180(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bHighlightLeadingPlayers_UseStencilHighlight;      // 0x01A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_UpdateRate;                // 0x01D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_MinTeamScore;              // 0x01F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_MaxDistance;               // 0x0220(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_HighlightDuration;         // 0x0248(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bHighlightLeadingPlayers_IndicatorClampToScreen;   // 0x0270(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_IndicatorZOffset;          // 0x0298(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EIndicatorStateImage                          OverrideIndicatorImage;                            // 0x02C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   HighlightLeadingPlayers_StencilName;               // 0x02C4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0xC];                                      // 0x02CC(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AFortPlayerPawnAthena*>          CurrentlyHighlightedLeadingPlayers;                // 0x02D8(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNitrogenFareInteractionData           FareInteractionData;                               // 0x02E8(0x0018)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class ABuildingActor*>                 DestroyedBuildingActors;                           // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0x20];                                     // 0x0318(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 NearestVehicleWidget;                              // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortSquadStart*                        CurrentRespawnSquadStart;                          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x10];                                     // 0x0348(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class ANitrogenFare*                          PreviousFare;                                      // 0x0358(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANitrogenFareDataRepActor*              FareDataRepActor;                                  // 0x0360(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientHandleLoadingScreenStateChanged(class AFortPlayerControllerAthena* PlayerController, bool bEnableLoadScreen, const class FText& HUDReasonText);
	void HandleVehicleDestroyedBuildingActor(class AFortAthenaVehicle* Vehicle, class ABuildingActor* BuildingActor);
	void OnEnterVehicleDriver();
	void OnEnterVehiclePassenger();
	void OnExitVehicle();
	void OnGameStarted();
	void OnNitrogenGamePhaseChanged(ENitrogenGamePhase NewGamePhase);
	void OnRep_CachedMutator();
	void OnRep_FareDataRepActor();
	void OnRep_FareInteractionData();

	float GetDistanceFromClosestPassenger() const;
	float GetDistanceFromDropOff() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenPlayerComponent">();
	}
	static class UNitrogenPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitrogenPlayerComponent>();
	}
};

// Class NitrogenRuntime.NitrogenTraversePoint
// 0x00A0 (0x09C8 - 0x0928)
class ANitrogenTraversePoint final : public AAthenaLTMTraversePoint
{
public:
	ENitrogenTraversePointMode                    CurrentNitrogenTraversePointMode;                  // 0x0928(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USceneComponent*                        SceneRoot;                                         // 0x0930(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystemComponent*               FareRadiusParticleSystemComponent;                 // 0x0938(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCapsuleComponent*                      TriggerCapsule;                                    // 0x0940(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HideActorDelay;                                    // 0x0948(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_94C[0x7C];                                     // 0x094C(0x007C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnClientInteracted(bool bOwnedByClient);
	void OnClientVisibiltyUpdated(bool bNewHidden);
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnVehicleDriverChanged(const class AFortPlayerControllerAthena* NewController, class AFortAthenaVehicle* Vehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenTraversePoint">();
	}
	static class ANitrogenTraversePoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenTraversePoint>();
	}
};

// Class NitrogenRuntime.NitrogenVehicleComponent
// 0x01C8 (0x0278 - 0x00B0)
class UNitrogenVehicleComponent final : public UActorComponent
{
public:
	class UTimelineComponent*                     TimelineBoostFX;                                   // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            JetFlamesHeightCurve;                              // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            JetSparksCountsCurve;                              // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimelineBoostFXLength;                             // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UNiagaraSystem*                         BoostVFXSystem;                                    // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BoostAttachSocketName;                             // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               BoostAttachRotation;                               // 0x00E0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FNitrogenVehicleBoostFXVariable        JetFlameRandomMin;                                 // 0x00F0(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenVehicleBoostFXVariable        JetFlameLocationOffsetZ;                           // 0x0108(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenVehicleBoostFXVariable        JetFlameLocationOffsetX;                           // 0x0120(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FString                                 JetFlameHeightParamName;                           // 0x0138(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         JetFlameMinHeight;                                 // 0x0148(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         JetFlameMaxHeight;                                 // 0x014C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 JetSparksCountsParamName;                          // 0x0150(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      SpawnedBoostParticleSystem;                        // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumBumpBonusStatVelocityKmh;                   // 0x0168(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         CooldownBetweenBumps;                              // 0x0190(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         bCleanupUnreachableVehicleInWater;                 // 0x0198(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         VehicleWaterDepthCheckTickDelay;                   // 0x01C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         VehicleWaterDepthForCleanup;                       // 0x01C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bCleanupUnreachableVehiclesSilently;               // 0x01F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VehicleInWaterCleanupDelay;                        // 0x0218(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     OwningVehicle;                                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AFortWaterBodyActor*>            WaterBodies;                                       // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0x18];                                     // 0x0260(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleVehicleOnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SetBoostFXActive(const bool bActive);
	void TimelineBoostFXUpdate_JetFlamesHeight(float Value);
	void TimelineBoostFXUpdate_JetSparksCounts(float Value);

	bool IsVehicleUnderCleanupWaterDepth() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitrogenVehicleComponent">();
	}
	static class UNitrogenVehicleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitrogenVehicleComponent>();
	}
};

}

