#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NitrogenRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "NitrogenRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NitrogenRuntime.FortAthenaMutator_Nitrogen.HandlePlayerTeleportComplete
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Nitrogen_HandlePlayerTeleportComplete final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.FortAthenaMutator_Nitrogen.OnNitrogenVehicleDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Nitrogen_OnNitrogenVehicleDestroyed final
{
public:
	class AActor*                                 VehicleDestroyed;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.FortAthenaMutator_Nitrogen.OnNitrogenVehicleDriverChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Nitrogen_OnNitrogenVehicleDriverChanged final
{
public:
	const class AFortPlayerControllerAthena*      NewController;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.FortAthenaMutator_Nitrogen.OnNitrogenVehiclePlayerExit
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Nitrogen_OnNitrogenVehiclePlayerExit final
{
public:
	const class AFortPlayerControllerAthena*      PlayerController;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.FortCheatManager_Nitrogen.SetNitrogenScore
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_Nitrogen_SetNitrogenScore final
{
public:
	int32                                         Score;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ScoreReason;                                       // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function NitrogenRuntime.FortCheatManager_Nitrogen.SpawnNitrogenFare
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_Nitrogen_SpawnNitrogenFare final
{
public:
	float                                         PickUpDistance;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DropOffDistance;                                   // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.FortCheatManager_Nitrogen.TeleportToNitrogenRespawnActor
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Nitrogen_TeleportToNitrogenRespawnActor final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.FortCheatManager_Nitrogen.TeleportToNitrogenSpawnActor
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Nitrogen_TeleportToNitrogenSpawnActor final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.FortCheatManager_Nitrogen.TeleportToSquadStartAtIndex
// 0x00D8 (0x00D8 - 0x0000)
struct FortCheatManager_Nitrogen_TeleportToSquadStartAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortSquadStartSearchParamData         SearchParam;                                       // 0x0008(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 TeleportReasonString;                              // 0x00C8(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenFare.DropOffPointExited
// 0x0010 (0x0010 - 0x0000)
struct NitrogenFare_DropOffPointExited final
{
public:
	class AAthenaTraversePoint*                   TraversePoint;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenFare.DropOffPointOverlapped
// 0x0010 (0x0010 - 0x0000)
struct NitrogenFare_DropOffPointOverlapped final
{
public:
	class AAthenaTraversePoint*                   TraversePoint;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenFare.OnVehicleDestroyed
// 0x0008 (0x0008 - 0x0000)
struct NitrogenFare_OnVehicleDestroyed final
{
public:
	class AFortDagwoodVehicle*                    DestroyedVehicle;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenFare.OnVehicleDriverChanged
// 0x0010 (0x0010 - 0x0000)
struct NitrogenFare_OnVehicleDriverChanged final
{
public:
	const class AFortPlayerControllerAthena*      NewDriver;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenFare.OnVehicleEndPlay
// 0x0010 (0x0010 - 0x0000)
struct NitrogenFare_OnVehicleEndPlay final
{
public:
	class AActor*                                 DestroyedVehicle;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function NitrogenRuntime.NitrogenFare.PickUpPointExited
// 0x0010 (0x0010 - 0x0000)
struct NitrogenFare_PickUpPointExited final
{
public:
	class AAthenaTraversePoint*                   TraversePoint;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenFare.PickUpPointOverlapped
// 0x0010 (0x0010 - 0x0000)
struct NitrogenFare_PickUpPointOverlapped final
{
public:
	class AAthenaTraversePoint*                   TraversePoint;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenFare.GetRewardValue
// 0x0004 (0x0004 - 0x0000)
struct NitrogenFare_GetRewardValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenPickup.OnNitrogenPickupOverlapped
// 0x00B0 (0x00B0 - 0x0000)
struct NitrogenPickup_OnNitrogenPickupOverlapped final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function NitrogenRuntime.NitrogenFareValueIndicator.OnFareIndicatorValueChanged
// 0x0001 (0x0001 - 0x0000)
struct NitrogenFareValueIndicator_OnFareIndicatorValueChanged final
{
public:
	uint8                                         NewIndicatorValue;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenPassengerPawnComponent.ClientHandleFinishedCharacterCustomization
// 0x0008 (0x0008 - 0x0000)
struct NitrogenPassengerPawnComponent_ClientHandleFinishedCharacterCustomization final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenPlayerComponent.ClientHandleLoadingScreenStateChanged
// 0x0028 (0x0028 - 0x0000)
struct NitrogenPlayerComponent_ClientHandleLoadingScreenStateChanged final
{
public:
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLoadScreen;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   HUDReasonText;                                     // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenPlayerComponent.HandleVehicleDestroyedBuildingActor
// 0x0010 (0x0010 - 0x0000)
struct NitrogenPlayerComponent_HandleVehicleDestroyedBuildingActor final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingActor*                         BuildingActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenPlayerComponent.OnNitrogenGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct NitrogenPlayerComponent_OnNitrogenGamePhaseChanged final
{
public:
	ENitrogenGamePhase                            NewGamePhase;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenPlayerComponent.GetDistanceFromClosestPassenger
// 0x0004 (0x0004 - 0x0000)
struct NitrogenPlayerComponent_GetDistanceFromClosestPassenger final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenPlayerComponent.GetDistanceFromDropOff
// 0x0004 (0x0004 - 0x0000)
struct NitrogenPlayerComponent_GetDistanceFromDropOff final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenTraversePoint.OnClientInteracted
// 0x0001 (0x0001 - 0x0000)
struct NitrogenTraversePoint_OnClientInteracted final
{
public:
	bool                                          bOwnedByClient;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenTraversePoint.OnClientVisibiltyUpdated
// 0x0001 (0x0001 - 0x0000)
struct NitrogenTraversePoint_OnClientVisibiltyUpdated final
{
public:
	bool                                          bNewHidden;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenTraversePoint.OnEndOverlap
// 0x0010 (0x0010 - 0x0000)
struct NitrogenTraversePoint_OnEndOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenTraversePoint.OnVehicleDriverChanged
// 0x0010 (0x0010 - 0x0000)
struct NitrogenTraversePoint_OnVehicleDriverChanged final
{
public:
	const class AFortPlayerControllerAthena*      NewController;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenVehicleComponent.HandleVehicleOnHit
// 0x00B0 (0x00B0 - 0x0000)
struct NitrogenVehicleComponent_HandleVehicleOnHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0024(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenVehicleComponent.SetBoostFXActive
// 0x0001 (0x0001 - 0x0000)
struct NitrogenVehicleComponent_SetBoostFXActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenVehicleComponent.TimelineBoostFXUpdate_JetFlamesHeight
// 0x0004 (0x0004 - 0x0000)
struct NitrogenVehicleComponent_TimelineBoostFXUpdate_JetFlamesHeight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenVehicleComponent.TimelineBoostFXUpdate_JetSparksCounts
// 0x0004 (0x0004 - 0x0000)
struct NitrogenVehicleComponent_TimelineBoostFXUpdate_JetSparksCounts final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenRuntime.NitrogenVehicleComponent.IsVehicleUnderCleanupWaterDepth
// 0x0001 (0x0001 - 0x0000)
struct NitrogenVehicleComponent_IsVehicleUnderCleanupWaterDepth final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

