#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PhosphorusUI

#include "Basic.hpp"

#include "PhosphorusRuntime_structs.hpp"


namespace SDK::Params
{

// Function PhosphorusUI.PhosphorusWidgetBase.OnMutatorAvailable
// 0x0008 (0x0008 - 0x0000)
struct PhosphorusWidgetBase_OnMutatorAvailable final
{
public:
	class AFortGameplayMutator*                   MutatorActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusUI.PhosphorusWidgetBase.SetAvatarImageFromPlayerState
// 0x0010 (0x0010 - 0x0000)
struct PhosphorusWidgetBase_SetAvatarImageFromPlayerState final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortLazyImage*                         AvatarImage;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusUI.PhosphorusWidgetBase.GetPhosphorusMutator
// 0x0008 (0x0008 - 0x0000)
struct PhosphorusWidgetBase_GetPhosphorusMutator final
{
public:
	class AFortAthenaMutator_Phosphorus*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusUI.PhosphorusEndOfRoundWidget.OnPhosphorusPhaseChanged
// 0x0010 (0x0010 - 0x0000)
struct PhosphorusEndOfRoundWidget_OnPhosphorusPhaseChanged final
{
public:
	class AFortAthenaMutator_Phosphorus*          PhosphorusMutator;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhosphorusPhase                              NewPhase;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PhosphorusUI.PhosphorusEndOfRoundWidget.SetWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct PhosphorusEndOfRoundWidget_SetWidgetVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusUI.PhosphorusHUDWidget.OnPhosphorusPlayerEliminated_BP
// 0x0008 (0x0008 - 0x0000)
struct PhosphorusHUDWidget_OnPhosphorusPlayerEliminated_BP final
{
public:
	class AFortPlayerStateAthena*                 PlayerEliminated;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusUI.PhosphorusSquadWipedWidget.HandleSquadWipedVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct PhosphorusSquadWipedWidget_HandleSquadWipedVisibilityChanged final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

