#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PhosphorusWipeoutRuntime

#include "Basic.hpp"

#include "PhosphorusWipeoutRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PhosphorusRuntime_classes.hpp"


namespace SDK
{

// Class PhosphorusWipeoutRuntime.FortAthenaMutator_ModifyIncomingPawnDamage
// 0x0010 (0x02D0 - 0x02C0)
class AFortAthenaMutator_ModifyIncomingPawnDamage final : public AFortAthenaMutator
{
public:
	TArray<struct FModifyIncomingPawnDamageDefinition> DamageDefinitions;                            // 0x02C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_ModifyIncomingPawnDamage">();
	}
	static class AFortAthenaMutator_ModifyIncomingPawnDamage* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ModifyIncomingPawnDamage>();
	}
};

// Class PhosphorusWipeoutRuntime.FortAthenaMutator_PhosphorusWipeout
// 0x0098 (0x07E0 - 0x0748)
class AFortAthenaMutator_PhosphorusWipeout final : public AFortAthenaMutator_Phosphorus
{
public:
	uint8                                         Pad_748[0x60];                                     // 0x0748(0x0060)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   OutsideSafeZoneEliminatedOverlayText;              // 0x07A8(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FPhosphorusWipeoutKnockBackData& KnockBackData)> PhosphorusWipeoutOnAllPlayersKnockBackDataChanged; // 0x07C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FPhosphorusWipeoutKnockBackData> AllPlayersKnockBackData;                          // 0x07D0(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void HandleBlockedCharacterMovement(struct FHitResult* InOutImpact, class AFortPawn* FortPawn);
	void OnRep_KnockBackDataChanged(const TArray<struct FPhosphorusWipeoutKnockBackData>& OldValue);
	void SetPlayersShouldBreakThroughStructures(bool bActive, class AFortPlayerPawn* PlayerPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_PhosphorusWipeout">();
	}
	static class AFortAthenaMutator_PhosphorusWipeout* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_PhosphorusWipeout>();
	}
};

// Class PhosphorusWipeoutRuntime.FortAthenaMutator_ReroutePlayerEvent
// 0x0030 (0x02F0 - 0x02C0)
class AFortAthenaMutator_ReroutePlayerEvent final : public AFortAthenaMutator
{
public:
	TArray<struct FReroutePlayerEventDefinition>  RerouteDefinitions;                                // 0x02C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D0[0x20];                                     // 0x02D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void FlushEventQueue();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_ReroutePlayerEvent">();
	}
	static class AFortAthenaMutator_ReroutePlayerEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ReroutePlayerEvent>();
	}
};

// Class PhosphorusWipeoutRuntime.GA_Wipeout_PlayerKnockBackNative
// 0x0010 (0x0AC8 - 0x0AB8)
class UGA_Wipeout_PlayerKnockBackNative final : public UFortGameplayAbility
{
public:
	class AFortAthenaMutator_PhosphorusWipeout*   CachedMutator;                                     // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortGameplayMutator>       MutatorClassToGet;                                 // 0x0AC0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SaveKnockBackData(const struct FPhosphorusWipeoutKnockBackData& InKnockBackData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GA_Wipeout_PlayerKnockBackNative">();
	}
	static class UGA_Wipeout_PlayerKnockBackNative* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Wipeout_PlayerKnockBackNative>();
	}
};

}

