#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PhosphorusRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum PhosphorusRuntime.EPhosphorusPhase
// NumValues: 0x0009
enum class EPhosphorusPhase : uint8
{
	PreMatch                                 = 0,
	RoundSetup                               = 1,
	PrePodLaunch                             = 2,
	PodsLaunched                             = 3,
	RoundInProgress                          = 4,
	RoundEnd                                 = 5,
	RoundEndUI                               = 6,
	MatchEnd                                 = 7,
	EPhosphorusPhase_MAX                     = 8,
};

// Enum PhosphorusRuntime.EPlayerSpawnPodState
// NumValues: 0x0006
enum class EPlayerSpawnPodState : uint8
{
	Setup                                    = 0,
	PreLaunch                                = 1,
	Moving                                   = 2,
	Landed                                   = 3,
	Ejected                                  = 4,
	EPlayerSpawnPodState_MAX                 = 5,
};

// Enum PhosphorusRuntime.EPhosphorusClientEventId
// NumValues: 0x0003
enum class EPhosphorusClientEventId : uint8
{
	ShowLocalPlayerSquadWipedUI              = 0,
	ShowEnemySquadWipedUI                    = 1,
	MAX                                      = 2,
};

// ScriptStruct PhosphorusRuntime.PlayerSpawnPodData
// 0x00B8 (0x00B8 - 0x0000)
struct FPlayerSpawnPodData final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerControllerAthena*>    Controllers;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerPawnAthena*>          EnteredPawns;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerPawnAthena*>          EjectedPawns;                                      // 0x0030(0x0010)(ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerSpawnPodState                          State;                                             // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                StartLocation;                                     // 0x0044(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PodActor;                                          // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AFortPlayerControllerAthena*, class AActor*> ViewTargetsByPlayerController;           // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, RepSkip, NativeAccessSpecifierPublic)
	float                                         LandTime;                                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextEjectYaw;                                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EjectYawIncrement;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct PhosphorusRuntime.PhosphorusTeamData
// 0x0010 (0x0010 - 0x0000)
struct FPhosphorusTeamData final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumRoundsWon;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerStateAthena*                 CurrentMVP;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

