#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PhosphorusRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhosphorusRuntime_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class PhosphorusRuntime.FortAthenaMutator_Phosphorus
// 0x0378 (0x0748 - 0x03D0)
class AFortAthenaMutator_Phosphorus : public AFortAthenaMutator_GameModeBase
{
public:
	TMulticastInlineDelegate<void(class AFortAthenaMutator_Phosphorus* Mutator, EPhosphorusPhase Phase)> OnPhosphorusPhaseChanged; // 0x03D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortAbilitySet*                        EjectAbilitySet;                                   // 0x03E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAbilitySet*                        LeaderAbilitySet;                                  // 0x03E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bKeepWarmupLoadoutsInFirstRound;                   // 0x03F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EPhosphorusPhase                              PhosphorusPhase;                                   // 0x0418(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             PlayerEnteredStormSound;                           // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_CustomStormMovement* StormMutator;                                      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_SafeZoneOrderOptimize* SafeZoneOrderOptimizeMutator;                    // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FPhosphorusTeamData>            TeamDataArray;                                     // 0x0440(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         InnerLandRadiusPercent;                            // 0x0450(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OuterLandRadiusPercent;                            // 0x0478(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TeamLandWedgeAngleRandPercent;                     // 0x04A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_PlayerSpawnPod*      PlayerSpawnPodMutator;                             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class AFortAthenaMutator_Phosphorus* Mutator, int32 Round)> OnRoundAdvanced; // 0x04D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E0[0x30];                                     // 0x04E0(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(uint8 TeamNum, class AFortPlayerStateAthena* NewMVP)> OnPhosphorusNewSquadMVP; // 0x0510(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxExpectedRoundsOverride;                         // 0x0520(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AdvanceRoundDelay;                                 // 0x0548(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EndRoundUIDuration;                                // 0x0570(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PreFirstRoundFadeOutDuration;                      // 0x0598(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrentRound;                                      // 0x05C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            EndRoundTimeDilationCurve;                         // 0x05C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EndRoundTimeDilationDuration;                      // 0x05D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EndRoundEmoteAudioFadeDuration;                    // 0x05F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EndMatchEmoteAudioFadeDuration;                    // 0x0620(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortAthenaCustomTimeDilationManager*   TimeDilationManager;                               // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_650[0x8];                                      // 0x0650(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         NumRoundsToWin;                                    // 0x0658(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         RoundWinningTeamNum;                               // 0x0680(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         DesiredSupplyDrops;                                // 0x0688(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SupplyDropPercentSafeZoneRadiusToUse;              // 0x06B0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SupplyDropMinTimeUntilSpawn;                       // 0x06D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SupplyDropMaxTimeUntilSpawn;                       // 0x0700(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_728[0x8];                                      // 0x0728(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AFortAthenaSupplyDrop*>          SupplyDrops;                                       // 0x0730(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AdvanceRound();
	void AudioFadeChangeEvent(bool bFadeOut, float FadeTime);
	void FadeToFirstRound();
	class AFortAthenaMutator_CustomStormMovement* GetCachedStormMutator();
	class AFortPlayerStateAthena* GetTeamMVP(const uint8 TeamNum);
	void HandlePawnStormStatusChanged(class AFortPlayerPawn* PlayerPawn, bool bIsInSafeZone);
	void OnAllPodsLanded();
	void OnAllPodsLaunched();
	void OnPawnEjectedFromPod(class AFortPlayerPawnAthena* Pawn);
	void OnPrePodLaunch();
	void OnRep_CurrentRound();
	void OnRep_PhosphorusPhase();

	void GetLeadingTeamNums(TArray<uint8>* LeadingTeamNums) const;
	int32 GetNumAliveTeams() const;
	int32 GetNumValidTeams() const;
	uint8 GetRoundWinningTeamNum() const;
	void GetTeamDataArray(TArray<struct FPhosphorusTeamData>* OutTeamDataArray, const bool bMustBeValid, const bool bMustBeAlive, const bool bSortByScore) const;
	struct FPhosphorusTeamData GetTeamDataCopy(const uint8 TeamNum) const;
	int32 GetTeamSize(const uint8 TeamNum) const;
	bool IsOnWinningTeam(const class AFortPlayerPawnAthena* Pawn) const;
	bool IsTeamAlive(const uint8 TeamNum) const;
	bool IsTeamValid(const uint8 TeamNum) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Phosphorus">();
	}
	static class AFortAthenaMutator_Phosphorus* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Phosphorus>();
	}
};

// Class PhosphorusRuntime.FortAthenaMutator_InventoryOverride_Phosphorus
// 0x0000 (0x0518 - 0x0518)
class AFortAthenaMutator_InventoryOverride_Phosphorus final : public AFortAthenaMutator_InventoryOverride
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_InventoryOverride_Phosphorus">();
	}
	static class AFortAthenaMutator_InventoryOverride_Phosphorus* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_InventoryOverride_Phosphorus>();
	}
};

// Class PhosphorusRuntime.FortCheatManager_Phosphorus
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_Phosphorus final : public UFortCheatManager_Coupled
{
public:
	void PhosphorusDebug(float TextScale);
	void PhosphorusEndMatch();
	void PhosphorusEndRound();
	void PhosphorusSetNumRoundsToWin(const int32 NumRounds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_Phosphorus">();
	}
	static class UFortCheatManager_Phosphorus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Phosphorus>();
	}
};

// Class PhosphorusRuntime.FortCheatManager_PlayerSpawnPod
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_PlayerSpawnPod final : public UFortCheatManager_Coupled
{
public:
	void PlayerSpawnPodDebug(float TextScale);
	void PlayerSpawnPodTest();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_PlayerSpawnPod">();
	}
	static class UFortCheatManager_PlayerSpawnPod* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_PlayerSpawnPod>();
	}
};

// Class PhosphorusRuntime.PlayerSpawnPodCameraActor
// 0x0000 (0x07A0 - 0x07A0)
class APlayerSpawnPodCameraActor final : public ACameraActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerSpawnPodCameraActor">();
	}
	static class APlayerSpawnPodCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerSpawnPodCameraActor>();
	}
};

// Class PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod
// 0x0470 (0x0730 - 0x02C0)
class AFortAthenaMutator_PlayerSpawnPod final : public AFortAthenaMutator
{
public:
	TMulticastInlineDelegate<void(class AFortPlayerPawnAthena* Pawn)> OnPawnEjectedFromPod;          // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPlayerSpawnPodData& PodData)> OnPodLanded;           // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x30];                                     // 0x02E0(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class AActor>                     PodClass;                                          // 0x0310(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  AllowNativeActionsInPod;                           // 0x0318(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            DuringStasisEffectClass;                           // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockAbilityTagsInStasis;                          // 0x0340(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PreLaunchDelay;                                    // 0x0360(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FallDuration;                                      // 0x0388(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RouteYawCenter;                                    // 0x03B0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RouteYawDeviation;                                 // 0x03D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RouteMinXYDistancePercent;                         // 0x0400(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RouteMaxXYDistancePercent;                         // 0x0428(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StartAltitude;                                     // 0x0450(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StartAltitudeDeviation;                            // 0x0478(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EndLocationUpperTraceOffset;                       // 0x04A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EndLocationLowerTraceOffset;                       // 0x04C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EjectPawnYawSpread;                                // 0x04F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EjectPawnPitch;                                    // 0x0518(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EjectPawnImpulseMagnitude;                         // 0x0540(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CanToggleCursorModeInStasis;                       // 0x0568(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           ActionsToAllowToggleCursorModeInStasis;            // 0x0590(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FPlayerSpawnPodData>            PodDataArray;                                      // 0x05A0(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortAbilitySystemComponent*>    BlockedAbilitySystemComponents;                    // 0x05B0(0x0010)(ExportObject, Net, ZeroConstructor, RepNotify, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortAbilitySystemComponent*>    PreviousBlockedAbilitySystemComponents;            // 0x05C0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D0[0x8];                                      // 0x05D0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortRespawnLogicData                  TeamTeleportLogicData;                             // 0x05D8(0x0140)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_SynchronizedTeleport* TeleportMutator;                                  // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class AActor>                     ViewTargetClass;                                   // 0x0720(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCameraMode>            PawnFallingCameraMode;                             // 0x0728(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool GetPodDataForActor(const class AActor* Actor, struct FPlayerSpawnPodData* OutPodData, const class FString& ContextString);
	bool GetPodDataForID(const int32 ID, struct FPlayerSpawnPodData* OutPodData, const class FString& ContextString);
	void HandlePodLanded(class UActorComponent* InComponent);
	void OnAllTeleportComplete();
	void OnPodDestroyed(class AActor* DestroyedActor);
	void OnRep_BlockedAbilitySystemComponents();
	void OnSingleTeleportComplete(class AFortPlayerStateAthena* PlayerState);
	void SetViewTarget(class AFortPlayerControllerAthena* Controller, class AActor* ViewTarget, const struct FViewTargetTransitionParams& ViewTargetTransitionParams, const bool bDestroyOldViewTarget);

	float GetFallDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_PlayerSpawnPod">();
	}
	static class AFortAthenaMutator_PlayerSpawnPod* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_PlayerSpawnPod>();
	}
};

}

