#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PhosphorusRuntime

#include "Basic.hpp"

#include "PhosphorusRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.AudioFadeChangeEvent
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Phosphorus_AudioFadeChangeEvent final
{
public:
	bool                                          bFadeOut;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         FadeTime;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetCachedStormMutator
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetCachedStormMutator final
{
public:
	class AFortAthenaMutator_CustomStormMovement* ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetTeamMVP
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetTeamMVP final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerStateAthena*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.HandlePawnStormStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Phosphorus_HandlePawnStormStatusChanged final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInSafeZone;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.OnPawnEjectedFromPod
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Phosphorus_OnPawnEjectedFromPod final
{
public:
	class AFortPlayerPawnAthena*                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetLeadingTeamNums
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetLeadingTeamNums final
{
public:
	TArray<uint8>                                 LeadingTeamNums;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetNumAliveTeams
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetNumAliveTeams final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetNumValidTeams
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetNumValidTeams final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetRoundWinningTeamNum
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetRoundWinningTeamNum final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetTeamDataArray
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetTeamDataArray final
{
public:
	TArray<struct FPhosphorusTeamData>            OutTeamDataArray;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustBeValid;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustBeAlive;                                      // 0x0011(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSortByScore;                                      // 0x0012(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetTeamDataCopy
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetTeamDataCopy final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPhosphorusTeamData                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.GetTeamSize
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Phosphorus_GetTeamSize final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.IsOnWinningTeam
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Phosphorus_IsOnWinningTeam final
{
public:
	const class AFortPlayerPawnAthena*            Pawn;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.IsTeamAlive
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_Phosphorus_IsTeamAlive final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_Phosphorus.IsTeamValid
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_Phosphorus_IsTeamValid final
{
public:
	uint8                                         TeamNum;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortCheatManager_Phosphorus.PhosphorusDebug
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Phosphorus_PhosphorusDebug final
{
public:
	float                                         TextScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortCheatManager_Phosphorus.PhosphorusSetNumRoundsToWin
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Phosphorus_PhosphorusSetNumRoundsToWin final
{
public:
	int32                                         NumRounds;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortCheatManager_PlayerSpawnPod.PlayerSpawnPodDebug
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_PlayerSpawnPod_PlayerSpawnPodDebug final
{
public:
	float                                         TextScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod.GetPodDataForActor
// 0x00D8 (0x00D8 - 0x0000)
struct FortAthenaMutator_PlayerSpawnPod_GetPodDataForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerSpawnPodData                    OutPodData;                                        // 0x0008(0x00B8)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 ContextString;                                     // 0x00C0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod.GetPodDataForID
// 0x00D8 (0x00D8 - 0x0000)
struct FortAthenaMutator_PlayerSpawnPod_GetPodDataForID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPlayerSpawnPodData                    OutPodData;                                        // 0x0008(0x00B8)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 ContextString;                                     // 0x00C0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod.HandlePodLanded
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_PlayerSpawnPod_HandlePodLanded final
{
public:
	class UActorComponent*                        InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod.OnPodDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_PlayerSpawnPod_OnPodDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod.OnSingleTeleportComplete
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_PlayerSpawnPod_OnSingleTeleportComplete final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod.SetViewTarget
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_PlayerSpawnPod_SetViewTarget final
{
public:
	class AFortPlayerControllerAthena*            Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ViewTarget;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FViewTargetTransitionParams            ViewTargetTransitionParams;                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDestroyOldViewTarget;                             // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function PhosphorusRuntime.FortAthenaMutator_PlayerSpawnPod.GetFallDuration
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_PlayerSpawnPod_GetFallDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

