#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Playspace_PlayspaceComponent

#include "Basic.hpp"

#include "Playspace_PlayerType_structs.hpp"


namespace SDK::Params
{

// Function Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForSetupComplete.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_PlayspaceComponent_WaitForSetupComplete_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForMatchEnd.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_PlayspaceComponent_WaitForMatchEnd_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Playspace_PlayspaceComponent.PlayspaceComponent.GetPlayerCount
// 0x0008 (0x0008 - 0x0000)
struct PlayspaceComponent_GetPlayerCount final
{
public:
	EPlayerType                                   __verse_0x0F99A7FE_type;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Playspace_PlayspaceComponent.PlayspaceComponent.getPlayers
// 0x0018 (0x0018 - 0x0000)
struct PlayspaceComponent_getPlayers final
{
public:
	EPlayerType                                   __verse_0x0F99A7FE_type;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UPlayerComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function Playspace_PlayspaceComponent.PlayspaceComponent.setQueueUserForRespawnWhenAdded
// 0x0001 (0x0001 - 0x0000)
struct PlayspaceComponent_setQueueUserForRespawnWhenAdded final
{
public:
	uint8                                         __verse_0xD0767376_spawnWhenAdded : 1;             // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};

// Function Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForMatchStart.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_PlayspaceComponent_WaitForMatchStart_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForPlayerAdded.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_PlayspaceComponent_WaitForPlayerAdded_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForPlayerRemoved.Update
// 0x0004 (0x0004 - 0x0000)
struct Context_PlayspaceComponent_WaitForPlayerRemoved_Update final
{
public:
	int32                                         RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

