#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Playspace_PlayspaceComponent

#include "Basic.hpp"

#include "Playspace_PlayerType_structs.hpp"
#include "Interop_CoroutineContext_classes.hpp"
#include "EntityCore_classes.hpp"


namespace SDK
{

// SolarisGeneratedClass Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForSetupComplete
// 0x0008 (0x00A0 - 0x0098)
class UContext_PlayspaceComponent_WaitForSetupComplete final : public UCoroutineContext
{
public:
	class Playspace_PlayspaceComponent::UPlayspaceComponent* _Self;                                  // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_PlayspaceComponent_WaitForSetupComplete">();
	}
	static class UContext_PlayspaceComponent_WaitForSetupComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_PlayspaceComponent_WaitForSetupComplete>();
	}
};

// SolarisGeneratedClass Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForMatchEnd
// 0x0008 (0x00A0 - 0x0098)
class UContext_PlayspaceComponent_WaitForMatchEnd final : public UCoroutineContext
{
public:
	class Playspace_PlayspaceComponent::UPlayspaceComponent* _Self;                                  // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_PlayspaceComponent_WaitForMatchEnd">();
	}
	static class UContext_PlayspaceComponent_WaitForMatchEnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_PlayspaceComponent_WaitForMatchEnd>();
	}
};

// SolarisGeneratedClass Playspace_PlayspaceComponent.PlayspaceComponent
// 0x0038 (0x0098 - 0x0060)
class Playspace_PlayspaceComponent::UPlayspaceComponent : public UEntityComponent
{
public:
	uint8                                         Pad_60[0x38];                                      // 0x0060(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void _InitCDO();
	void _InitInstance();
	int32 GetPlayerCount(EPlayerType __verse_0x0F99A7FE_type);
	TArray<class UPlayerComponent*> getPlayers(EPlayerType __verse_0x0F99A7FE_type);
	void setQueueUserForRespawnWhenAdded(uint8 __verse_0xD0767376_spawnWhenAdded);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolarisGeneratedClass Playspace_PlayspaceComponent.PlayspaceComponent", true>();
	}
	static class Playspace_PlayspaceComponent::UPlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<Playspace_PlayspaceComponent::UPlayspaceComponent>();
	}
};

// SolarisGeneratedClass Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForMatchStart
// 0x0008 (0x00A0 - 0x0098)
class UContext_PlayspaceComponent_WaitForMatchStart final : public UCoroutineContext
{
public:
	class Playspace_PlayspaceComponent::UPlayspaceComponent* _Self;                                  // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_PlayspaceComponent_WaitForMatchStart">();
	}
	static class UContext_PlayspaceComponent_WaitForMatchStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_PlayspaceComponent_WaitForMatchStart>();
	}
};

// SolarisGeneratedClass Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForPlayerAdded
// 0x0010 (0x00A8 - 0x0098)
class UContext_PlayspaceComponent_WaitForPlayerAdded final : public UCoroutineContext
{
public:
	class Playspace_PlayspaceComponent::UPlayspaceComponent* _Self;                                  // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerComponent*                       _RetVal;                                           // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_PlayspaceComponent_WaitForPlayerAdded">();
	}
	static class UContext_PlayspaceComponent_WaitForPlayerAdded* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_PlayspaceComponent_WaitForPlayerAdded>();
	}
};

// SolarisGeneratedClass Playspace_PlayspaceComponent.Context_PlayspaceComponent_WaitForPlayerRemoved
// 0x0010 (0x00A8 - 0x0098)
class UContext_PlayspaceComponent_WaitForPlayerRemoved final : public UCoroutineContext
{
public:
	class Playspace_PlayspaceComponent::UPlayspaceComponent* _Self;                                  // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerComponent*                       _RetVal;                                           // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_PlayspaceComponent_WaitForPlayerRemoved">();
	}
	static class UContext_PlayspaceComponent_WaitForPlayerRemoved* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_PlayspaceComponent_WaitForPlayerRemoved>();
	}
};

}

