#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: QuartzMusicTrackComponent_DataTracker

#include "Basic.hpp"

#include "E_DataTrackerTagTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "DataTrackerParameterData_structs.hpp"
#include "QuartzMusicTrackComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QuartzMusicTrackComponent_DataTracker.QuartzMusicTrackComponent_DataTracker_C
// 0x0058 (0x01B8 - 0x0160)
#pragma pack(push, 0x1)
class alignas(0x08) UQuartzMusicTrackComponent_DataTracker_C : public UQuartzMusicTrackComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_QuartzMusicTrackComponent_DataTracker_C; // 0x0160(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 DataTrackerClass;                                  // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayDataTrackerComponentManager* DataTrackerManager;                              // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDataTrackerAssigned;                              // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortGameplayDataTrackerComponent*      DataTrackerComponent;                              // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAwaitingCooldownBeforeShutoff;                    // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         UpdateFrequency;                                   // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTrackerParameterData>      DataTrackerParameters;                             // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bHasFiredOffDataTrackerParameterWarning;           // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundMix*                              DataTrackerSoundMix;                               // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSoundMixActive;                                   // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_QuartzMusicTrackComponent_DataTracker(int32 EntryPoint);
	void Retry_Get_Data_Tracker_Manager();
	void ReceiveBeginPlay();
	void OnReady_EAA166EB4AA20B4778C921B5F15F1C62(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void On_Changed_Has_Any_Event_Value(class UFortGameplayDataTrackerComponent* DataTrackerComponent_0, bool bHasEventValues);
	void OnDataTrackerComponentRegistered(class UFortGameplayDataTrackerComponent* RegisteredDataTracker);
	void DataTrackerStart_Internal();
	void DataTrackerUpdate_Internal();
	void DataTrackerStop_Internal();
	void OnDataTrackerStart();
	void OnDataTrackerUpdate();
	void OnDataTrackerStop();
	void GetDataTrackerComponent(class UFortGameplayDataTrackerComponent** DataTracker);
	void GetDataTrackerParameterValue(int32 Index_0, float* Value);
	void GetDataTrackerParameterValueTotal(float* Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuartzMusicTrackComponent_DataTracker_C">();
	}
	static class UQuartzMusicTrackComponent_DataTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuartzMusicTrackComponent_DataTracker_C>();
	}
};
#pragma pack(pop)

}

