#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ScoreRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum ScoreRuntime.EScoreLTMBonusWindowCategory
// NumValues: 0x000C
enum class EScoreLTMBonusWindowCategory : uint8
{
	None                                     = 0,
	Eliminations                             = 1,
	Chests                                   = 2,
	AmmoCans                                 = 3,
	SupplyDrops                              = 4,
	SupplyLlamas                             = 5,
	ForagedItems                             = 6,
	Coins                                    = 7,
	Fishing                                  = 8,
	Boxes                                    = 9,
	Safes                                    = 10,
	EScoreLTMBonusWindowCategory_MAX         = 11,
};

// Enum ScoreRuntime.EScoreLTMScoreEvent
// NumValues: 0x0012
enum class EScoreLTMScoreEvent : uint8
{
	None                                     = 0,
	Elimination                              = 1,
	ChestOpened                              = 2,
	AmmoCanOpened                            = 3,
	SupplyDropOpened                         = 4,
	SupplyLlamaOpened                        = 5,
	ForagedItemConsumed                      = 6,
	CollectedCoinBronze                      = 7,
	CollectedCoinSilver                      = 8,
	CollectedCoinGold                        = 9,
	CaughtItemInFishingPool                  = 10,
	CaughtItemInOpenWater                    = 11,
	BoxOpened                                = 12,
	SafeOpened                               = 13,
	BossEliminated                           = 14,
	GuardEliminated                          = 15,
	SharkEliminated                          = 16,
	MAX                                      = 17,
};

// ScriptStruct ScoreRuntime.ScoreLTMBonusWindowCategoryData
// 0x0058 (0x0058 - 0x0000)
struct FScoreLTMBonusWindowCategoryData final
{
public:
	EScoreLTMBonusWindowCategory                  Category;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<EScoreLTMScoreEvent>                   ScoreEvents;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ScoreMultiplier;                                   // 0x0018(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   CategoryText;                                      // 0x0040(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct ScoreRuntime.ScoreLTMBonusWindow
// 0x000C (0x000C - 0x0000)
struct FScoreLTMBonusWindow final
{
public:
	EScoreLTMBonusWindowCategory                  Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ServerPreviewEndTime;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerEndTime;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ScoreRuntime.ScoreLTMCoinSpawnMessageData
// 0x0028 (0x0028 - 0x0000)
struct FScoreLTMCoinSpawnMessageData final
{
public:
	EScoreLTMScoreEvent                           CoinType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   GameMsgText;                                       // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortLevelSpawnActor>       CoinClass;                                         // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ScoreRuntime.ScoreLTMTeamDataEntry
// 0x0074 (0x0080 - 0x000C)
struct FScoreLTMTeamDataEntry final : public FFastArraySerializerItem
{
public:
	int32                                         TeamId;                                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScoreLTMScoreEvent                           LatestScoreEvent;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerStateAthena*                 LatestScoringPlayer;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LatestScoreAwarded;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasLatestScoreBonus;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         TeamScore;                                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<EScoreLTMScoreEvent, int32>              EventToScoreMap;                                   // 0x0030(0x0050)(RepSkip, NativeAccessSpecifierPublic)
};

// ScriptStruct ScoreRuntime.ScoreLTMTeamDataArray
// 0x0018 (0x0120 - 0x0108)
struct FScoreLTMTeamDataArray final : public FFastArraySerializer
{
public:
	TArray<struct FScoreLTMTeamDataEntry>         Entries;                                           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct ScoreRuntime.ScoreLTMScoreEventData
// 0x0068 (0x0068 - 0x0000)
struct FScoreLTMScoreEventData final
{
public:
	EScoreLTMScoreEvent                           ScoreEvent;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   ScoreNameText;                                     // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  EventInclusionTags;                                // 0x0020(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ScoreAwarded;                                      // 0x0040(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

