#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SmartObjectsModule.ESmartObjectTagPolicy
// NumValues: 0x0003
enum class ESmartObjectTagPolicy : uint8
{
	Any                                      = 0,
	All                                      = 1,
	MAX                                      = 2,
};

// Enum SmartObjectsModule.ESOReferenceDrawingMode
// NumValues: 0x0003
enum class ESOReferenceDrawingMode : uint8
{
	Default                                  = 0,
	Sequence                                 = 1,
	MAX                                      = 2,
};

// Enum SmartObjectsModule.ESmartObjectRequiredTagsPolicy
// NumValues: 0x0006
enum class ESmartObjectRequiredTagsPolicy : uint8
{
	RequireAny                               = 0,
	RequireAnyExact                          = 1,
	RequireAll                               = 2,
	RequireAllExact                          = 3,
	RequireNone                              = 4,
	ESmartObjectRequiredTagsPolicy_MAX       = 5,
};

// Enum SmartObjectsModule.ESmartObjectSlotState
// NumValues: 0x0004
enum class ESmartObjectSlotState : uint8
{
	Free                                     = 0,
	Claimed                                  = 1,
	Occupied                                 = 2,
	MAX                                      = 3,
};

// ScriptStruct SmartObjectsModule.SmartObjectSlot
// 0x0020 (0x0020 - 0x0000)
struct FSmartObjectSlot final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x000C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayBehaviorConfig*                BehaviorConfig;                                    // 0x0018(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectUseConfig
// 0x00D0 (0x00D0 - 0x0000)
struct FSmartObjectUseConfig final
{
public:
	struct FGameplayTagQuery                      AvatarTagFilter;                                   // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ObjectTagFilter;                                   // 0x0048(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActivityTags;                                      // 0x0090(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FSmartObjectSlot>               Slots;                                             // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayBehaviorConfig*                DefaultBehavior;                                   // 0x00C0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxConcurrentUsers;                                // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DefaultExecutionPriority;                          // 0x00CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectExecutionSlot
// 0x0020 (0x0020 - 0x0000)
struct FSmartObjectExecutionSlot final
{
public:
	ESmartObjectSlotState                         State;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 UserAvatar;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayBehavior*                      AssignedBehavior;                                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SlotIndex;                                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectUse
// 0x0030 (0x0030 - 0x0000)
struct FSmartObjectUse final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSmartObjectExecutionSlot              Slot;                                              // 0x0008(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectRuntime
// 0x0028 (0x0028 - 0x0000)
struct FSmartObjectRuntime final
{
public:
	class USmartObjectComponent*                  SOComponent;                                       // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IRichSmartObjectInterface> AsRichSO;                                      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FSmartObjectUse>                ActiveUses;                                        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectID
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FSmartObjectID final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

