#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SocialUMG.SocialChatContainer.DynamicHandleMessageTextCommitted
// 0x0020 (0x0020 - 0x0000)
struct SocialChatContainer_DynamicHandleMessageTextCommitted final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function SocialUMG.SocialChatContainer.OnChatOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialChatContainer_OnChatOpenChanged final
{
public:
	bool                                          bShouldBeOpen;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialChatMessageEntry.CanInteract
// 0x0001 (0x0001 - 0x0000)
struct SocialChatMessageEntry_CanInteract final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialGroupListEntry.HandleGetMenuContent
// 0x0008 (0x0008 - 0x0000)
struct SocialGroupListEntry_HandleGetMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialInteractionButton.GetInteractionName
// 0x0008 (0x0008 - 0x0000)
struct SocialInteractionButton_GetInteractionName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialInteractionButton.IsPlatformOnlyFriend
// 0x0001 (0x0001 - 0x0000)
struct SocialInteractionButton_IsPlatformOnlyFriend final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialActionMenu.HandleMenuAnchorOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialActionMenu_HandleMenuAnchorOpenChanged final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialInteractionMenu.OnToggleConfirmation
// 0x0001 (0x0001 - 0x0000)
struct SocialInteractionMenu_OnToggleConfirmation final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialInteractionMenu.GetFirstEntryToCenter
// 0x0008 (0x0008 - 0x0000)
struct SocialInteractionMenu_GetFirstEntryToCenter final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialListInteractableEntryBase.HandleGetMenuContent
// 0x0008 (0x0008 - 0x0000)
struct SocialListInteractableEntryBase_HandleGetMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SocialUMG.SocialListInteractableEntryBase.HandleMenuOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialListInteractableEntryBase_HandleMenuOpenChanged final
{
public:
	bool                                          bIsMenuOpen;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

