#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SoundCueTemplates

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum SoundCueTemplates.ESoundContainerType
// NumValues: 0x0004
enum class ESoundContainerType : uint8
{
	Concatenate                              = 0,
	Randomize                                = 1,
	Mix                                      = 2,
	ESoundContainerType_MAX                  = 3,
};

// ScriptStruct SoundCueTemplates.SoundCueCrossfadeInfo
// 0x0020 (0x0020 - 0x0000)
struct FSoundCueCrossfadeInfo final
{
public:
	struct FDistanceDatum                         DistanceInfo;                                      // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundWave*                             Sound;                                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SoundCueTemplates.SoundCueTemplateQualitySettings
// 0x0028 (0x0028 - 0x0000)
struct FSoundCueTemplateQualitySettings final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(Edit, EditConst, NativeAccessSpecifierPublic)
	int32                                         MaxConcatenatedVariations;                         // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxRandomizedVariations;                           // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMixVariations;                                  // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

