#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SrirachaRanch

#include "Basic.hpp"


namespace SDK
{

// Enum SrirachaRanch.EOnlineRadioSourceType
// NumValues: 0x0002
enum class EOnlineRadioSourceType : uint8
{
	Epic                                     = 0,
	EOnlineRadioSourceType_MAX               = 1,
};

// Enum SrirachaRanch.ERadioSource
// NumValues: 0x0003
enum class ERadioSource : uint8
{
	Invalid                                  = 0,
	Vehicle                                  = 1,
	ERadioSource_MAX                         = 2,
};

// Enum SrirachaRanch.EStreamingRadioSourceState
// NumValues: 0x0006
enum class EStreamingRadioSourceState : uint8
{
	None                                     = 0,
	Loading                                  = 1,
	LoadingPlayer                            = 2,
	LoadedPlayer                             = 3,
	Playing                                  = 4,
	EStreamingRadioSourceState_MAX           = 5,
};

// ScriptStruct SrirachaRanch.SrirachaInputMappingData
// 0x0028 (0x0028 - 0x0000)
struct FSrirachaInputMappingData final
{
public:
	class FName                                   MainActionName;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GamepadActionName;                                 // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0010(0x0018)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct SrirachaRanch.AthenaRadioStation
// 0x0038 (0x0038 - 0x0000)
struct FAthenaRadioStation final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 StationImage;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ResourceID;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SrirachaRanch.StreamingRadioSourceData
// 0x0048 (0x0048 - 0x0000)
struct FStreamingRadioSourceData final
{
public:
	EStreamingRadioSourceState                    State;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         PlayingIndex;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeoutSeconds;                                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAthenaRadioStation                    SourceOverride;                                    // 0x0010(0x0038)(NativeAccessSpecifierPublic)
};

// ScriptStruct SrirachaRanch.SrirachaPerClassSpecialSeats
// 0x0010 (0x0010 - 0x0000)
struct FSrirachaPerClassSpecialSeats final
{
public:
	TArray<int32>                                 OutsideSeatIndices;                                // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

