#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "SrirachaRanch_structs.hpp"


namespace SDK::Params
{

// Function SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio.HandleRadioPlaying
// 0x0040 (0x0040 - 0x0000)
struct FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0038)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio.HandleRadioStopped
// 0x0040 (0x0040 - 0x0000)
struct FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0038)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnFailedToOpenSource
// 0x0040 (0x0040 - 0x0000)
struct RadioPlayerWidgetBase_OnFailedToOpenSource final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0038)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnLoadingNewSource
// 0x0040 (0x0040 - 0x0000)
struct RadioPlayerWidgetBase_OnLoadingNewSource final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0038)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnRadioStopped
// 0x0040 (0x0040 - 0x0000)
struct RadioPlayerWidgetBase_OnRadioStopped final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    LastSource;                                        // 0x0008(0x0038)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnSourceFinished
// 0x0040 (0x0040 - 0x0000)
struct RadioPlayerWidgetBase_OnSourceFinished final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0038)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnSourcePlaying
// 0x0040 (0x0040 - 0x0000)
struct RadioPlayerWidgetBase_OnSourcePlaying final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0038)(Parm, NativeAccessSpecifierPublic)
};

// Function SrirachaRanchUI.RadioPlayerWidgetBase.SetControllable
// 0x0001 (0x0001 - 0x0000)
struct RadioPlayerWidgetBase_SetControllable final
{
public:
	bool                                          bCanControl;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

