#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Struct_NPC_TargetSlots

#include "Basic.hpp"

#include "Enum_NPC_TargetSlots_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_NPC_TargetSlots.Struct_NPC_TargetSlots
// 0x0078 (0x0078 - 0x0000)
struct FStruct_NPC_TargetSlots final
{
public:
	Enum_NPC_TargetSlots                          TargetSlotType_6_B268C50140F4F849CE916EA5DB4A30E7; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 TargetSlotCountingGE_7_F6007B01441781AB71302C91A1C4CFD2; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         AITargetSlotSizeHF_8_E81162534B067D58D70AE9AC8B4B1F98; // 0x0010(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         AITargetSlotDurationHF_14_A9B6ED4D4072D7BB507AA5A14118FA5B; // 0x0038(0x0028)(Edit, BlueprintVisible)
	class UClass*                                 TargetSlotOverrideGE_11_6C40525043B50B2B696580B362A65DB3; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TargetSlotOwnerGE_17_19F50D8848750D3BC118D9BBD861CAA1; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TargetSlotCountingMaxedGE_19_BF1E1EF24CCA642F87D4379BB916F271; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

