#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: TargetingSystem

#include "Basic.hpp"

#include "TargetingSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class TargetingSystem.TargetingTask
// 0x0000 (0x0028 - 0x0028)
class UTargetingTask : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingTask">();
	}
	static class UTargetingTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingTask>();
	}
};

// Class TargetingSystem.TargetingFilterTask_BasicFilterTemplate
// 0x0000 (0x0028 - 0x0028)
class UTargetingFilterTask_BasicFilterTemplate : public UTargetingTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_BasicFilterTemplate">();
	}
	static class UTargetingFilterTask_BasicFilterTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_BasicFilterTemplate>();
	}
};

// Class TargetingSystem.TargetingFilterTask_ActorClass
// 0x0020 (0x0048 - 0x0028)
class UTargetingFilterTask_ActorClass final : public UTargetingFilterTask_BasicFilterTemplate
{
public:
	TArray<class UClass*>                         RequiredActorClassFilters;                         // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UClass*>                         IgnoredActorClassFilters;                          // 0x0038(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_ActorClass">();
	}
	static class UTargetingFilterTask_ActorClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_ActorClass>();
	}
};

// Class TargetingSystem.TargetingFilterTask_SortByDistance
// 0x0008 (0x0030 - 0x0028)
class UTargetingFilterTask_SortByDistance final : public UTargetingTask
{
public:
	uint8                                         bAscending : 1;                                    // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_SortByDistance">();
	}
	static class UTargetingFilterTask_SortByDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_SortByDistance>();
	}
};

// Class TargetingSystem.TargetingPreset
// 0x0010 (0x0040 - 0x0030)
class UTargetingPreset final : public UDataAsset
{
public:
	struct FTargetingTaskSet                      TargetingTaskSet;                                  // 0x0030(0x0010)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingPreset">();
	}
	static class UTargetingPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingPreset>();
	}
};

// Class TargetingSystem.TargetingSelectionTask_AOE
// 0x0030 (0x0058 - 0x0028)
class UTargetingSelectionTask_AOE final : public UTargetingTask
{
public:
	ETargetingAOEShape                            ShapeType;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             CollisionChannel;                                  // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCollisionProfileName                  CollisionProfileName;                              // 0x002C(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIgnoreSourceActor : 1;                            // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIgnoreInstigatorActor : 1;                        // 0x0034(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                HalfExtent;                                        // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Radius;                                            // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HalfHeight;                                        // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ComponentTag;                                      // 0x004C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	struct FVector GetSourceLocation(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FVector GetSourceOffset(const struct FTargetingRequestHandle& TargetingHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_AOE">();
	}
	static class UTargetingSelectionTask_AOE* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_AOE>();
	}
};

// Class TargetingSystem.TargetingSelectionTask_SourceActor
// 0x0000 (0x0028 - 0x0028)
class UTargetingSelectionTask_SourceActor final : public UTargetingTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_SourceActor">();
	}
	static class UTargetingSelectionTask_SourceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_SourceActor>();
	}
};

// Class TargetingSystem.TargetingSelectionTask_Trace
// 0x0030 (0x0058 - 0x0028)
class UTargetingSelectionTask_Trace final : public UTargetingTask
{
public:
	ETargetingTraceType                           TraceType;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCollisionProfileName                  CollisionProfileName;                              // 0x002C(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         DefaultSweptTraceRadius;                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DefaultTraceLength;                                // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DefaultSourceOffset;                               // 0x003C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ExplicitTraceDirection;                            // 0x0048(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bComplexTrace : 1;                                 // 0x0054(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIgnoreSourceActor : 1;                            // 0x0054(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIgnoreInstigatorActor : 1;                        // 0x0054(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	struct FVector GetSourceLocation(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FVector GetSourceOffset(const struct FTargetingRequestHandle& TargetingHandle) const;
	float GetSweptTraceRadius(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FVector GetTraceDirection(const struct FTargetingRequestHandle& TargetingHandle) const;
	float GetTraceLength(const struct FTargetingRequestHandle& TargetingHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_Trace">();
	}
	static class UTargetingSelectionTask_Trace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_Trace>();
	}
};

// Class TargetingSystem.TargetingSubsystem
// 0x0020 (0x0050 - 0x0030)
class UTargetingSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FTargetingRequestHandle>        AsyncTargetingRequests;                            // 0x0040(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static void GetTargetingResultsActors(const struct FTargetingRequestHandle& TargetingHandle, TArray<class AActor*>* Targets);
	static struct FTargetingSourceContext GetTargetingSourceContext(const struct FTargetingRequestHandle& TargetingHandle);

	void StartAsyncTargetingRequest(const class UTargetingPreset* TargetingPreset, const struct FTargetingSourceContext& InSourceContext, TDelegate<void(const struct FTargetingRequestHandle& TargetingRequestHandle)> CompletionDynamicDelegate);

	void ExecuteTargetingRequest(const class UTargetingPreset* TargetingPreset, const struct FTargetingSourceContext& InSourceContext, TDelegate<void(const struct FTargetingRequestHandle& TargetingRequestHandle)> CompletionDynamicDelegate) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSubsystem">();
	}
	static class UTargetingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSubsystem>();
	}
};

}

