#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: TargetingSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum TargetingSystem.ETargetingAOEShape
// NumValues: 0x0006
enum class ETargetingAOEShape : uint8
{
	Box                                      = 0,
	Cylinder                                 = 1,
	Sphere                                   = 2,
	Capsule                                  = 3,
	SourceComponent                          = 4,
	ETargetingAOEShape_MAX                   = 5,
};

// Enum TargetingSystem.ETargetingTraceType
// NumValues: 0x0003
enum class ETargetingTraceType : uint8
{
	Line                                     = 0,
	Sweep                                    = 1,
	ETargetingTraceType_MAX                  = 2,
};

// ScriptStruct TargetingSystem.TargetingTaskSet
// 0x0010 (0x0010 - 0x0000)
struct FTargetingTaskSet final
{
public:
	TArray<class UTargetingTask*>                 Tasks;                                             // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TargetingSystem.TargetingRequestHandle
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FTargetingRequestHandle final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TargetingSystem.TargetingDebugData
// 0x0001 (0x0001 - 0x0000)
struct FTargetingDebugData final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TargetingSystem.TargetingAsyncTaskData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTargetingAsyncTaskData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TargetingSystem.TargetingRequestData
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FTargetingRequestData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void(const struct FTargetingRequestHandle& TargetingRequestHandle)> TargetingRequestDynamicDelegate; // 0x0018(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct TargetingSystem.TargetingSourceContext
// 0x0028 (0x0028 - 0x0000)
struct FTargetingSourceContext final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InstigatorActor;                                   // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SourceLocation;                                    // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceSocketName;                                  // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TargetingSystem.TargetingDefaultResultData
// 0x0090 (0x0090 - 0x0000)
struct FTargetingDefaultResultData final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TargetingSystem.TargetingDefaultResultsSet
// 0x0010 (0x0010 - 0x0000)
struct FTargetingDefaultResultsSet final
{
public:
	TArray<struct FTargetingDefaultResultData>    TargetResults;                                     // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

