#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VendettaRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum VendettaRuntime.EVendettaHuntedStatus
// NumValues: 0x0004
enum class EVendettaHuntedStatus : uint8
{
	NotHunted                                = 0,
	Hunted_Far                               = 1,
	Hunted_Near                              = 2,
	EVendettaHuntedStatus_MAX                = 3,
};

// ScriptStruct VendettaRuntime.WaxPickupSpawnRequestData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FWaxPickupSpawnRequestData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VendettaRuntime.VendettaEQSQueryData
// 0x0030 (0x0030 - 0x0000)
struct FVendettaEQSQueryData final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ParameterValue;                                    // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct VendettaRuntime.VendettaReplicatedUIMessage
// 0x0020 (0x0020 - 0x0000)
struct FVendettaReplicatedUIMessage final
{
public:
	int32                                         IndexToUpdate;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   TextToDisplay;                                     // 0x0008(0x0018)(NativeAccessSpecifierPublic)
};

// ScriptStruct VendettaRuntime.VendettaBountyPuckTargetData
// 0x0034 (0x0040 - 0x000C)
struct FVendettaBountyPuckTargetData final : public FFastArraySerializerItem
{
public:
	struct FGuid                                  TrackerGuid;                                       // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerStateAthena*                 TargetPlayerState;                                 // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 OwnerPlayerState;                                  // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusReward;                                       // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortRarity                                   Rarity;                                            // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UBountyPuckWeaponComponent*             BountyPuckWeaponComponent;                         // 0x0038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VendettaRuntime.VendettaBountyPuckTargetingDataArray
// 0x0010 (0x0118 - 0x0108)
struct FVendettaBountyPuckTargetingDataArray final : public FFastArraySerializer
{
public:
	TArray<struct FVendettaBountyPuckTargetData>  Entries;                                           // 0x0108(0x0010)(ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VendettaRuntime.VendettaBountyPuckRarityData
// 0x0058 (0x0058 - 0x0000)
struct FVendettaBountyPuckRarityData final
{
public:
	struct FScalableFloat                         MinRewardValue;                                    // 0x0000(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxRewardValue;                                    // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EFortRarity                                   Rarity;                                            // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VendettaRuntime.VendettaPlayerData
// 0x0010 (0x0010 - 0x0000)
struct FVendettaPlayerData final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastPlayerSpawnTime;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VendettaRuntime.VendettaActiveBountyTargetData
// 0x0014 (0x0020 - 0x000C)
struct FVendettaActiveBountyTargetData final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerStateAthena*                 BountyOwningPlayerState;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BountyTargetLocation2D;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VendettaRuntime.VendettaActiveBountyTargetDataArray
// 0x0010 (0x0118 - 0x0108)
struct FVendettaActiveBountyTargetDataArray final : public FFastArraySerializer
{
public:
	TArray<struct FVendettaActiveBountyTargetData> Entries;                                          // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VendettaRuntime.VendettaTargetMarkedStatusData
// 0x0002 (0x0002 - 0x0000)
struct FVendettaTargetMarkedStatusData final
{
public:
	bool                                          bIsTargetMarked;                                   // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsResultOfScan;                                   // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VendettaRuntime.VendettaPlayerHuntedStatus
// 0x0014 (0x0020 - 0x000C)
struct FVendettaPlayerHuntedStatus final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVendettaHuntedStatus                         HuntedStatusReplicated;                            // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVendettaHuntedStatus                         MasterHunterHuntedStatusReplicated;                // 0x0019(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVendettaHuntedStatus                         HuntedStatusLocal;                                 // 0x001A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVendettaHuntedStatus                         MasterHunterHuntedStatusLocal;                     // 0x001B(0x0001)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VendettaRuntime.VendettaPlayerHuntedStatusArray
// 0x0010 (0x0118 - 0x0108)
struct FVendettaPlayerHuntedStatusArray final : public FFastArraySerializer
{
public:
	TArray<struct FVendettaPlayerHuntedStatus>    Entries;                                           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

