#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VendettaUI

#include "Basic.hpp"

#include "VendettaRuntime_structs.hpp"


namespace SDK::Params
{

// Function VendettaUI.VendettaCreditsEarnedMessageWidget.OnPlayerEliminatedBountyTarget
// 0x0020 (0x0020 - 0x0000)
struct VendettaCreditsEarnedMessageWidget_OnPlayerEliminatedBountyTarget final
{
public:
	const class AFortPlayerStateAthena*           VictimPlayerState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerStateAthena*           KillerPlayerState;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerStateAthena*           NewTargetPlayerState;                              // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VictimRewardValue;                                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VictimBonusValue;                                  // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VendettaUI.VendettaCreditsEarnedMessageWidget.OnPlayerEliminatedBountyTarget_BP
// 0x0020 (0x0020 - 0x0000)
struct VendettaCreditsEarnedMessageWidget_OnPlayerEliminatedBountyTarget_BP final
{
public:
	const class AFortPlayerStateAthena*           VictimPlayerState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerStateAthena*           KillerPlayerState;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerStateAthena*           NewTargetPlayerState;                              // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VictimRewardValue;                                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VictimBonusValue;                                  // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VendettaUI.VendettaSquadmateHuntedStatusWidget.OnPlayerHuntedStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct VendettaSquadmateHuntedStatusWidget_OnPlayerHuntedStatusChanged final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVendettaHuntedStatus                         HuntedStatus;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVendettaHuntedStatus                         SpecialNPCHuntedStatus;                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function VendettaUI.VendettaSquadmateHuntedStatusWidget.OnPlayerHuntedStatusChanged_BP
// 0x0002 (0x0002 - 0x0000)
struct VendettaSquadmateHuntedStatusWidget_OnPlayerHuntedStatusChanged_BP final
{
public:
	EVendettaHuntedStatus                         HuntedStatus;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVendettaHuntedStatus                         SpecialNPCHuntedStatus;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

