#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VendettaUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "VendettaRuntime_structs.hpp"


namespace SDK
{

// Class VendettaUI.VendettaWidgetBase
// 0x0008 (0x0320 - 0x0318)
class UVendettaWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Vendetta*            CachedVendettaMutator;                             // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BindToMutator_BP();
	void UnbindFromMutator_BP();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VendettaWidgetBase">();
	}
	static class UVendettaWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaWidgetBase>();
	}
};

// Class VendettaUI.VendettaCreditsEarnedMessageWidget
// 0x0000 (0x0320 - 0x0320)
class UVendettaCreditsEarnedMessageWidget final : public UVendettaWidgetBase
{
public:
	void OnPlayerEliminatedBountyTarget(const class AFortPlayerStateAthena* VictimPlayerState, const class AFortPlayerStateAthena* KillerPlayerState, const class AFortPlayerStateAthena* NewTargetPlayerState, int32 VictimRewardValue, int32 VictimBonusValue);
	void OnPlayerEliminatedBountyTarget_BP(const class AFortPlayerStateAthena* VictimPlayerState, const class AFortPlayerStateAthena* KillerPlayerState, const class AFortPlayerStateAthena* NewTargetPlayerState, int32 VictimRewardValue, int32 VictimBonusValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VendettaCreditsEarnedMessageWidget">();
	}
	static class UVendettaCreditsEarnedMessageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaCreditsEarnedMessageWidget>();
	}
};

// Class VendettaUI.VendettaSquadmateHuntedStatusWidget
// 0x0010 (0x0330 - 0x0320)
class UVendettaSquadmateHuntedStatusWidget final : public UVendettaWidgetBase
{
public:
	uint8                                         Pad_320[0x10];                                     // 0x0320(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnPlayerHuntedStatusChanged(class AFortPlayerStateAthena* PlayerState, EVendettaHuntedStatus HuntedStatus, EVendettaHuntedStatus SpecialNPCHuntedStatus);
	void OnPlayerHuntedStatusChanged_BP(EVendettaHuntedStatus HuntedStatus, EVendettaHuntedStatus SpecialNPCHuntedStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VendettaSquadmateHuntedStatusWidget">();
	}
	static class UVendettaSquadmateHuntedStatusWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaSquadmateHuntedStatusWidget>();
	}
};

// Class VendettaUI.VendettaTopMessagingWidgetBase
// 0x0048 (0x0310 - 0x02C8)
class UVendettaTopMessagingWidgetBase final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2C8[0x40];                                     // 0x02C8(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x0308(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VendettaTopMessagingWidgetBase">();
	}
	static class UVendettaTopMessagingWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaTopMessagingWidgetBase>();
	}
};

}

