#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VendettaBountyPuckWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VendettaBountyPuckWidget.VendettaBountyPuckWidget_C
// 0x0040 (0x02A0 - 0x0260)
class UVendettaBountyPuckWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PuckEquipped;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TargetInfo;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_TargetInfo;                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TargetInfoText;                                    // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         EquipAnimationDelay;                               // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VendettaBountyPuckWidget(int32 EntryPoint);
	void ResetWidget();
	void PlayOnEquipAnimation();
	void SetTargetText(const class FText& TargetText, EFortRarity TargetRarity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VendettaBountyPuckWidget_C">();
	}
	static class UVendettaBountyPuckWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendettaBountyPuckWidget_C>();
	}
};

}

