#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VendettaBountyPuckWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function VendettaBountyPuckWidget.VendettaBountyPuckWidget_C.ExecuteUbergraph_VendettaBountyPuckWidget
// 0x0010 (0x0010 - 0x0000)
struct VendettaBountyPuckWidget_C_ExecuteUbergraph_VendettaBountyPuckWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VendettaBountyPuckWidget.VendettaBountyPuckWidget_C.SetTargetText
// 0x0098 (0x0098 - 0x0000)
struct VendettaBountyPuckWidget_C_SetTargetText final
{
public:
	class FText                                   TargetText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EFortRarity                                   TargetRarity;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortColorPalette                      CallFunc_BPGetRarityColorPalette_ReturnValue;      // 0x001C(0x0050)(NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0070(0x0028)()
};

}

