#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_Item_PlayerPickupComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Item_PlayerPickupComponent.PlayerPickupComponent.createPickup
// 0x0028 (0x0028 - 0x0000)
struct PlayerPickupComponent_createPickup final
{
public:
	class UObject*                                __verse_0x9866B8E7_contextObject;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    __verse_0x555FC35C_itemDefinition;                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x41BF06A5_count;                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UVector3*                               __verse_0x621FCC30_location;                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerPickupComponent*                 RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Item_PlayerPickupComponent.PlayerPickupComponent.attemptPartialCollect
// 0x0018 (0x0018 - 0x0000)
struct PlayerPickupComponent_attemptPartialCollect final
{
public:
	class UItemType*                              __verse_0x0F99A7FE_type;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x41BF06A5_count;                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Item_PlayerPickupComponent.PlayerPickupComponent.getNumOfItemType
// 0x0010 (0x0010 - 0x0000)
struct PlayerPickupComponent_getNumOfItemType final
{
public:
	class UItemType*                              __verse_0x0F99A7FE_type;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Item_PlayerPickupComponent.PlayerPickupComponent.getPrimaryItemType
// 0x0008 (0x0008 - 0x0000)
struct PlayerPickupComponent_getPrimaryItemType final
{
public:
	class UItemType*                              RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Item_PlayerPickupComponent.PlayerPickupComponent.givePickupTo
// 0x0008 (0x0008 - 0x0000)
struct PlayerPickupComponent_givePickupTo final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Item_PlayerPickupComponent.PlayerPickupComponent.TossPickup
// 0x0010 (0x0010 - 0x0000)
struct PlayerPickupComponent_TossPickup final
{
public:
	class UVector3*                               __verse_0xAA10FF12_finalLocation;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerComponent*                       __verse_0x03298FE6_owner;                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

