#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_Input_VerseFortniteInputComponent

#include "Basic.hpp"

#include "VerseFortnite_Input_VerseKey_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Input_VerseFortniteInputComponent.VerseFortniteInputComponent.addActionBindingForPlayer
// 0x0040 (0x0040 - 0x0000)
struct VerseFortniteInputComponent_addActionBindingForPlayer final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0x45A29901_name;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 __verse_0x6616878E_description;                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<EVerseKey>                             __verse_0xBE7345F5_keys;                           // 0x0028(0x0010)(Parm, HasGetValueTypeHash)
	class UPulseEvent*                            RetVal;                                            // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Input_VerseFortniteInputComponent.VerseFortniteInputComponent.clearActionBindingsForPlayer
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteInputComponent_clearActionBindingsForPlayer final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Input_VerseFortniteInputComponent.VerseFortniteInputComponent.removeActionBindingForPlayer
// 0x0018 (0x0018 - 0x0000)
struct VerseFortniteInputComponent_removeActionBindingForPlayer final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0x45A29901_name;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};

}

