#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseCore

#include "Basic.hpp"

#include "NetworkPrediction_structs.hpp"


namespace SDK::Params
{

// Function VerseCore.VUIActor.OnDrawHUD
// 0x0010 (0x0010 - 0x0000)
struct VUIActor_OnDrawHUD final
{
public:
	class AHUD*                                   HUD;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvas*                                Canvas;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseCore.VUIActor.OnPossessed
// 0x0008 (0x0008 - 0x0000)
struct VUIActor_OnPossessed final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseCore.VUIActor.OnRep_PlayerController
// 0x0008 (0x0008 - 0x0000)
struct VUIActor_OnRep_PlayerController final
{
public:
	class APlayerController*                      OldPC;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseCore.VUIActor.OnUnPossessed
// 0x0008 (0x0008 - 0x0000)
struct VUIActor_OnUnPossessed final
{
public:
	class APlayerController*                      OldController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseCore.VUIActor.ServerReceiveClientInput
// 0x0018 (0x0018 - 0x0000)
struct VUIActor_ServerReceiveClientInput final
{
public:
	struct FServerReplicationRPCParameter         ProxyParameter;                                    // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VerseCore.VUIActor.GetController
// 0x0008 (0x0008 - 0x0000)
struct VUIActor_GetController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseCore.VUIActor.GetVUIMode
// 0x0004 (0x0004 - 0x0000)
struct VUIActor_GetVUIMode final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseCore.VUIActor.K2_GetSpawnedBrainObject
// 0x0008 (0x0008 - 0x0000)
struct VUIActor_K2_GetSpawnedBrainObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

