#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_Player_PlayerStartComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Player_PlayerStartComponent.PlayerStartComponent.findAllInPlayspaceWithTags
// 0x0028 (0x0028 - 0x0000)
struct PlayerStartComponent_findAllInPlayspaceWithTags final
{
public:
	class UObject*                                __verse_0x9866B8E7_contextObject;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         __verse_0xC3624B24_searchTags;                     // 0x0008(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UPlayerStartComponent*>          RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseFortnite_Player_PlayerStartComponent.PlayerStartComponent.addTags
// 0x0010 (0x0010 - 0x0000)
struct PlayerStartComponent_addTags final
{
public:
	TArray<class FString>                         __verse_0xE77537C1_newTags;                        // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortnite_Player_PlayerStartComponent.PlayerStartComponent.GetPosition
// 0x0008 (0x0008 - 0x0000)
struct PlayerStartComponent_GetPosition final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

