#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_Player_PlayerSpectator

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Player_PlayerSpectator.PlayerSpectator.getPlayersSpectatingTarget
// 0x0018 (0x0018 - 0x0000)
struct PlayerSpectator_getPlayersSpectatingTarget final
{
public:
	class UPlayerComponent*                       __verse_0x3F6E9F5F_target;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayerComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseFortnite_Player_PlayerSpectator.PlayerSpectator.isSpectator
// 0x0010 (0x0010 - 0x0000)
struct PlayerSpectator_isSpectator final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_Player_PlayerSpectator.PlayerSpectator.setSpectator
// 0x0010 (0x0010 - 0x0000)
struct PlayerSpectator_setSpectator final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_Player_PlayerSpectator.PlayerSpectator.spectateKiller
// 0x0010 (0x0010 - 0x0000)
struct PlayerSpectator_spectateKiller final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_Player_PlayerSpectator.PlayerSpectator.spectatePlayer
// 0x0018 (0x0018 - 0x0000)
struct PlayerSpectator_spectatePlayer final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerComponent*                       __verse_0x3F6E9F5F_target;                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

}

