#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_MatchStats

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_MatchStats.MatchStats.getMatchStat
// 0x0008 (0x0008 - 0x0000)
struct MatchStats_getMatchStat final
{
public:
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_MatchStats.MatchStats.getPlayerStat
// 0x0010 (0x0010 - 0x0000)
struct MatchStats_getPlayerStat final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_MatchStats.MatchStats.getTeamStat
// 0x000C (0x000C - 0x0000)
struct MatchStats_getTeamStat final
{
public:
	int32                                         __verse_0x28201082_team;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetVal;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_MatchStats.MatchStats.incrementMatchStat
// 0x000C (0x000C - 0x0000)
struct MatchStats_incrementMatchStat final
{
public:
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8461104C_increase;                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_MatchStats.MatchStats.incrementPlayerStat
// 0x0018 (0x0018 - 0x0000)
struct MatchStats_incrementPlayerStat final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8461104C_increase;                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_MatchStats.MatchStats.incrementTeamStat
// 0x0010 (0x0010 - 0x0000)
struct MatchStats_incrementTeamStat final
{
public:
	int32                                         __verse_0x28201082_team;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8461104C_increase;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_MatchStats.MatchStats.setMatchStat
// 0x0008 (0x0008 - 0x0000)
struct MatchStats_setMatchStat final
{
public:
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x00827935_newValue;                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_MatchStats.MatchStats.setPlayerStat
// 0x0010 (0x0010 - 0x0000)
struct MatchStats_setPlayerStat final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x00827935_newValue;                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_MatchStats.MatchStats.setTeamStat
// 0x000C (0x000C - 0x0000)
struct MatchStats_setTeamStat final
{
public:
	int32                                         __verse_0x28201082_team;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x8C4546BB_statIndex;                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x00827935_newValue;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

