#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_Player_PlayerAttributes

#include "Basic.hpp"

#include "VerseFortnite_Player_PlayerAttribute_structs.hpp"
#include "VerseFortnite_Player_PlayerAttributeOperation_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Player_PlayerAttributes.PlayerAttributes.addToNumericAttribute
// 0x0010 (0x0010 - 0x0000)
struct PlayerAttributes_addToNumericAttribute final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttribute                              __verse_0x8304B4A7_attributeID;                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         __verse_0x63C4C549_amount;                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Player_PlayerAttributes.PlayerAttributes.getNumericAttributeValue
// 0x0010 (0x0010 - 0x0000)
struct PlayerAttributes_getNumericAttributeValue final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttribute                              __verse_0x8304B4A7_attributeID;                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         RetVal;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Player_PlayerAttributes.PlayerAttributes.modifyNumericAttribute
// 0x0010 (0x0010 - 0x0000)
struct PlayerAttributes_modifyNumericAttribute final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttribute                              __verse_0x8304B4A7_attributeID;                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAttributeOperation                     __verse_0xE2CDD607_op;                             // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         __verse_0x63C4C549_amount;                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

