#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Enum VerseFortnite.EPlayerSettingStateInternal
// NumValues: 0x0004
enum class EPlayerSettingStateInternal : uint8
{
	PlayerUseDefault                         = 0,
	PlayerIsAllowed                          = 1,
	PlayerIsDisallowed                       = 2,
	EPlayerSettingStateInternal_MAX          = 3,
};

// ScriptStruct VerseFortnite.ActiveSoundInfo
// 0x0008 (0x0008 - 0x0000)
struct FActiveSoundInfo final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseFortnite.DatastoreEntry
// 0x001C (0x0028 - 0x000C)
struct FDatastoreEntry final : public FFastArraySerializerItem
{
public:
	class FName                                   KeyName;                                           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ValueData;                                         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseFortnite.DatastoreState
// 0x0020 (0x0128 - 0x0108)
struct FDatastoreState final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FDatastoreEntry>                EntriesArray;                                      // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDatastoreComponentBase*                OwningComponent;                                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct VerseFortnite.PlayerScore
// 0x0038 (0x0038 - 0x0000)
struct FPlayerScore final
{
public:
	struct FUniqueNetIdRepl                       Player;                                            // 0x0000(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Eliminations;                                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Wins;                                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Points;                                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VerseFortnite.VMessage
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FVMessage final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct VerseFortnite.VerseActionMapping
// 0x002C (0x0038 - 0x000C)
struct FVerseActionMapping final : public FFastArraySerializerItem
{
public:
	class FName                                   Name;                                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 UIText;                                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           Keys;                                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseFortnite.VerseActionMappingArray
// 0x0018 (0x0120 - 0x0108)
struct FVerseActionMappingArray final : public FFastArraySerializer
{
public:
	TArray<struct FVerseActionMapping>            ActionMappingArray;                                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerseFortniteInputComponentBase*       OwningComponent;                                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

}

