#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_Player_FortPlayerComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Player_FortPlayerComponent.FortPlayerComponent.IsActive
// 0x0018 (0x0018 - 0x0000)
struct FortPlayerComponent_IsActive final
{
public:
	class FString                                 __verse_0xDDCAFCF3_state;                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_Player_FortPlayerComponent.FortPlayerComponent.PopActiveState
// 0x0018 (0x0018 - 0x0000)
struct FortPlayerComponent_PopActiveState final
{
public:
	class FString                                 __verse_0x8F8DC95F_stateToRemove;                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_Player_FortPlayerComponent.FortPlayerComponent.PushActiveState
// 0x0018 (0x0018 - 0x0000)
struct FortPlayerComponent_PushActiveState final
{
public:
	class FString                                 __verse_0xB293443C_stateToAdd;                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

}

