#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortniteFrameworkUI

#include "Basic.hpp"

#include "VerseFortniteFrameworkUI_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteFrameworkUI.VerseFortniteHUDWidgetBase.OnUpdateVisibleState
// 0x0001 (0x0001 - 0x0000)
struct VerseFortniteHUDWidgetBase_OnUpdateVisibleState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteFrameworkUI.HUDScoreboardWidgetBase.OnUpdateRounds
// 0x0008 (0x0008 - 0x0000)
struct HUDScoreboardWidgetBase_OnUpdateRounds final
{
public:
	uint32                                        CurrentRound;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumberOfRounds;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteFrameworkUI.HUDCountDownWidget.OnStartCountDown
// 0x0008 (0x0008 - 0x0000)
struct HUDCountDownWidget_OnStartCountDown final
{
public:
	float                                         SecondsRemaining;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentRound;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteFrameworkUI.VerseFortniteActivatablePanelBase.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct VerseFortniteActivatablePanelBase_OnEnabledChanged final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteFrameworkUI.HUDGameOverWidgetBase.GetGameOverType
// 0x0001 (0x0001 - 0x0000)
struct HUDGameOverWidgetBase_GetGameOverType final
{
public:
	EGameOverMessageType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteFrameworkUI.HUDGameOverWidgetBase.HandleGameOverStateChanged
// 0x0008 (0x0008 - 0x0000)
struct HUDGameOverWidgetBase_HandleGameOverStateChanged final
{
public:
	class UHUDGameOverComponentBase*              GameOverComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteFrameworkUI.HUDSimpleMessageWidget.OnUpdateMessage
// 0x0010 (0x0010 - 0x0000)
struct HUDSimpleMessageWidget_OnUpdateMessage final
{
public:
	class FString                                 NewMessage;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

