#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_Player_PlayerInventory

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Player_PlayerInventory.PlayerInventory.ClearDroppableItems
// 0x0008 (0x0008 - 0x0000)
struct PlayerInventory_ClearDroppableItems final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_Player_PlayerInventory.PlayerInventory.removeFromInventory
// 0x0020 (0x0020 - 0x0000)
struct PlayerInventory_removeFromInventory final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0x2FF42210_assetPath;                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         __verse_0x2867F112_quantity;                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_Player_PlayerInventory.PlayerInventory.tryAddItemToInventory
// 0x0018 (0x0018 - 0x0000)
struct PlayerInventory_tryAddItemToInventory final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    __verse_0x555FC35C_itemDefinition;                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x2867F112_quantity;                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x9D7D8947_notifyPlayerClient : 1;         // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
	FOptionalProperty_                            RetVal;                                            // 0x0015(0x0002)(Parm, OutParm, ReturnParm)
};

// Function VerseFortnite_Player_PlayerInventory.PlayerInventory.tryAddToInventory
// 0x0020 (0x0020 - 0x0000)
struct PlayerInventory_tryAddToInventory final
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0x2FF42210_assetPath;                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         __verse_0x2867F112_quantity;                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x9D7D8947_notifyPlayerClient : 1;         // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};

}

