#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_FortBuildingSettingsComponent

#include "Basic.hpp"

#include "VerseFortnite_PlayerSettingState_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setBuilding
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_setBuilding final
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setBuildingOnWater
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_setBuildingOnWater final
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setEditing
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_setEditing final
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setEditingHostile
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_setEditingHostile final
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setTrapPlacement
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_setTrapPlacement final
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

