#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VerseFortnite_StormController_StormControllerComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_StormController_StormControllerComponent.StormControllerComponent.Exists
// 0x0001 (0x0001 - 0x0000)
struct StormControllerComponent_Exists final
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};

// Function VerseFortnite_StormController_StormControllerComponent.StormControllerComponent.setBattleRoyalePhases
// 0x0058 (0x0058 - 0x0000)
struct StormControllerComponent_setBattleRoyalePhases final
{
public:
	TArray<class UStormPhase*>                    _TEMP_0;                                           // 0x0000(0x0010)(HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_1;                                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_2;                                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_3;                                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_4;                                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_5;                                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_6;                                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_7;                                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_8;                                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStormPhase*                            _TEMP_9;                                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

