#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Violator_ActiveFriends

#include "Basic.hpp"


namespace SDK::Params
{

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Hide
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_CallOut_Hide final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Surface
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_CallOut_Surface final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Violator_ActiveFriends_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.ExecuteUbergraph_Violator_ActiveFriends
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

