#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VUI_VUIBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function VUI_VUIBase.VUIBase.FindObjectOfType
// 0x0010 (0x0010 - 0x0000)
struct VUIBase_FindObjectOfType final
{
public:
	class UClass*                                 __verse_0x0F99A7FE_type;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVUIBase*                               RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.FindObjectsOfType
// 0x0018 (0x0018 - 0x0000)
struct VUIBase_FindObjectsOfType final
{
public:
	class UClass*                                 __verse_0x0F99A7FE_type;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVUIBase*>                       RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.GetAngularVelocity
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_GetAngularVelocity final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.GetPosition
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_GetPosition final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.GetRotation
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_GetRotation final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.GetVelocity
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_GetVelocity final
{
public:
	class UVector3*                               RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.OnPlayerConnect
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_OnPlayerConnect final
{
public:
	class UVUIPlayerController*                   __verse_0x995129C4_Controller;                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.OnPlayerDisconnect
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_OnPlayerDisconnect final
{
public:
	class UVUIPlayerController*                   __verse_0x995129C4_Controller;                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.SetAngularVelocity
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_SetAngularVelocity final
{
public:
	class UVector3*                               __verse_0xAA1ABDC9_rotation;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.SetPosition
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_SetPosition final
{
public:
	class UVector3*                               __verse_0x7AF6BB5D_position;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.SetRotation
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_SetRotation final
{
public:
	class UVector3*                               __verse_0xAA1ABDC9_rotation;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.SetVelocity
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_SetVelocity final
{
public:
	class UVector3*                               __verse_0x069EACF5_velocity;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.SpawnAt
// 0x0018 (0x0018 - 0x0000)
struct VUIBase_SpawnAt final
{
public:
	class UVUIBase*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               __verse_0x7AF6BB5D_position;                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVector3*                               __verse_0xAA1ABDC9_rotation;                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.SpawnVUI
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_SpawnVUI final
{
public:
	class UVUIBase*                               __verse_0x5C20106F_v;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.SphereOverlap
// 0x0028 (0x0028 - 0x0000)
struct VUIBase_SphereOverlap final
{
public:
	class UVector3*                               __verse_0xA82B0967_Position;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __verse_0xE34F9FAC_Radius;                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 __verse_0x0F99A7FE_type;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVUIBase*>                       RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.Tick
// 0x0004 (0x0004 - 0x0000)
struct VUIBase_Tick final
{
public:
	float                                         __verse_0xE346DED5_dt;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.VUI_OnPossess
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_VUI_OnPossess final
{
public:
	class UVUIPlayerController*                   __verse_0x995129C4_Controller;                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VUI_VUIBase.VUIBase.VUI_OnUnpossess
// 0x0008 (0x0008 - 0x0000)
struct VUIBase_VUI_OnUnpossess final
{
public:
	class UVUIPlayerController*                   __verse_0x995129C4_Controller;                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

