#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Water

#include "Basic.hpp"

#include "Water_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Water.BuoyancyComponent.GetLastWaterSurfaceInfo
// 0x0038 (0x0038 - 0x0000)
struct BuoyancyComponent_GetLastWaterSurfaceInfo final
{
public:
	struct FVector                                OutWaterPlaneLocation;                             // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterPlaneNormal;                               // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterSurfacePosition;                           // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutWaterDepth;                                     // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutWaterBodyIdx;                                   // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWaterVelocity;                                  // 0x002C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.BuoyancyComponent.OnPontoonEnteredWater
// 0x0220 (0x0220 - 0x0000)
struct BuoyancyComponent_OnPontoonEnteredWater final
{
public:
	struct FSphericalPontoon                      Pontoon;                                           // 0x0000(0x0220)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Water.BuoyancyComponent.OnPontoonExitedWater
// 0x0220 (0x0220 - 0x0000)
struct BuoyancyComponent_OnPontoonExitedWater final
{
public:
	struct FSphericalPontoon                      Pontoon;                                           // 0x0000(0x0220)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Water.BuoyancyComponent.IsInWaterBody
// 0x0001 (0x0001 - 0x0000)
struct BuoyancyComponent_IsInWaterBody final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.BuoyancyManager.GetBuoyancyComponentManager
// 0x0018 (0x0018 - 0x0000)
struct BuoyancyManager_GetBuoyancyComponentManager final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuoyancyManager*                       Manager;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function Water.NiagaraWaterFunctionLibrary.SetWaterBody
// 0x0020 (0x0020 - 0x0000)
struct NiagaraWaterFunctionLibrary_SetWaterBody final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverrideName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWaterBody*                             WaterBody;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetRiverToLakeTransitionMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetRiverToLakeTransitionMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetRiverToOceanTransitionMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetRiverToOceanTransitionMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetUnderwaterPostProcessMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetUnderwaterPostProcessMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetWaterMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetWaterMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.OnWaterBodyChanged
// 0x0002 (0x0002 - 0x0000)
struct WaterBody_OnWaterBodyChanged final
{
public:
	bool                                          bShapeOrPositionChanged;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeightmapSettingsChanged;                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetExclusionVolumes
// 0x0010 (0x0010 - 0x0000)
struct WaterBody_GetExclusionVolumes final
{
public:
	TArray<class AWaterBodyExclusionVolume*>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetIslands
// 0x0010 (0x0010 - 0x0000)
struct WaterBody_GetIslands final
{
public:
	TArray<class AWaterBodyIsland*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetWaterMeshComponents
// 0x0010 (0x0010 - 0x0000)
struct WaterBody_GetWaterMeshComponents final
{
public:
	TArray<class UStaticMeshComponent*>           ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBody.GetWaterSpline
// 0x0008 (0x0008 - 0x0000)
struct WaterBody_GetWaterSpline final
{
public:
	class UWaterSplineComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterBodyIsland.GetWaterSpline
// 0x0008 (0x0008 - 0x0000)
struct WaterBodyIsland_GetWaterSpline final
{
public:
	class UWaterSplineComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterMeshComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterMeshComponent_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetShallowWaterMaxDynamicForces
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetShallowWaterMaxDynamicForces final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetShallowWaterMaxImpulseForces
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetShallowWaterMaxImpulseForces final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetShallowWaterSimulationRenderTargetSize
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetShallowWaterSimulationRenderTargetSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.PrintToWaterLog
// 0x0018 (0x0018 - 0x0000)
struct WaterSubsystem_PrintToWaterLog final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarning;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function Water.WaterSubsystem.SetOceanFloodHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_SetOceanFloodHeight final
{
public:
	float                                         InFloodHeight;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetCameraUnderwaterDepth
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetCameraUnderwaterDepth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetOceanBaseHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetOceanBaseHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetOceanFloodHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetOceanFloodHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetOceanTotalHeight
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetOceanTotalHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.GetSmoothedWorldTimeSeconds
// 0x0004 (0x0004 - 0x0000)
struct WaterSubsystem_GetSmoothedWorldTimeSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.IsShallowWaterSimulationEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterSubsystem_IsShallowWaterSimulationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.IsUnderwaterPostProcessEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterSubsystem_IsUnderwaterPostProcessEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Water.WaterSubsystem.IsWaterRenderingEnabled
// 0x0001 (0x0001 - 0x0000)
struct WaterSubsystem_IsWaterRenderingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

