#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: XpBarToolTip

#include "Basic.hpp"


namespace SDK::Params
{

// Function XpBarToolTip.XpBarToolTip_C.GetHeaderText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetHeaderText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function XpBarToolTip.XpBarToolTip_C.GetCommanderXPText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetCommanderXPText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function XpBarToolTip.XpBarToolTip_C.GetBoostXPText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetBoostXPText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function XpBarToolTip.XpBarToolTip_C.GetRestedXPText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetRestedXPText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function XpBarToolTip.XpBarToolTip_C.GetBodyText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetBodyText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

}

